{"3620": {"name": "Zuma's Revenge!", "appid": "3620", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": "\n\t\t\t\t\tAn irresistible force has taken our fearless frog to an island where the ribbeting puzzle-action of Zuma has evolved in amazing ways… but evil spirits and tenacious tiki bosses rule the land!\n\t\t\t\t\t<p>Survive the ire of the island by firing stone spheres to destroy the deadly stream of balls. Conquer over 60 levels by staying sharp and avoiding hidden traps. Slide and hop for smarter shots; hit targets for exotic bonuses; detonate new power-up balls; battle six imposing tiki bosses and guide your agile amphibian to victory in four all new game modes! Will you succumb to the perilous pitfalls, or can you tame the jungle in this PopCap ball-blasting challenge?</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Conquer over 60 levels and defeat six mini-game Boss Battles \n\t\t\t\t\t<li>Score explosive power-ups including three new shots\n\t\t\t\t\t<li>Explore new gameplay like lily-pad hopping, slide-aiming, and more\n\t\t\t\t\t<li>Take a shot at 70 all-new Challenges in the Jungle of Mystery, Quiet Village, Lost City and Mosquito Coast. \n\t\t\t\t\t<li>Run the Iron Frog gauntlet — beat 10 levels in a row!\n\t\t\t\t\t<li>Turn up the heat in Heroic Frog mode\n\t\t\t\t\t<li>Enjoy amazing graphics and effects that bring Zuma into the modern world of gaming\n\t\t\t\t\t</ul>\n\t\t\t\t\t"}, "960": {"name": "Team Fortress 2: Meet the Heavy", "appid": "960", "is_free": false, "publishers": ["Valve"], "detailed_description": "<p>\n\t\t\t\t\t<p>Meet the Heavy Weapons Guy, one of nine playable character classes in Team Fortress 2:  </p>\n\t\t\t\t\t<p><b>Name:</b> Heavy Weapons Guy<br><b>Role:</b> Defense<br><b>Weapons:</b> Chain Gun / Shotgun / Giant Fists <br></p>\n\t\t\t\t\t<p>Like a hibernating bear, the Heavy appears to be a gentle giant. Also like a bear, confusing his deliberate, sleepy demeanor with gentleness will get you ripped limb from limb. Though he speaks simply and moves with an economy of energy that's often confused with napping, the Heavy isn't dumb, he's not your big friend, and he generally wishes you'd just shut up before he has to make you shut up.</p></p>"}, "3720": {"name": "Evil Genius", "appid": "3720", "is_free": false, "publishers": ["Rebellion"], "detailed_description": "<p>Everybody wants to rule the world! Achieve global power with EVIL GENIUS, the one and only complete world domination simulator. All the everyday tasks of the deliciously wicked mastermind are available to experience and master from building your ultra-secret base to developing spectacular super-weapons to carry out your nefarious master plan. How evil are you?</p>\n\t\t\t<ul>\n\t\t\t<li>Choose from 3 notorious Evil Genius characters to serve as your icon and represent you in your quest for power.</li>\n\t\t\t<li>Create the ultimate doomsday device and use it to achieve total global domination.</li>\n\t\t\t<li>Create your lair with over 300 items including kung fu academies, rocket caverns, and laboratories.</li>\n\t\t\t<li>Use ingenious traps and wicked 'interrogation' devices to toy with and dispatch obnoxious overdressed government agents.</li>\n\t\t\t<li>Manage your minions as you train them in treacherous trades such as experimental research programs, heavy weapons usage, and international sabotage.</li>\n\t\t\t<li>Recruit dastardly henchmen to patrol your base, take out your enemies, and undertake outrageous missions to increase your power and notoriety.</li>\n\t\t\t</ul>"}, "2810": {"name": "X3: Reunion", "appid": "2810", "is_free": false, "publishers": ["Egosoft"], "detailed_description": "The Sequel to the award winning X²: The Threat introduces a new 3D engine as well as a new story, new ships and a new gameplay to greatly increase the variety in the X-universe. The economy of X³: Reunion is more complex than anything seen in the X-universe before. Factories are being built by NPCs, wars can affect the global economy, NPCs can trade freely and pirates behave far more realistically.<br />\r\n\t\t\t\t\tThe Technology: Extensive development has gone into the X³ engine, making full use of DirectX 9 technology, to create dramatic visual effects and stunningly realistic starships. Coupled with the massively enhanced A.L. (Artificial Life) system, X³: REUNION presents players with an ever changing, evolving universe; where a player's actions really can shape the future of the universe.<br />\r\n\t\t\t\t\tThe new X³ 2.0: Bala Gi Research Missions: The X³ 2.0: Bala Gi Research Missions offers a host of new features and missions, allowing the player to delve deeper than ever before into the X universe.<br />\r\n\t\t\t\t\tSpace just got a whole lot bigger with the addition of two new sectors and the introduction of the gargantuan Player HQ which allows many exciting new features including the ability to build your own ships and even give them customized space paint finishes.  In addition to the new M7 battleship, there is an assortment of new weapons and onboard ship devices to use and explore."}, "3910": {"name": "Sid Meier's Civilization® III Complete", "appid": "3910", "is_free": false, "publishers": ["2K Games"], "detailed_description": "Sid Meier's Civilization III: Complete, the latest offering in the Sid Meier's Civilization III franchise, provides gaming fans with Sid Meier's Civilization III, the highly-addictive journey of discovery, combined with the updated and enhanced multiplayer expansion pack Sid Meier's Civilization III: Play the World*, as well as all of the great new civilizations, scenarios, and features from Sid Meier's Civilization III: Conquests! Sid Meier's Civilization III: Complete provides more ways to explore, more strategies to employ, more modes of play, and more ways to win, all in one box!<br />\n<br />\n*Online Multiplayer to be suspended as of May 31st 2014, LAN mode still supported"}, "2120": {"name": "Dark Messiah Singleplayer Demo", "appid": "2120", "is_free": true, "publishers": ["Ubisoft"], "detailed_description": "<p>Discover a new breed of Action-RPG game powered by an enhanced version of the Source&trade; Engine by Valve. Set in the Might & Magic&reg; universe, players will experience ferocious combat in a dark and immersive fantasy environment.  Swords, Stealth, Sorcery. Choose your way to kill.</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li><span class=\"copyHead\">Cutting-edge technology:</span> Experience an enhanced version of the famous Source&trade; Engine created by Valve. Discover the fresh perspective of a view with complete body awareness, realistic movements, physics rendering, and a complete first-person melee combat system in a fantasy setting.</li> \n\t\t\t\t\t<li><span class=\"copyHead\">Never-ending action:</span> Challenge the forces of evil in 12 huge levels and learn to master over 30 weapons and an arsenal of devastating spells.</li>\n\t\t\t\t\t<li><span class=\"copyHead\">Evolve your character:</span> Extend your gameplay experience without being limited to a single discipline. Learn powerful new spells and attacks using Dark Messiah's unique Skill Evolution System as you progress through the game.</li>\n\t\t\t\t\t<li><span class=\"copyHead\">Revolutionary multiplayer mode:</span> Get ready to battle with up to 32 players in the revolutionary Crusade mode, which will enable players to gain experience and new skills across dynamic online campaigns. Enlist with the humans or the undead and choose among five complementary character classes.</li> </ul><br><span style=\"color: #909090;\">&copy; 2006 Ubisoft Entertainment.  All Rights Reserved.  Dark Messiah, Might and Magic, Ubisoft and the Ubisoft logo are trademarks of Ubisoft Entertainment in the U.S. and/or other countries.  Developed by Arkane Studios.</span>"}, "3900": {"name": "Sid Meier's Civilization® IV", "appid": "3900", "is_free": false, "publishers": ["2K Games"], "detailed_description": "With over 6 million units sold and unprecedented critical acclaim from fans and press around the world, Sid Meier's Civilization is recognized as one of the greatest PC game franchises of all-time. Now, Sid Meier and Firaxis Games will take this incredibly fun and addictive game to new heights by adding new ways to play and win, new tools to manage and expand your civilization, all-new easy to use mod capabilities and intense multiplayer modes and options*. Civilization IV will come to life like never before in a beautifully detailed, living 3D world that will elevate the gameplay experience to a whole new level. Civilization IV has already been heralded as one of the top ten games of 2005, and a must-have for gamers around the globe!<br><br><strong>*Mac version's Online Multiplayer is no longer supported.</strong>"}, "1540": {"name": "Multiwinia Demo", "appid": "1540", "is_free": true, "publishers": ["Introversion Software"], "detailed_description": ""}, "4900": {"name": "Zen of Sudoku", "appid": "4900", "is_free": false, "publishers": [""], "detailed_description": "<p>From the creators of <a href=\"http://store.steampowered.com/app/90002/\">Natural Selection</a> comes Zen of Sudoku, a relaxing, easy to play version of Sudoku for your PC.</p>\n<ul>\n<li>Relax with hand-painted Japanese-styled backgrounds, no timer and lush natural soundscapes.</li>\n<li>Stimulates your brain to keep it healthy and alert.</li>\n<li>Teaches you the basics of Sudoku through advanced strategies like \"naked pairs\", \"x-wing\" and \"locked candidates\".</li>\n<li>Play unlimited puzzles, print them to finish offline and enter custom puzzles from other sources.</li>\n<li>Unlock trophies, backgrounds and more.</li>\n</ul>\n<p>This product includes portions of the <a href=\"http://developer.popcap.com/\">PopCap Games Framework</a>.</p>"}, "4320": {"name": "STAR TREK®: D-A-C", "appid": "4320", "is_free": false, "publishers": ["Paramount Digital Entertainment"], "detailed_description": "Star Trek®: D-A-C is a fast-paced, top-down space shooter inspired by the new motion picture.  This pick-up and play game allows you and your friends to choose from five classes of starships (including the all-new U.S.S. Enterprise flagship class) and battle it out online!  Command the large and durable Flagship, the nimble Fighter, the devastating Bomber, the indispensable Support Frigate, or obliterate hostiles with the powerful Missile Cruiser.  Each ship class has their own unique strengths and capabilities. But be careful, as each of these classes also have their weaknesses, and only the best commanders will be able to minimize these shortcomings.  Enlist in Starfleet or join the Romulan Empire as you battle with up to 11 friends. Engage the enemy in unique game play modes, including: Online Versus, Online Co-op, and Survival mode, a single player experience that pits the player against wave after wave of Romulan enemies and features exciting new Super Special Pickups, unique enemy ship classes, and more. Choose your side, fire your weapons, boldly go!<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>12 player multiplayer – Featuring 4 gameplay modes and detailed Stat Tracking: Survival Mode, Death-match, Assault, Conquest<br>\t\t\t\t\t</li><li>Play against the computer alone or cooperatively with friends<br>\t\t\t\t\t</li><li>Variety of Powerups &amp; Special Pickups<br>\t\t\t\t\t</li><li>Five ship classes, Support Frigate, Missile Cruiser, Fighter, Bomber, and Flagship <br>\t\t\t\t\t</li><li>New user-customizable match settings<br>\t\t\t\t\t</li><li>Improved graphics, animations and controls<br>\t\t\t\t\t</li></ul>"}, "920": {"name": "Dark Messiah: Assassin", "appid": "920", "is_free": false, "publishers": ["Ubisoft"], "detailed_description": ""}, "4890": {"name": "Cossacks II: Battle for Europe", "appid": "4890", "is_free": false, "publishers": ["GSC World Publishing"], "detailed_description": "<p>Let the battle begin! The Cossacks II: Battle for Europe add-on continues the renowned Cossacks II:Napoleonic Wars game. It depicts the rather short historic period of the Napoleonic wars. The Napoleon wars changed Europe forever, leading to the formation of empires and putting an end to almost one thousand years of constant strife between small states. The game provides mass-scale battles between thousands-strong armies of the nations involved in conflicts during this period. The theatres of operation introduce France, Britain, Austria, Russia, Prussia, Egypt, and three nations not represented in the original game – Spain, the Grand Duchy of Warsaw (Poland), and the Confederation of the Rhine.</p>\n\t\t\t\t\t\t<p>The Cossacks II: Battle for Europe reconstructs in detail the soldiers' uniforms weapons and architecture of each nation. Each nation's army has its unique units and possibilities. The game includes over 180 units 190 buildings and 1200 flora and fauna elements. When developing the combat system the peculiarities of early 19th century warring were taken into account as was the value of formations provisions and troop morale. Tactical tricks utilized by military commanders of the time are fully reflected in the game. An \"honest\" system of bullet and cannonball ballistics based on physics is an innovative addition to the Cossacks engine. Other engine features include 3-dimensional landscaping which creates realistic-looking scenery and towns and impacts combat tactics. For example the firing range of a subdivision of soldiers or a cannon positioned at the top of a hill is greater than the firing range of a unitstationed on flat terrain.</p> \n\t\t\t\t\t\t<h2>Key features:</h2>\n\t\t\t\t\t\t<ul>\n\t\t\t\t\t\t<li>Control the French, Russians, Austrians, Britons, Prussians, or Egyptians -- master new weapons and tactics during a time that redefined the meaning of modern warfare.\n\t\t\t\t\t\t<li>Fight through historically inspired battles of the 19th century, with massive armies colliding in different types of terrain and weather.\n\t\t\t\t\t\t<li>Battles on real historical scale with tens of thausands of units on one map.\n\t\t\t\t\t\t<li>Realistic Troop Morale System - Well-fed troops live longer and grow in experience to become valuable battlefield assets, while fierce and overwhelming opponents, or marching long distances will cause morale to drop\n\t\t\t\t\t\t<li>Enhanced diplomacy tools help you create treaties that give you the advantages\n\t\t\t\t\t\t</ul>"}, "3000": {"name": "GTI Racing", "appid": "3000", "is_free": false, "publishers": ["Techland"], "detailed_description": "GTI Racing uniquely blends a realistic and highly detailed car physics simulation with the pure fun of driving in a very dynamic way. Grab the wheel, push the pedal to the metal and gather the sensation for the incredible sense of speed and the power of all the real world cars.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Realistic driving model: Lifelike car physics reflect the pure enjoyment of dynamic car driving using some of the best dynamic physics around. Detailed handling model with carefully adjusted parameters give you full control of the car and an incredible ease of driving whilst still being very fun to drive.<br>\t\t\t\t\t</li><li>Cars: GTI Racing gives you the biggest collection of the legendary European Volkswagen Golf series cars. Choose one of the 15 GOLF models, representing all five generations from its original heritage through to the current day. Try out the GTI, G60 and the outstanding R32! Check out Volkswagens hottest concept cars and classics - along with the original Beetle and T1 &quot;Samba&quot; transporter.<br>\t\t\t\t\t</li><li>Tuning: GTI Racing introduces you to the professional car customization world, thanks to the impressive and wide array of original visual and performance modding and tuning parts. Spoilers, xenon lights, wide body kits, exhausts and rims - everything you would ever need or desire for the visual aspect of tuning your car. Turbo's, nitro`s, sports transmissions, performance brake kits and wide tires - unlimited performance tuning possibilities.<br>\t\t\t\t\t</li><li>Career: Over 70 races in 6 unique settings and scenarios against challenging AI opponents will keep the heat on. Time trial, Drift competition and Drag racing, wild Baja and new Legal Race modes. Finish all 25 Championships located in Germany, France, Italy, UK and USA, earn money and spend it on your ride!<br>\t\t\t\t\t</li><li>Dynamic race surroundings: GTI Racing introduces a new level of intensity into the world of racing thanks to fully physics simulated hundreds of objects on the tracks. Use fully interactive objects to create your advantage - slow down your opponents or disable their cars completely.<br>\t\t\t\t\t</li><li>Demanding AI: drivers make full use of the driving and collision physics model. They will cut you off, run you off the road, use shortcuts to get to the finish line first, so be on your guard and watch out for them.<br>\t\t\t\t\t</li><li>Detailed car damage: every contact you make with and object or form of racing collision will leave a dent on your vehicle! Based on Xpand Rally experiences highly detailed damage and mechanical car part stress models this has ben used to great effect to enhance the experience with a very rich flavor!<br>\t\t\t\t\t</li><li>Online drive: Race through LAN or on the Internet. Extremely playable Baja mode, closed circuits, highways, drift driving competitions and drag racing championship which will give the multi player racer something to shout about. Intense 4 player racing and action in each race.</li></ul>"}, "1630": {"name": "Disciples II: Rise of the Elves ", "appid": "1630", "is_free": false, "publishers": ["Strategy First"], "detailed_description": "<p>The award-winning series Disciples introduced a milestone in the game's very successful history; the introduction of a new race: The Elves. The Elven Race added a new dimension to the game and added countless hours of gameplay.</p>\n\t\t\t\t\t   <p>Now that series has expanded further with Disciples II: Rise Of The Elves. This version features all of the campaigns found in the original and a brand new campaign that continues the storyline of the Elven Race. It also includes 14 new skirmish maps to test hone your skills.</p>\n\t\t\t\t\t   <h2>Key features</h2>\n\t\t\t\t\t   <ul>\n\t\t\t\t\t\t    <li>New campaign that continues the Elven Storyline \n\t\t\t\t\t\t    <li>14 new skirmish maps to test gamer's skills \n\t\t\t\t\t\t    <li>5 playable races to choose from; the Empire; the Undead Hordes, the Mountain Clans, the Legions of the Damned, and the Elven Alliance \n\t\t\t\t\t\t    <li>The Elven tech tree allows players to choose between Noble or Wild Elves increasing replayability \n\t\t\t\t\t\t    <li>Over 200 individually animated unit types and over 100 different spells \n\t\t\t\t\t\t    <li>Scenario editor to create your own adventures \n\t\t\t\t\t\t    <li>Battle friends and enemies in multiplayer over LAN, Internet or Hot-Seat play \n\t\t\t\t\t   </ul>\n\t\t\t\t\t  "}, "4880": {"name": "Cossacks: European Wars", "appid": "4880", "is_free": false, "publishers": ["GSC World Publishing"], "detailed_description": "<p>Cossacks: European Wars is a historical real-time strategy based on events of the 16th through the 18th centuries in Europe, when nations and states were created and demolished, and wars shed seas of blood. There are 16 nations or regions in Cossacks: Algeria, Austria, England, France, the Netherlands, Piemonte, Poland, Portugal, Prussia, Russia, Saxony, Spain, Sweden, Turkey, Ukraine, and Venice. Each has its own original graphics, economic and technical development peculiarities, military advantages and drawbacks, and unique units and technologies, providing vast choices of tactics and strategy in war against any enemy. Thus, England is the mightiest sea power, Austria has powerful light and heavy cavalry, and Cossacks are the pride of the Ukrainian army.\n\t\t\t\t\t\t<br>\n\t\t\t\t\t\tBattles of up to 8,000 units may be conducted on single or network game maps. One can carry out lingering city sieges, wage guerilla wars, capture commanding heights and arrange ambushes, deploy landing forces on enemy shores, and conduct sea battles. The game system is arranged to reduce per-unit control and resource micromanagement, and to turn to global goals of powerful economy formation, science development, the capturing of new lands, and defending borders.</p> "}, "4580": {"name": "Warhammer® 40,000: Dawn of War® - Dark Crusade", "appid": "4580", "is_free": false, "publishers": ["SEGA"], "detailed_description": "<h1>Reviews</h1><p><img src=\"http://cdn.akamai.steamstatic.com/steam/apps/4580/extras/DOW2_DARKCRUSADE_STEAM_BANNER_616x616.jpg?t=1447351078\" ></p><br><h1>About the Game</h1>Deep under the central desert of Kronus, a vast honeycomb of skull-lined tunnels and funeral chambers house the awakening Necron menace. Eons ago, these were the boulevards and squares of a great necropolis built to house the bones of the races who had fallen to the Necrons, and ultimately were where the Necrons themselves retire to spend eternity. Over millions of years, sand and rock had covered it all until ill-fated excavations awoke the deathless. <br>Play any of seven races, striving for control over Kronus. Take other races' strongholds by winning challenging battles on various maps individually associated with the respective strongholds. <br><br><ul class=\"bb_ul\"><li><strong>New Races</strong><br>Take command of two new playable races: Tau and Necron to unleash massive carnage across the frontlines of battle.<br><br></li><li><strong>Expanded multiplayer</strong><br>Dominate opponents online across 12 new multiplayer maps - with up to 8 players battling it out for supremacy.<br><br></li><li><strong>Deep single player campaign</strong><br>Conquer the planet of Kronus any way you choose - leading any one of seven races on an epic crusade through an all-new, non-linear single player campaign where you can experience unique storylines from each race's perspective.<br><br></li><li><strong>Customization</strong><br>Customize your hero's weapons, items and abilities as he grows in power and influence. Personalize your army with a variety of insignias, squad colors, banners and names.</li></ul>"}, "1920": {"name": "Two Worlds", "appid": "1920", "is_free": false, "publishers": ["Topware Interactive"], "detailed_description": "<ul>\n\t\t\t\t\t<li>Offering a freedom of choice unseen in other Role Playing Games. The world literally comes to life as it immediately reacts to the player's actions and changes accordingly -offering new and exciting challenges.</li>\n\t\t\t\t\t<li>Strong, non-linear storyline. Players can shape their own story by choosing the path of conducting the main conflict and resolving meaningful side-quests.</li>\n\t\t\t\t\t<li>Spectacular and dynamically choreographed fights. The combat system combines intuitive steering, tactical challenges and movie-like visual experiences.</li>\n\t\t\t\t\t<li>Free and unlimited character development. Players can experiment with different careers and even reverse their former choices with the help of \"career changers\".</li>\n\t\t\t\t\t<li>Animals to be ridden on. Players can travel and fight on various animals from horses to tamed lizards and beasts.</li>\n\t\t\t\t\t<li>A choice of traps and snares are at the Player's disposal making the gameplay both rich and flexible.</li>\n\t\t\t\t\t<li>Huge variety of items to be found. Randomly generated pieces of equipment, thematic sets and combined items offer the space to experiment and satisfy the need to collect.</li>\n\t\t\t\t\t<li>Wide range of beautifully rendered terrains: from high mountains to seashores and deep caves with all of the locations featuring ultra sharp texturing and stunning design.</li>\n\t\t\t\t\t<li>Hyper-realistic tree physics and sophisticated weather system make the world come to life as has never been seen before.</li>\n\t\t\t\t\t<li>Advanced Artificial Intelligence that manages group behaviour of large virtual communities.</li>\n\t\t\t\t\t<li>Up to 8 players in the multiplayer mode.</li>\n\t\t\t\t\t<li>Symphonic music to make the experience more emotional and memorable.</li>\n\t\t\t\t\t<li>Extensive usage of Pixel Shader 2.0 and 3.0, HDR, multiple materials and unique shadow engine to ensure the best visuals possible.</li></ul>"}, "400": {"name": "Portal", "appid": "400", "is_free": false, "publishers": ["Valve"], "detailed_description": "<p>Portal&trade; is a new single player game from Valve. Set in the mysterious Aperture Science Laboratories, Portal has been called one of the most innovative new games on the horizon and will offer gamers hours of unique gameplay.</p>\r\n\t\t\t\t\t<p>The game is designed to change the way players approach, manipulate, and surmise the possibilities in a given environment; similar to how Half-Life&reg; 2's Gravity Gun innovated new ways to leverage an object in any given situation.</p>\r\n\t\t\t\t\t<p>Players must solve physical puzzles and challenges by opening portals to maneuvering objects, and themselves, through space.</p>\r\n\t\t\t\t\t"}, "3590": {"name": "Plants vs. Zombies GOTY Edition", "appid": "3590", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": "<img src=\"http://cdn.edgecast.steamstatic.com/steam/apps/3590/extras/PvZ_background.jpg?t=1447351772\" ><br><br>Zombies are invading your home, and the only defense is your arsenal of plants! Armed with an alien nursery-worth of zombie-zapping plants like peashooters and cherry bombs, you'll need to think fast and plant faster to stop dozens of types of zombies dead in their tracks. Obstacles like a setting sun, creeping fog and a swimming pool add to the challenge, and with five game modes to dig into, the fun never dies!<h2 class=\"bb_tag\">Features</h2>                    <ul class=\"bb_ul\"><li>Play five game modes: Adventure, Mini-Games, Puzzle, Survival, plus the stress-free Zen Garden<br>                    </li><li>Conquer all 50 levels of Adventure mode \u0097 through day, night, and fog, in a swimming pool and on the rooftop<br>                    </li><li>Battle 26 types of zombies including pole-vaulters, snorkelers and \u0093Zomboni\u0094 drivers<br>                    </li><li>Earn 49 powerful perennials and collect coins to buy a pet snail, power-ups and more!<br>                    </li><li>Open the Almanac to see all the plants and zombies, plus amusing \u0093facts\u0094 and quotes<br>                    </li><li>Browse Crazy Dave\u0092s shop for special plants and tools to stem any zombie assault<br>                    </li><li>Amazing graphics and soundtrack, plus a bonus music video<br>                    </li><li>Infinite replayability: the game is never the same experience twice!<br>                    </li><li>Unlock all the Steam Achievements<br>                    </li></ul>"}, "1900": {"name": "Earth 2160", "appid": "1900", "is_free": false, "publishers": ["Topware Interactive", "ACE"], "detailed_description": "After the destruction of the EARTH in 2150, the leaders of the Eurasian Dynasty escaped on board an evacuation fleet. Now they are fighting for the survival of the human species. Their base is one large building comprising of smaller variable parts. The Lunar Corporation is already on the Red Planet and has to fight to find a new base and home after the destruction of the Earth. LC buildings are built one on top of the other, similar to a skyscraper, but with one big difference - they have the ability to defy all the laws of gravity to move quickly to a new location.<br><br>The UCS (United Civilized States) machines evolved from the UCS battle machines. During the long flight to Mars, the computer decided to kill all human survivors and then initiated a plan to conquer the solar system with its own mechanical army. The Aliens - alien renegades were imprisoned a long ago, deep in the unknown history of Mars. <br><br>In 2160 the landing of the UCS ships awoke them from their long sleep...<br><br><img src=\"http://cdn.edgecast.steamstatic.com/steam/apps/1900/extras/E2160_awards2.png?t=1478034392\" ><br><strong><h2 class=\"bb_tag\">GAME FEATURES:</h2></strong><br><ul class=\"bb_ul\"><li>4 playable parties with different basic technologies and abilities<br></li><li>Each party consists of more than 13 basic buildings and more than 13 basic units<br></li><li>4 single player campaigns, each with 7 missions<br></li><li>Skirmish mode with 10 maps<br></li><li>4 Multiplayer modes with 10 maps<br></li><li>Realistic, formable and multi-textured terrain<br></li><li>12 virtual agents with special abilities<br></li><li>Multiplayer matches for up to 8 players per match<br></li><li>EarthC (programming language) SDK for Mod teams<br></li><li>Rich musical score consists of 29 dynamically varyied tracks<br></li><li>Includes Superstorm, Platinum and Titanium Map Pack</li></ul>"}, "4820": {"name": "Heroes... Multiplayer Demo", "appid": "4820", "is_free": true, "publishers": ["GSC Game World"], "detailed_description": ""}, "3410": {"name": "Heavy Weapon Deluxe", "appid": "3410", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": "<p>It's shoot-'em-up arcade action at its best! Use an incredible assortment of heavy artillery to blast away enemy tanks and planes, and fight your way to victory. What are you waiting for? Pull yourself up by your bootstraps and get into the action!</p>\n                    <ul>\n                    <li>Blast your way through 19 missions packed with peril.</li>\n                    <li>Two action-packed game modes: Mission and Survival.</li>\n                    <li>Enhanced sound effects and an original soundtrack!</li>\n                    </ul>"}, "1640": {"name": "Disciples II: Gallean's Return", "appid": "1640", "is_free": false, "publishers": ["Strategy First"], "detailed_description": "<p><strong>Disciples II: Gallean's Return</strong> is a compilation edition that includes the base game, <i>Disciples II: Dark Prophecy</i>, plus the two standalone expansions <i>Disciples II: Guardians of the Light</i> and <i>Disciples II: Servants of the Dark</i>.\n\t\t\t\t\t <br>\n\t\t\t\t\t <p><strong>Disciples II: Guardians of the Light</strong> is a stand-alone expansion that lets you dive into the fantastical world of Disciples II as either the Empire or the Mountain Clans.</p>\n\t\t\t\t\t <p>The Empire is decaying from within as self-proclaimed rulers struggle for control of the now vacant throne while a cruel Inquisition sweeps across the human lands, causing rebellion and misery. Meanwhile the Clans, recovering from their near-destruction, begin to reunite their tribes. They have received divine instructions and now seek to uncover an ancient ritual that will let them communicate with their god, Wotan.</p>\n\t\t\t\t\t <p><strong>Disciples II: Servants of the Dark</strong> is a stand-alone expansion that brings you into the never-ending quest for supremacy as either the Undead Hordes or the Legions of the Damned.</p>\n\t\t\t\t\t <p>On the dark side, the Legions of the Damned enact a plan to spread Bethrezen’s plague across Nevendaar. They sense the threat brought about by the rebirth of the Elven god and will stop at nothing to steal this power for their own purposes. Perhaps most pivotal to the conflict, however, is Mortis and her army of Undead Hordes. After all, the rebirth of her husband Gallean was her doing. He had rejected her for what she had become, a twisted, heartless beast. Now she would teach her mate a lesson... one that would scar his people for eternity...</p>\n\t\t\t\t\t <h2>Features</h2>\n\t\t\t\t\t <ul>\n\t\t\t\t\t\t <li>Random map generator\n\t\t\t\t\t\t <li>Multiple resolution support\n\t\t\t\t\t\t <li>High level unit AI support\n\t\t\t\t\t\t <li>Improved computer AI\n\t\t\t\t\t\t <li>Improved editor\n\t\t\t\t\t\t <li>Improved UI\n\t\t\t\t\t\t <li>Auto-Resolve Combat mode\n\t\t\t\t\t\t <li>Player can capture capitals\n\t\t\t\t\t\t <li>Direct 3D support for improved performance\n\t\t\t\t\t\t <li>Enhanced chat interface\n\t\t\t\t\t\t <li>Support for large maps, 120x120 and 144x144\n\t\t\t\t\t\t <li>All the updates for Disciples II: Dark Prophecy\n\t\t\t\t\t\t <li>2 new high-level mini campaigns and original Disciples II campaigns\n\t\t\t\t\t\t <li>16 skirmish/multiplayer maps including 10 never-before-seen maps\n\t\t\t\t\t\t <li>3 new special characters\n\t\t\t\t\t\t <li>New capital backgrounds\n\t\t\t\t\t\t <li>New battle backgrounds\n\t\t\t\t\t\t <li>Four new music tracks\n\t\t\t\t\t\t <li>Exclusive portfolio containing original concept art and sketches\n\t\t\t\t\t </ul>\n\t\t\t\t\t"}, "730": {"name": "Counter-Strike: Global Offensive", "appid": "730", "is_free": false, "publishers": ["Valve"], "detailed_description": "Counter-Strike: Global Offensive (CS: GO) will expand upon the team-based action gameplay that it pioneered when it was launched 14 years ago.<br />\r\n<br />\r\nCS: GO features new maps, characters, and weapons and delivers updated versions of the classic CS content (de_dust2, etc.). In addition, CS: GO will introduce new gameplay modes, matchmaking, leader boards, and more.<br />\r\n<br />\r\n&quot;Counter-Strike took the gaming industry by surprise when the unlikely MOD became the most played online PC action game in the world almost immediately after its release in August 1999,&quot; said Doug Lombardi at Valve. &quot;For the past 12 years, it has continued to be one of the most-played games in the world, headline competitive gaming tournaments and selling over 25 million units worldwide across the franchise. CS: GO promises to expand on CS' award-winning gameplay and deliver it to gamers on the PC as well as the next gen consoles and the Mac.&quot;"}, "2310": {"name": "QUAKE", "appid": "2310", "is_free": false, "publishers": ["id Software"], "detailed_description": "Rage through 32 single player levels and 6 deathmatch levels of sheer terror and fully immersive sound and lighting. Arm yourself against the cannibalistic Ogre, fiendish Vore and indestructible Schambler using lethal nails, fierce Thunderbolts and abominable Rocket and Grenade Launchers."}, "70": {"name": "Half-Life", "appid": "70", "is_free": false, "publishers": ["Valve"], "detailed_description": "Named Game of the Year by over 50 publications, Valve's debut title blends action and adventure with award-winning technology to create a frighteningly realistic world where players must think to survive. Also includes an exciting multiplayer mode that allows you to play against friends and enemies around the world."}, "2360": {"name": "HeXen: Beyond Heretic", "appid": "2360", "is_free": false, "publishers": ["id Software"], "detailed_description": "<p>While you were battling the evil forces of D'Sparil, the other Serpent Riders were busy sowing the seeds of destruction in other dimensions. One such dimension is the decaying world where Hexen takes place. A world littered with the mangled corpses of nonbelievers and inhabited by the undead followers that executed them. Only three humans &endash; a warrior, a mage and a cleric &endash; have escaped the leaders' vicious spell. Now these brave souls have sworn to crush the evil regime that threatens to destroy the world forever. Separated upon entering the mystical portal, the three are forced to attempt on their own what they had hoped to do together: find Korax's stronghold, destroy him and restore order in the physical world.</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Become one of 3 heroes. Wield superhuman powers and lethal weapons.</li>\n\t\t\t\t\t<li>Walk. Run. Fly. Look all around. Inflict serious pain.</li>\n\t\t\t\t\t<li>Pillage your way through earthquakes, crumbling bridges and fog.</li>\n\t\t\t\t\t<li>Track down powerful artifacts and cast wicked spells.</li>\n\t\t\t\t\t<li>Four sick individuals can wreak havoc via network, two by modem.</li></ul>"}, "40": {"name": "Deathmatch Classic", "appid": "40", "is_free": false, "publishers": ["Valve"], "detailed_description": "Enjoy fast-paced multiplayer gaming with Deathmatch Classic (a.k.a. DMC). Valve's tribute to the work of id software, DMC invites players to grab their rocket launchers and put their reflexes to the test in a collection of futuristic settings."}, "2900": {"name": "688(I) Hunter/Killer", "appid": "2900", "is_free": false, "publishers": ["Strategy First"], "detailed_description": "688(I) Hunter/Killer, the most realistic submarine simulation ever developed for PC. Master the sonar and weapons control systems, learn to develop real target situations and outfit your boat with the latest advanced weaponry. Then use your skills to complete the tour of duty and earn your dolphins to become a true submariner.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>A truly authentic simulation: Developed by Sonalysts, a defense contractor who designs submarine simulators for the US Navy<br>\t\t\t\t\t</li><li>Over 12 detailed operating stations: Control all aspects of submarine warfare, including the sonar suite, fire control, helm and target motion analysis<br>\t\t\t\t\t</li><li>Real-World Terrain: Ocean depth and water density for the entire globe are based on actual satellite topographical data<br>\t\t\t\t\t</li><li>Real-life situations: Conduct detailed training and single missions, plus a full campaign based on political analysis from real world situations<br>\t\t\t\t\t</li><li>Multiplayer Warfare: Seek and Destroy up to 8 players over the internet or LAN<br>\t\t\t\t\t</li><li>Full 3D Technology: Full 3D technology allows for multiple camera views and accurate 3D models of over 20 different naval weapons platforms<br>\t\t\t\t\t</li><li>Complete Control: Manage all of the resources of your submarine, including crewmen training and weapons load-outs</li></ul>"}, "3390": {"name": "Feeding Frenzy 2 Deluxe", "appid": "3390", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": ""}, "1520": {"name": "DEFCON", "appid": "1520", "is_free": false, "publishers": ["Introversion Software"], "detailed_description": "Inspired by the 1983 cult classic film, Wargames, DEFCON superbly evokes the tension, paranoia and suspicion of the Cold War era, playing on the fascinating aspects of psychological gameplay that occur during strategic nuclear warfare.<br />\r\n\t\t\t\t\tYou play a General hidden deep within an underground bunker. Your mission is to successfully exterminate your enemy's civilian population whilst saving your own. Points are awarded or lost depending on both the efficacy and thoroughness of your nuclear vendetta and the number of your own civilian deaths.  In order to win you must wipe out the enemy population and simultaneously disable the enemy's ability to retaliate against you. This is an extremely difficult task since launching an attack on the enemy exposes the positions of your own Ground Silos, Subs and Bombers the moment they launch nuclear weapons, making you extremely vulnerable and exposed to a crushing counter-attack. <br />\r\n\t\t\t\t\tDesperate attempts must be made to form fast, tactical alliances, alliances that may at any moment break-down to become the treacherous and most deadly of betrayals. Everyone looks to each other in a state of nervous suspense and paranoid accusation. In all-out nuclear Armageddon, everybody dies, everybody loses, you just have to make sure you lose the least!"}, "2290": {"name": "Final DOOM", "appid": "2290", "is_free": false, "publishers": ["id Software"], "detailed_description": "<strong>Two New, 32-Level DOOM II Episodes.</strong><br>\t\t\t\t\tEvilution:<br>\t\t\t\t\tFar from earth, the UAC recommenced their experiments on on of the moons of Jupiter. A spaceship, mistaken for a supply vexxel on radar, hovered above the base. Hideous demons poured out, blanketing the base with death. All your comrades were quickly slaughtered or zombified. This time, it's not about survival. It's about revenge.<br>\t\t\t\t\tThe Plutonia Experiment:<br>\t\t\t\t\tEvery effort has been made by the nation's top scientists to close the seven interdimensional Gates of Hell, but one portal remains open. Alone, you must infiltrate the ravaged complex, defeat the demon Gatekeeper and seal the last Hell-hole before the undead are prepared to, once again, take over the world."}, "219": {"name": "Half-Life 2: Demo", "appid": "219", "is_free": true, "publishers": ["Valve"], "detailed_description": "Half-Life 2 defines a new benchmark in gaming with startling realism and responsiveness. Powered by Source&trade; technology, Half-Life 2 features the most sophisticated in-game characters ever witnessed, advanced AI, stunning graphics and physical gameplay."}, "1670": {"name": "Iron Warriors: T - 72 Tank Command ", "appid": "1670", "is_free": false, "publishers": ["Strategy First"], "detailed_description": "The most devastating mechanized armor to ever roll onto a battlefield is brought to life in Iron Warriors: T72-Tank Command. This epic combat simulator allows the player to command an entire platoon of tanks and ALL associated support units, or assume the role of ANY member in a complete tank crew!<br><br>The realism of both the physics and 3D engine creates game environments where real life armored tactic become the only way to survive on the today's modern battlefield!\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Three of Russia's most devastating and powerful tanks ever produced are  yours to control; the T - 34-85, T-55A and T-72B!</li>\n\t\t\t\t\t<li>Roll these mechanized monsters through 18 campaigns, 2 training missions, 5 single player missions and 3 multiplayer (LAN) missions. </li>\n\t\t\t\t\t<li>Master your tank and crew and you will soon take command of other units that round out your mechanized platoon.</li>\n\t\t\t\t\t<li>Cooperative multi-player support allows gamers to team up as a tank crew and play different positions within the same tank! </li>\n\t\t\t\t\t<li>Roll into battle on some of the most realistic terrain maps ever modeled; real weather, destructible terrain and detailed models. </li>\n\t\t\t\t\t<li>Ballistics models take into effect: wind, shell, aerodynamic flight characteristics, barrel wear and droop!</li>\n\t\t\t\t\t<li>Powerful mission editor, map editor, and structure editor included; modify existing content or create your own. </li></ul>"}, "980": {"name": "SpaceForce™ Rogue Universe Trailer", "appid": "980", "is_free": false, "publishers": ["Nordic Games"], "detailed_description": ""}, "2390": {"name": "Heretic: Shadow of the Serpent Riders", "appid": "2390", "is_free": false, "publishers": ["id Software"], "detailed_description": "<p>In a twisted medieval dimension, undead creatures and bestial horrors have done the unthinkable--callously slaughtering your entire race. Your friends. Your family. Eliminated. But the nightmare has just begun. Wielding ungodly weapons such as the Firemace and Hellstaff and casting spells from the Tomes of Power, you must seek your vengeance. Or die trying.</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Supports up to four players via network, two by modem. Adventure through the game with a friend or crack their skull in a bloody deathmatch.</li>\n\t\t\t\t\t<li>Walk. Run. Fly. Look all around you, even up and down.</li>\n\t\t\t\t\t<li>Choose from among 7 weapons (from the simple staff to the awesome Phoenix Rod).</li>\n\t\t\t\t\t<li>Use arcane artifacts to unleash unearthly power on unsuspecting foes.</li></ul>"}, "3360": {"name": "Big Money! Deluxe", "appid": "3360", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": ""}, "550": {"name": "Left 4 Dead 2", "appid": "550", "is_free": false, "publishers": ["Valve"], "detailed_description": "Set in the zombie apocalypse, Left 4 Dead 2 (L4D2) is the highly anticipated sequel to the award-winning Left 4 Dead, the #1 co-op game of 2008.<br>                    This co-operative action horror FPS takes you and your friends through the cities, swamps and cemeteries of the Deep South, from Savannah to New Orleans across five expansive campaigns.<br>                    You'll play as one of four new survivors armed with a wide and devastating array of classic and upgraded weapons. In addition to firearms, you'll also get a chance to take out some aggression on infected with a variety of carnage-creating melee weapons, from chainsaws to axes and even the deadly frying pan.<br>                    You'll be putting these weapons to the test against (or playing as in Versus) three horrific and formidable new Special Infected. You'll also encounter five new \u0093uncommon\u0094 common infected, including the terrifying Mudmen.<br>                    Helping to take L4D's frantic, action-packed gameplay to the next level is AI Director 2.0. This improved Director has the ability to procedurally change the weather you'll fight through and the pathways you'll take, in addition to tailoring the enemy population, effects, and sounds to match your performance. L4D2 promises a satisfying and uniquely challenging experience every time the game is played, custom-fitted to your style of play.<br>                    <ul class=\"bb_ul\"><li>Next generation co-op action gaming from the makers of Half-Life, Portal, Team Fortress and Counter-Strike.<br>                    </li><li>Over 20 new weapons &amp; items headlined by over 10 melee weapons – axe, chainsaw, frying pan, baseball bat – allow you to get up close with the zombies<br>                    </li><li>New survivors. New Story. New dialogue. <br>                    </li><li>Five expansive campaigns for co-operative, Versus and Survival game modes.<br>                    </li><li>An all new multiplayer mode.<br>                    </li><li>Uncommon common infected. Each of the five new campaigns contains at least one new \u0093uncommon common\u0094 zombies which are exclusive to that campaign. <br>                    </li><li>AI Director 2.0: Advanced technology dubbed \u0093The AI Director\u0094 drove L4D's unique gameplay – customizing enemy population, effects, and music, based upon the players’ performance. L4D 2 features \u0093The AI Director 2.0\u0094 which expands the Director’s ability to customize level layout, world objects, weather, and lighting to reflect different times of day.<br>                    </li><li>Stats, rankings, and awards system drives collaborative play<br>                    </li></ul>"}, "2680": {"name": "The History Channel®: Civil War", "appid": "2680", "is_free": false, "publishers": ["Activision Value"], "detailed_description": "<p>Immerse yourself in the intensity, carnage, and chaos of the war that divided a nation! Play as a Confederate or Union soldier in America's most legendary battles including Gettysburg, Bull Run and Antietam. Use authentic firearms, fight in intense hand-to-hand combat, place explosives, sabotage enemy artillery, destroy buildings, and more!</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li><span class=\"copyHead\">America's Most Historic Battles</span> - Twelve of the most famous battles in the Nation's history including Gettysburg, Bull Run and Antietam.</li>\n\t\t\t\t\t<li><span class=\"copyHead\">Awesome Cinematic War Experience</span> - Battles come to life amidst exploding artillery, whistling bullets, falling comrades and much more!\n\t\t\t\t\t<li><span class=\"copyHead\">Wide Variety of Battlefield Combat</span> - Enlist realistic battle strategies including line fighting, artillery barrages, urban assaults, sniping, stealth and sabotage.</li>\n\t\t\t\t\t<li><span class=\"copyHead\">Authentic Weaponry</span>  - Authentic Civil War weapons transport you to the battlefields armed with repeating rifles, multiple types of grenades, exploding artillery, Gatling guns, revolvers, bayonets, muskets, and more!</li>\n\t\t\t\t\t<li><span class=\"copyHead\">Intense Hand-to-Hand Fighting</span> - Experience the intense chaos of the Civil War including close quarters and melee fighting using bayonets, sabers, the butt of your gun and even your fists in the midst of raging battles.</li>\n\t\t\t\t\t<li><span class=\"copyHead\">Incredible realism and historical accuracy</span> - Battlefield recreations are based on topographical maps and photographs from the actual battlegrounds.</li>\n\t\t\t\t\t<li>Each level begins with a documentary video describing the historic moments in each battle, movements of armies, local fights, historical photos and battle statistics.</li></ul>"}, "2760": {"name": "Neverwinter Nights™ 2 Platinum", "appid": "2760", "is_free": false, "publishers": ["Atari"], "detailed_description": "<p>Neverwinter Nights™ 2 Platinum includes Neverwinter Nights™ 2 and two official expansion packs: Mask of the Betrayer and Storm of Zehir.</p><br>\n\t\t\t\t\t<p><strong>Everything you do has a meaning</strong></p><ul>\n\t\t\t\t\t\t<li>Rediscover familiar locations and old friends from the Neverwinter Nights™ series.\n\t\t\t\t\t\t<li>Create and host your own solo and multiplayer D&D® adventures using the improved Neverwinter Nights™ 2 Toolset.\n\t\t\t\t\t\t<li>Use new spells, feats, and prestige classes from the existing Dungeons and Dragons® 3.5 Edition rules.\n\t\t\t\t\t\t<li>Explore the Forgotten Realms, rendered in breathtaking detail.\n\t\t\t\t\t\t<li>Play your way - your actions and interactions, the companions you travel with, and the way your build your stronghold all change the course of your adventure.</ul>\n\t\t\t\t\t<p><strong>Cursed by Death, Driven by Destiny</strong></p><ul>\n\t\t\t\t\t\t<li>Challenging 25 hour adventure complete with strategic action, a rich story, and deep characters\n\t\t\t\t\t\t<li>Advance to Epic levels (above level 20) and choose from over 100 new spells and feats\n\t\t\t\t\t\t<li>New tool set features and improvements make creating your own adventures easier than ever\n\t\t\t\t\t\t<li>Includes new monsters, weapons, items, classes, races and environments</ul>\n\t\t\t\t\t<p><strong>As a new era dawns over Faerûn, the jungles of Chult reveal their hidden menace.</strong></p><ul>\n\t\t\t\t\t\t<li>What fate has befallen the Sword Coast since the defeat of the King of Shadows?\n\t\t\t\t\t\t<li>Shipwrecked on the shores of a hostile jungle nation, your adventurers must fight their way to civilization, uncovering a plot that will change Faerûn forever. Among the mighty, beware who you trust.\n\t\t\t\t\t\t<li>Explore the Sword Coast using the new Overland Map.\n\t\t\t\t\t\t<li>New party-based gameplay with teamwork benefits and more reactive party conversation.\n\t\t\t\t\t\t<li>See the impact of your choices on the world and its economy.</ul><br />\n\t\t\t\t\t<h2>Key features:</h2><ul>\n\t\t\t\t\t\t<li>Experience the long-awaited sequel to the game that revolutionized creating and playing computer role-playing games. \n\t\t\t\t\t\t<li>Use the completely rewritten, powerful Obsidian Neverwinter Nights™ 2 Toolset to create your own adventures, share them with friends, or run them through your adventure directly as the Dungeon Master. \n\t\t\t\t\t\t<li>Play online with other gamers and enjoy limitless adventure. \n\t\t\t\t\t\t<li>Explore the Forgotten Realms in greater graphical splendor than ever before with a completely new, cutting-edge graphics system and an overland map. \n\t\t\t\t\t\t<li>Employ new spells, feats, and advanced prestige classes, based on the exciting Dungeons and Dragons 3.5 Edition rules. \n\t\t\t\t\t\t<li>Recruit up to three companions to assist in your adventures. Improved party control allows for more dynamic tactical decisions in combat and more personal interaction. \n\t\t\t\t\t\t<li>Rediscover familiar locations and meet old friends from the Neverwinter Nights™ series.</ul><br />\n\t\t\t\t\t"}, "220": {"name": "Half-Life 2", "appid": "220", "is_free": false, "publishers": ["Valve"], "detailed_description": "1998. HALF-LIFE sends a shock through the game industry with its combination of pounding action and continuous, immersive storytelling. Valve's debut title wins more than 50 game-of-the-year awards on its way to being named \"Best PC Game Ever\" by PC Gamer, and launches a franchise with more than eight million retail units sold worldwide.<br><br>\r\n\t\tNOW. By taking the suspense, challenge and visceral charge of the original, and adding startling new realism and responsiveness, Half-Life 2 opens the door to a world where the player's presence affects everything around him, from the physical environment to the behaviors even the emotions of both friends and enemies.<br><br>\r\n\t\tThe player again picks up the crowbar of research scientist Gordon Freeman, who finds himself on an alien-infested Earth being picked to the bone, its resources depleted, its populace dwindling. Freeman is thrust into the unenviable role of rescuing the world from the wrong he unleashed back at Black Mesa. And a lot of people he cares about are counting on him.<br><br>\r\n\t\tThe intense, real-time gameplay of Half-Life 2 is made possible only by Source&reg;, Valve's new proprietary engine technology. Source provides major enhancements in:<br><br>\r\n\t\t<ul>\r\n\t\t<li><span class=\"copyHead\">Characters:</span> Advanced facial animation system delivers the most sophisticated in-game characters ever seen. With 40 distinct facial \"muscles,\" human characters convey the full array of human emotion, and respond to the player with fluidity and intelligence.</li>\r\n\t\t<li><span class=\"copyHead\">Physics:</span> From pebbles to water to 2-ton trucks respond as expected, as they obey the laws of mass, friction, gravity, and buoyancy.</li>\r\n\t\t<li><span class=\"copyHead\">Graphics:</span> Source's shader-based renderer, like the one used at Pixar to create movies such as Toy Story&reg; and Monster's, Inc.&reg;, creates the most beautiful and realistic environments ever seen in a video game.</li>\r\n\t\t<li><span class=\"copyHead\">AI:</span> Neither friends nor enemies charge blindly into the fray. They can assess threats, navigate tricky terrain, and fashion weapons from whatever is at hand.</li>\r\n\t\t</ul>"}, "3600": {"name": "Escape Rosecliff Island", "appid": "3600", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": "<p>An unexpected storm has left you shipwrecked on a mysterious and remote private island. Seek & find cleverly hidden objects and solve puzzles to find a way off the island!  Find over 2100 hidden objects in 25 intriguing and mysterious locations to find items that will help you escape!</p>\n                    <p>Play 5 different types of mini-game puzzles to collect inventory items from each location that will be needed to help you escape the remote Rosecliff Island.  Play 3 different game modes: Escape the Island, Unlimited Seek & Find, and a Mystery Bonus Game.</p>\n                    <ul>\n                    <li>Find over 2100 cleverly hidden objects.</li>\n                    <li>Explore 25 mysterious island locations to find a way off.</li>\n                    <li>Three fun game modes: Escape Mode, Unlimited Seek & Find, & a Mystery Bonus Game.</li>\n                    <li>Play 5 unique mini-games: Match 3, Word Search, Puzzle Rotation, Memory Match, Jigsaw plus a unique final puzzle.</li>\n                    <li>Locate all the hidden locks to reveal two bonus games.</li>\n                    <li>Go for a Perfect Search & back-to-back speed bonuses to beat your high score.</li>\n                    </ul>"}, "4850": {"name": "Cossacks: Back to War", "appid": "4850", "is_free": false, "publishers": ["GSC World Publishing"], "detailed_description": "<p>To stand alone in war is extremely unpleasant. Extremely pleasant, on the other hand, is the stand-alone version Cossacks: Back to War. Containing all of the gameplay features of Cossacks: European Wars and Cossacks: The Art of War, this is a complete care package for all current and future Cossacks fans. This add-on contains 100 captivating missions taking place between the 16th and 18th centuries. In addition, two new nations, Switzerland and Hungary, are included. These countries waged war in the late Middle Ages and essentially influenced the development of European military strategies. This addition causes the second add-on of Cossacks to pass the threshold of allowed gaming fun.</p><br />\n\t\t\t\t\t<h2>Features:</h2><ul>\n\t\t\t\t\t<li>Thrilling real-time strategy game with historical background.\n\t\t\t\t\t<li>Fascinating 3D landscapes.\n\t\t\t\t\t<li>Play takes place in Europe between the 16th and 18th centuries.\n\t\t\t\t\t<li>Stand-alone game, other Cossacks games not required to play.\n\t\t\t\t\t<li>A total of 20 different European nations to command.\n\t\t\t\t\t<li>100 new single missions.\n\t\t\t\t\t<li>2 new nations: Switzerland and Hungary with a total of 8 new units.\n\t\t\t\t\t<li>Spectacular real-time battles with up to 8,000 units.\n\t\t\t\t\t<li>4 different difficulty levels.\n\t\t\t\t\t<li>1 new camel riding unit for Algeria and Turkey: Bedouin.\n\t\t\t\t\t<li>This version with low system requirements is adapted for comfortable play on any hardware from low-end computers, laptops and netbooks, to high-end PCs (with Windows Vista/7).\n\t\t\t\t\t<li>Ad-Hoc multiplayer play (offline mode).\n\t\t\t\t\t<li>Infinite AI skirmishes on randomly generated maps.\n\t\t\t\t\t</ul><br/>"}, "10": {"name": "Counter-Strike", "appid": "10", "is_free": false, "publishers": ["Valve"], "detailed_description": "Play the world's number 1 online action game. Engage in an incredibly realistic brand of terrorist warfare in this wildly popular team-based game. Ally with teammates to complete strategic missions. Take out enemy sites. Rescue hostages. Your role affects your team's success. Your team's success affects your role."}, "1600": {"name": "Dangerous Waters", "appid": "1600", "is_free": false, "publishers": ["Strategy First"], "detailed_description": "S.C.S. - Dangerous Waters allows you total control over multiple air, surface, and submarine platforms in a modern-day naval environment. Take direct control of individual crew stations and also plan and execute combined arms naval strategies from a top-down 'Commanders Eye' perspective."}, "4460": {"name": "City Life 2008", "appid": "4460", "is_free": false, "publishers": ["Focus Home Interactive"], "detailed_description": "Construct the city of the 21st Century with City Life!<br>\t\t\t\t\tCity Life 2008 Edition is a next-generation City Builder. Its 3D game engine provides a level of detail and animation unprecedented in the City Builder genre, with total freedom of construction. From superb villas in residential neighbourhoods to imposing skyscrapers in the financial district, design, construct and develop the city of your dreams. Provide comfort and satisfaction for your citizens by offering them work, health care, entertainment facilities, and much more, and ensure that your city’s coffers are brimming. It’s up to you to manage your city efficiently, balancing booming development with the problems of pollution and traffic that this brings. Build a sense of community between the six unique subcultures, or pay the price if their relationships deteriorate into conflict or riots. You are the architect, mayor and business mogul!<br>2008 Edition<br>\t\t\t\t\tCity Life 2008 Edition contains all the content of the previous versions, adding a further 23 new maps and over 60 new buildings, including landmarks such as London’s Royal Opera House and St. Paul’s Cathedral. Over 360 buildings are at your disposal in this latest version. You now have the possibility to import satellite maps, heightmaps, and other user-generated terrain into the game. Use your imagination to create ever more spectacular towns, or recreate the exceptional cities of the real world!<br>Features<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Gigantic city building simulation with high performance 3D engine.<br>\t\t\t\t\t</li><li>Explore 50 maps in five different environments.<br>\t\t\t\t\t</li><li>360° camera rotation and zooming allows you to dive into the heart of your city and observe its inhabitants.<br>\t\t\t\t\t</li><li>Six unique subcultures with specific expectations and needs.<br>\t\t\t\t\t</li><li>Play in Scenario or Free Mode.<br>\t\t\t\t\t</li><li>New import tool for satellite maps and heightmaps.<br>\t\t\t\t\t</li><li>A powerful building creation tool based on a modular system. No technical skills required, only your imagination.</li></ul>"}, "20": {"name": "Team Fortress Classic", "appid": "20", "is_free": false, "publishers": ["Valve"], "detailed_description": "One of the most popular online action games of all time, Team Fortress Classic features over nine character classes -- from Medic to Spy to Demolition Man -- enlisted in a unique style of online team warfare. Each character class possesses unique weapons, items, and abilities, as teams compete online in a variety of game play modes."}, "420": {"name": "Half-Life 2: Episode Two", "appid": "420", "is_free": false, "publishers": ["Valve"], "detailed_description": "<p>Half-Life&reg; 2: Episode Two is the second in a trilogy of new games created by Valve that extends the award-winning and best-selling Half-Life&reg; adventure.</p>\r\n\t\t\t\t\t<p>As Dr. Gordon Freeman, you were last seen exiting City 17 with Alyx Vance as the Citadel erupted amidst a storm of unknown proportions. In Episode Two, you must battle and race against Combine forces as you traverse the White Forest to deliver a crucial information packet stolen from the Citadel to an enclave of fellow resistance scientists.</p>\r\n\t\t\t\t\t<p>Episode Two extends the award-winning Half-Life gameplay with unique weapons, vehicles, and newly-spawned creatures.</p>\r\n\t\t\t\t\t"}, "1700": {"name": "Arx Fatalis", "appid": "1700", "is_free": false, "publishers": ["Arkane Studios"], "detailed_description": "This critically acclaimed first-person RPG takes the player on an amazing journey into the fantasy world of Arx. The game mixes intelligent story with immersive and actual medieval surroundings. Arx Fatalis allows the player to feel that all his actions have a direct consequence on those around him.<br />\r\n\t\t\t\t\tThe goal of the game is to destroy the secret cult of Akbaa, the god of destruction. As a player, you must prevent the return of such a cruel creature to the physical world. Should you fail, Akbaa is bound to impose its terror upon the world of Arx.<br />\r\n\t\t\t\t\tYou will become the hero of an underground world - with weapons, spells and magical items to defend against goblins, trolls, rat-men and other vicious opponents.<br />\r\n\t\t\t\t\tBesides brute force, stealth and the &quot;onscreen gesture based magic system&quot; are the three alternative ways to succeed.   Using the mouse, flaming runes can be drawn in mid-air.  A combination of these gestures can create powerful magic spells that will protect you or empower you to defeat opponents and pursue the quest."}, "4570": {"name": "Warhammer® 40,000: Dawn of War® - Game of the Year Edition", "appid": "4570", "is_free": false, "publishers": ["SEGA"], "detailed_description": "<h1>Reviews</h1><p><a href=\"http://store.steampowered.com/sub/30560/\" target=\"_blank\" rel=\"noreferrer\"  ><img src=\"http://cdn.edgecast.steamstatic.com/steam/apps/4570/extras/DOW_STEAM_BANNER_616x616.jpg?t=1487588754\" ></a></p><br><h1>About the Game</h1>Prepare yourself for the grim, dark future of the 41st millennium, where alien races battle mankind for galactic domination in a universe of unending war.<br>Personalize your armies with a revolutionary unit customization tool that gives you the ability to choose your armies insignias, banners, squad colors and names.<br><br><br><ul class=\"bb_ul\"><li><strong>Engaging story driven single player campaign.</strong><br>Command the elite chapter of the Blood Ravens in an original epic tale of treason and conspiracy as you serve the Emperor and protect humanity from the scourges of Warhammer 40,000 universe.<br></li><li><strong>Master four unique races.</strong><br>Command your Space Marines, Orks, Chaos and Eldar in epic battles and master their distinct abilities, weapons, and tech trees to eradicate the enemy and rule the known universe.<br></li><li><strong>Unprecedented realism.</strong><br>Appropriately scaled terrain, vehicle physics and dynamic lightning contribute to a level of realism never before displayed in a real-time strategy game.<br></li><li><strong>Visceral cinematic melee and ranged combat.</strong><br>Realistic unit animations immerse you in intense brutal combat .<br></li><li><strong>Pioneering tactical gameplay.</strong><br>Innovations such as cover, squad-based combat, and morale add new strategic depth to real-time warfare.<br></li><li><strong>Dynamic multiplayer.</strong><br>Test your true combat abilities in two-to-eight player battles providing endless re-playability</li></ul>"}, "1710": {"name": "Arx Fatalis Demo", "appid": "1710", "is_free": true, "publishers": ["Arkane Studios"], "detailed_description": ""}, "4700": {"name": "Medieval II: Total War™", "appid": "4700", "is_free": false, "publishers": ["SEGA", "Feral Interactive (Mac)", "Feral Interactive (Linux)"], "detailed_description": "Take command of your army and expand your reign in Medieval II - the fourth installment of the award-winning Total War series of strategy games. Direct massive battles featuring up to 10,000 bloodthirsty troops on epic 3D battlefields, while presiding over some of the greatest Medieval nations of the Western and Middle Eastern world. Spanning the most turbulent era in Western history, your quest for territory and power takes you through Europe, Africa, and the Middle East, and even onto the shores of the New World.<br>\t\t\t\t\tYou'll manage your empire with an iron fist, handling everything from building and improving cities to recruiting and training armies. Wield diplomacy to manipulate allies and enemies, outsmart the dreaded Inquisition, and influence the Pope. Lead the fight in the Crusades and bring victory to Islam or Christianity in the Holy War. Rewrite history and conquer the world. This is Total War!<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Bigger and better real-time battles. Improved combat choreography, larger armies, quicker pace, and spectacular finishing moves make this the most visceral and exciting Total War ever.<br>\t\t\t\t\t</li><li>New epic campaign. The ambitious single player campaign will span three continents and let players sail across to the Americas to confront the Aztecs on their home soil.<br>\t\t\t\t\t</li><li>Greater accessibility. An enhanced user interface and optional shorter campaigns make the Total War experience faster and easier to enjoy than ever before.<br>\t\t\t\t\t</li><li>Over 40 new features. An advanced terrain system, enhanced weather effects, and more will help you divide and conquer.<br>\t\t\t\t\t</li><li>Intense Multiplayer Battles. Wage war against other players in 8-way multiplayer games across the Internet and LAN.</li></ul><br>NOTE: Because the Kingdoms expansion uses core game elements from the Medieval II: Total War game, it is required that you use the same method for purchasing Kingdoms as you did in purchasing Medieval II: Total War. If you purchase Medieval II: Total War from Steam, then please use Steam to purchase Kingdoms."}, "360": {"name": "Half-Life Deathmatch: Source", "appid": "360", "is_free": true, "publishers": ["Valve"], "detailed_description": "Half-Life Deathmatch: Source is a recreation of the first multiplayer game set in the Half-Life universe. Features all the classic weapons and most-played maps, now running on the Source engine."}, "340": {"name": "Half-Life 2: Lost Coast", "appid": "340", "is_free": true, "publishers": ["Valve"], "detailed_description": "Originally planned as a section of the Highway 17 chapter of Half-Life 2, Lost Coast is a playable technology showcase that introduces High Dynamic Range lighting to the Source engine."}, "3920": {"name": "Sid Meier's Pirates!", "appid": "3920", "is_free": false, "publishers": ["2K Games"], "detailed_description": "Sail the Caribbean, marauding all on the high seas or ally your ship and crew as a privateer in search of riches - the life you choose is up to you. Face dogged enemies, raid unsuspecting villages, woo fair maidens, avoid capture or dig for buried treasure. Discover what it takes to become one of the most famous pirates in history!"}, "150": {"name": "Counter-Strike Beta", "appid": "150", "is_free": false, "publishers": [""], "detailed_description": ""}, "2720": {"name": "ThreadSpace: Hyperbol", "appid": "2720", "is_free": false, "publishers": ["Atari"], "detailed_description": "ThreadSpace: Hyperbol is an action-strategy game set in the distant future. Players battle each other on roads in space as they pilot massive ships capable of firing a wide variety of weapons.  Create defenses, coordinate with your team, and launch an assault against your opponents to achieve victory!<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Countless strategies: Over 30 unique projectiles are at your disposal to attack the enemy, fortify your defenses, and assist your allies.<br>\t\t\t\t\t</li><li>Tactical team play: Coordinate with a team of players to defeat your opponents where every player can have unique strengths and weaknesses.  Up to 16 players online.<br>\t\t\t\t\t</li><li>Customizable ships: Acquire ships to control and customize their design by selecting different parts and colors.  Customize the way your ship behaves by installing new components that alter its attributes.<br>\t\t\t\t\t</li><li>Persistent universe: Play as a character you create that can gain levels and credits. Purchase new ships and components with the credits you earn to truly distinguish your character in the universe.<br>\t\t\t\t\t</li><li>Online ladder system: Compete against other players online and see who the best pilots are.  Earn rewards for being on top.<br>\t\t\t\t\t</li><li>Awards: Demonstrate your skill by earning in-game awards like &quot;Bounty Hunter&quot; and &quot;Combat Mastery&quot;.<br>\t\t\t\t\t</li><li>Voice communication: Talk to your team to plan your attacks and coordinate your abilities.<br>\t\t\t\t\t</li><li>Create custom maps: Make your own maps with the Map Editor to play them online and with your friends.</li></ul>"}, "950": {"name": "Hitman: Blood Money Trailer", "appid": "950", "is_free": false, "publishers": ["SQUARE ENIX, Eidos Interactive"], "detailed_description": ""}, "2100": {"name": "Dark Messiah of Might & Magic", "appid": "2100", "is_free": false, "publishers": ["Ubisoft"], "detailed_description": "Discover a new breed of Action-RPG game powered by an enhanced version of the Source™ Engine by Valve. Set in the Might &amp; Magic® universe, players will experience ferocious combat in a dark and immersive fantasy environment.  Swords, Stealth, Sorcery. Choose your way to kill.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Cutting-edge technology: Experience an enhanced version of the famous Source™ Engine created by Valve. Discover the fresh perspective of a view with complete body awareness, realistic movements, physics rendering, and a complete first-person melee combat system in a fantasy setting. <br>\t\t\t\t\t</li><li>Never-ending action: Challenge the forces of evil in 12 huge levels and learn to master over 30 weapons and an arsenal of devastating spells.<br>\t\t\t\t\t</li><li>Evolve your character: Extend your gameplay experience without being limited to a single discipline. Learn powerful new spells and attacks using Dark Messiah's unique Skill Evolution System as you progress through the game.<br>\t\t\t\t\t</li><li>Revolutionary multiplayer mode: Get ready to battle with up to 32 players in the revolutionary Crusade mode, which will enable players to gain experience and new skills across dynamic online campaigns. Enlist with the humans or the undead and choose among five complementary character classes. </li></ul>© 2006 Ubisoft Entertainment.  All Rights Reserved.  Dark Messiah, Might and Magic, Ubisoft and the Ubisoft logo are trademarks of Ubisoft Entertainment in the U.S. and/or other countries.  Developed by Arkane Studios."}, "4420": {"name": "Silverfall", "appid": "4420", "is_free": false, "publishers": ["Focus Home Interactive"], "detailed_description": "Silverfall, a once glorious city, lies in the fantastical Kingdom of       Nelwë, where the forces of Technology and Nature are strongly opposed. Symptoms of this terrible conflict have begun to manifest physically as melded cyberbiologic organics and living steam-driven automatons.<br>\t\t\t\t\tDrag your hero from the pits of this world and craft him into a mighty champion that can oppose the planet-choking Order of Nothingness. Freedom to evolve in either the technological or spiritual paths is in your hands and you must choose your comrades wisely to provide a balance and benefit to your efforts - but be cautious, any bias in your choices will either corrupt or upgrade the growing world around you.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Create &amp; customize your hero (face, sex, skin, hair...) from the 4 Nelwë races (human, elf, goblin &amp; troll).<br>\t\t\t\t\t</li><li>Your hero advances without class limits and with more than 130 skills &amp; magic spells at his disposal.<br>\t\t\t\t\t</li><li>Freely explore a stunning and immense fantasy world! <br>\t\t\t\t\t</li><li>From the floating city of Cloudworks, to the volcanic scenery of the city of Blazis.<br>\t\t\t\t\t</li><li>Revolutionary light and shadow effects combine with a realistic physics engine which gives never seen before detail to the environment &amp; special effects.<br>\t\t\t\t\t</li><li>Playable with up to 8 players in multiplayer mode through either a LAN connection or on the Internet, with cooperative play or PvP.</li></ul>"}, "2610": {"name": "GUN™", "appid": "2610", "is_free": false, "publishers": ["Activision"], "detailed_description": "When life robs Colton White of all that matters, the only thing left he can trust is his GUN. From award-winning developer, Neversoft, and accomplished screenwriter, Randall Jahnson (The Mask of Zorro, The Doors), GUN follows Colton on his quest for discovery as he seeks to exact vengeful justice on those who have wronged him. GUN is a realistic epic action/adventure that lets gamers experience the brutality of the lawless West.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>New and savage ways to punish: Stealthily sneak up and attack your enemies, use them as cover, stab and shoot them. Blast away and watch the aftermath, shoot guns out of enemy hands, or destroy with dynamite. <br>\t\t\t\t\t</li><li>Extensive variety of missions and game play: Wage war on horseback, commandeer trains, protect prostitutes, collect bounties, play poker, hunt buffalo, and more. Multiple game play styles include: precision shooting, stealth tactics, and use of explosives. Embark on numerous side missions that allow you to master gun slinging and horse riding. Unlock secret weapons and upgrade your skills and abilities to improve your weapon and equipment performance.<br>\t\t\t\t\t</li><li>Brutal realism: Act as a gunslinger protecting righteousness, or seek retribution as you face corrupt lawmen, warring tribes, cold-blooded outlaws, and ruthless renegades. Encounter legendary gunfighters such as JJ Webb. Employ a multitude of authentic weapons including: Six shooters, shotguns, Gatling guns, flaming arrows, hatchets, dynamite, and more.<br>\t\t\t\t\t</li><li>Expansive interactive world: Play an extensive variety of exciting missions as you journey west across the new frontier. Ride on horseback through the scenic, yet dangerous Western terrain of canyons, mountains, plains, forests, gold mines and towns.</li></ul><br>© 2006 Activision Publishing, Inc.  Activision is a registered trademark and GUN is a trademark of Activision Publishing, Inc.  All rights reserved.  All other trademarks and trade names are the properties of their respective owners."}, "4260": {"name": "RACE 07 Demo", "appid": "4260", "is_free": true, "publishers": ["SimBin"], "detailed_description": "<p><b>Real Cars, Real Racing...</b></p>\n\t\t\t\t\t<p>RACE 07 - The Official WTCC Game features the full FIA WTCC season of 2007 including all cars and tracks, as well as several new support classes and tracks from all over the world. The game also features the full WTCC season of 2006 which was included in the games predecessor RACE - The WTCC Game, released in 2006 on PC.</p>\n\t\t\t\t\t<p>For the first time ever SimBin is also presenting single seater action with Formula cars. Race with the incredibly fast Formula 3000, Formula BMW and in addition also the Radical sports cars with the models SR3 and SR4.</p>\n\t\t\t\t\t<p>To support these new race classes the player will be offered the choice between one- or two-race-format. The highly detailed damage system is also adapted to give the Formula cars the vulnerability they have in real life.</p>\n\t\t\t\t\t<p>RACE 07 comes with a score of new tracks and added track including several new city tracks, alternate track layouts and reversed track option. Several new community oriented features, game modes and online functionalities will also be announced later.</p>\n\t\t\t\t\t<p>All in all RACE 07 features more than 300 cars in 9 different classes on 32 real life racing tracks and city circuits from all over the world.</p>"}, "3130": {"name": "Men of War: Red Tide", "appid": "3130", "is_free": false, "publishers": ["1C Company", "1C-SoftClub"], "detailed_description": "Men of War: Red Tide is a sequel to the critically acclaimed RTS Men of War. Red Tide introduces a new story driven campaign based on the writings of Soviet scribe Alexander Zorich, it also includes dozens of new or upgraded units and weapons.<br>\t\t\t\t\tMen of War: Red Tide is a stunning mixture of RTS and a third-person action that introduces a new fighting force known for its brutal efficiency during the height of World War II. Played out across more than 20 missions, Men of War: Red Tide allows to take command of the feared &quot;Black Coats,&quot; the nickname given to Soviet Marines, an elite combat group specializing in engagements near the shoreline.<br>\t\t\t\t\tThe player has direct control of new game units including the Black Coats, tanks, self-propelled guns, armored trains, landing craft, artillery and new enemy emplaced weapons to capture and use. New air support options include fighters, bombers, hydroplanes; cruisers, destroyers and gun boats which provide naval fire support.<br>\t\t\t\t\tFighting during the Black Sea Campaigns of WWII, history buffs and WWII aficionados will recognize theaters of battle such as Odessa, Sevastopol, Theodosia, Eltingen, Nikolaev and Constanta.<br><br>\t\t\t\t\t<ul class=\"bb_ul\"><li>23 missions - Soviet, German, Romanian and Italian forces<br>\t\t\t\t\t</li><li>Six intense historical battles and landing operations during 1941-1945<br>\t\t\t\t\t</li><li>Over 100 different military units: tanks, artillery, armored cars, planes (fighters, bombers, transporters), war ships and boats (cruisers, torpedo boats, gunboats)<br>\t\t\t\t\t</li></ul>"}, "1250": {"name": "Killing Floor", "appid": "1250", "is_free": false, "publishers": ["Tripwire Interactive"], "detailed_description": "Killing Floor is a Co-op Survival Horror FPS set in the devastated cities and countryside of England after a series of cloning experiments for the military goes horribly wrong. You and your friends are members of the military dropped into these locations with a simple mission: Survive long enough to cleanse the area of the failed experiments!<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Cooperative gameplay for up to six players against multiple waves of specimens<br>\t\t\t\t\t</li><li>Persistent Perks system, allowing players to convert their in-game achievements into permanent improvements to their character's skills and abilities <br>\t\t\t\t\t</li><li>Over 170 Steam Achievements, including “Dignity for the dead” for killing 10 enemies feeding on dead teammates' corpses and “Hot Cross Fun” for finishing off 25 burning enemies with a Crossbow<br>\t\t\t\t\t</li><li>Slow-motion “ZEDtime” to better watch those crucial and violent creature deaths, even in multiplayer <br>\t\t\t\t\t</li><li>Solo game mode for offline play <br>\t\t\t\t\t</li><li>Ten different monster types trying to eat your face off, armed with everything from teeth and claws, to chainsaws, chain-guns and rocket-launchers <br>\t\t\t\t\t</li><li>33+ weapons for the players to chose from, ranging from knives and fire-axes to pump shotguns, rifles and a flamethrower <br>\t\t\t\t\t</li><li>Equip your team with welders, medical tools and body armor to help your odds of survival <br>\t\t\t\t\t</li><li>Choose which Perks to play with to best balance out your co-op team against the horrors <br>\t\t\t\t\t</li><li>Open, non-linear play areas: choose when and where to fight — or run; weld doors closed to direct the monster horde down alternate corridors<br>\t\t\t\t\t</li><li>Fully-configurable, allowing players to change the difficulty level, number of creature waves, or even set up their own favorite waves of monsters <br>\t\t\t\t\t</li><li>Support for Steam Friends and other Steamworks features<br>\t\t\t\t\t</li><li>Includes Windows-only SDK for the creation of new levels and mods<br>\t\t\t\t\t</li></ul>"}, "2640": {"name": "Call of Duty: United Offensive", "appid": "2640", "is_free": false, "publishers": ["Activision"], "detailed_description": "Award-winning developer Gray Matter Interactive follows up on the success of Infinity Ward's Call of Duty™ - winner of over 80 Game of the Year and 50 Editors' Choice awards worldwide - with Call of Duty™: United Offensive™. Take the role of American, British, and Russian soldiers in some of the most climactic battles of World War II, including the Battle of the Bulge, the invasion of Sicily, and the Battle of Kursk.<br />\r\n\t\t\t\t\tFight in tanks, jeeps, motorcycles, even a bomber. Work with your squad through snow and rain, using new weapons including flamethrowers and deployable machine guns, or by calling in artillery strikes. 13 All-New Single Player missions spanning three campaigns. 11 exciting new Multiplayer maps and 3 new multiplayer modes including Domination, Capture the Flag, and Base Assault.<br />\r\n<br />\r\n© 2006 Activision Publishing, Inc.  Activision and Call of Duty are registered trademarks of Activision Publishing, Inc.  All rights reserved.  All other trademarks and trade names are the properties of their respective owners."}, "3990": {"name": "Civilization IV®: Warlords", "appid": "3990", "is_free": false, "publishers": ["2K Games"], "detailed_description": "Sid Meier's Civilization IV: Warlords is the first expansion pack for the award-winning game that has become an instant world-wide hit. Paying homage to some of history's greatest military leaders, the expansion delivers six unique and interesting scenarios, giving players the chance to change the course of history with the help of their new powerful &quot;warlord&quot; unit. Civ IV: Warlords includes new civilizations, leaders, units, and wonders that offer even more fun and exciting ways for players to expand their civilization's military power as they strive for world domination.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Warlords: a new great person type called the Warlord.<br>\t\t\t\t\t</li><li>Vassal states: conquer an enemy and subjugate them to your rule.<br>\t\t\t\t\t</li><li>Game scenarios: the expansion delivers eight scenarios.<br>\t\t\t\t\t</li><li>New civilizations: the pack provides six new civilizations and associated unique units.<br>\t\t\t\t\t</li><li>Civilization leaders: 10 new leaders, including leaders for the new civilizations as well as additional leaders for existing civilizations.<br>\t\t\t\t\t</li><li>Leader traits: two new leader traits.<br>\t\t\t\t\t</li><li>New wonders: three new wonders.<br>\t\t\t\t\t</li><li>Unique buildings: each civilization has a new unique building as well as their unique unit.<br>\t\t\t\t\t</li><li>New units, resources, and improvements: many new items are presented throughout the scenarios.<br>\t\t\t\t\t</li><li>Core game tweaks and additions: expanded features and gameplay tweaks made to the core game.<br>\t\t\t\t\t</li><li>Post-release patches and game upgrades: the pack contains all of the patches and game additions (pit boss, etc.) yet released for Sid Meier's Civilization IV.</li></ul>"}, "2710": {"name": "Act of War: Direct Action", "appid": "2710", "is_free": false, "publishers": ["Atari"], "detailed_description": "<strong>Tomorrow's War Is NOW</strong><br>\t\t\t\t\tRipped from today's headlines, Act of War: Direct Action™ is a frightening tale of suspense, international intrigue and geopolitical military conflict. This real-time strategy experience puts you squarely in control of counterterrorist forces and delivers a first look at tomorrow's war.<br>\t\t\t\t\tThe Situation:<br>\t\t\t\t\tA crippling energy crisis. Terrorist attacks. Massive strikes. Global instability.<br>\t\t\t\t\t<br>\t\t\t\t\tThe Enemy:<br>\t\t\t\t\tA shadowy Consortium of back-room conspirators determined to throw the world into utter chaos using widespread terror tactics. <br>\t\t\t\t\t<br>\t\t\t\t\tThe Heroes:<br>\t\t\t\t\tA new &quot;direct action&quot; operation known as Task Force TALON to counter massive military assaults, rescue hostages, conduct classified spy missions, take prisoners and stop an unpredictable enemy bent on toppling the world's governments.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Command ultra-realistic modern military units<br>\t\t\t\t\t</li><li>Power-packed combination of high-end cinema, video effects and live action<br>\t\t\t\t\t</li><li>Intense multiplayer operations for up to eight players<br>\t\t\t\t\t</li><li>Real urban combat, including POW captures and landscape destruction<br>\t\t\t\t\t</li><li>Gripping storyline by NY Times bestselling author, Dale Brown</li></ul>"}, "2620": {"name": "Call of Duty®", "appid": "2620", "is_free": false, "publishers": ["Activision"], "detailed_description": "<strong><i>Call of Duty®</i></strong> delivers the gritty realism and cinematic intensity of World War II's epic battlefield moments like never before - through the eyes of citizen soldiers and unsung heroes from an alliance of countries who together helped shape the course of modern history.<br><br>Play through the chaos of battle as part of a well-trained squad, that lays down covering fire and pulls its wounded to safety. In addition to authentic squad movements and tactics, each soldier's distinct personality and training comes out on the battlefield.<br><br>No one soldier or nation single-handedly won the war. For the first time, <strong><i>Call of Duty®</i></strong> captures the war from multiple perspectives, through the eyes of American, British and Russian soldiers. Battle through 24 missions spanning 4 interconnected historical campaigns. Take on mission objectives ranging from sabotage and all-out assault to stealth, vehicle combat and rescue. Authentic weapons, locations, vehicles and sounds of war all contribute to the realism, immersing you in the most intense World War II experience yet.<br><br>© 2003 Activision Publishing, Inc.  Activision and Call of Duty are registered trademarks of Activision Publishing, Inc.  All rights reserved.  All other trademarks and trade names are the properties of their respective owners."}, "4310": {"name": "RoboBlitz Demo", "appid": "4310", "is_free": true, "publishers": ["Naked Sky Entertainment"], "detailed_description": "<p>RoboBlitz&trade; is a humorous, physics-based action game full of inventive gizmos, weapons, characters, and environments. Players take on the role of Blitz, a multi-talented robot who must activate an aging Space Cannon to save his world from a band of maladjusted space pirates.</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>19 levels of puzzle-solving and high-intensity action, set in 7 unique environments</li>\n\t\t\t\t\t<li>Humorous characters and unique weapons</li>\n\t\t\t\t\t<li>Gameplay entirely driven by physics</li>\n\t\t\t\t\t<li>Advanced robot simulation and control theory</li>\n\t\t\t\t\t<li>Powered by Unreal&reg; Engine 3</li></ul>"}, "620": {"name": "Portal 2", "appid": "620", "is_free": false, "publishers": ["Valve"], "detailed_description": "Portal 2 draws from the award-winning formula of innovative gameplay, story, and music that earned the original Portal over 70 industry accolades and created a cult following.<br><br>\t\t\t\t\t\t\t\t\t\tThe single-player portion of Portal 2 introduces a cast of dynamic new characters, a host of fresh puzzle elements, and a much larger set of devious test chambers. Players will explore never-before-seen areas of the Aperture Science Labs and be reunited with GLaDOS, the occasionally murderous computer companion who guided them through the original game.<br>\t\t\t\t\t\t\t\t\t\t<br>\t\t\t\t\t\t\t\t\t\tThe game’s two-player cooperative mode features its own entirely separate campaign with a unique story, test chambers, and two new player characters. This new mode forces players to reconsider everything they thought they knew about portals. Success will require them to not just act cooperatively, but to think cooperatively.<br>\t\t\t\t\t\t\t\t\t\t<br>\t\t\t\t\t\t\t\t\t\t<strong>Product Features</strong><br>\t\t\t\t\t\t\t\t\t\t<ul class=\"bb_ul\"><li><strong>Extensive single player:</strong> Featuring next generation gameplay and a wildly-engrossing story.<br>\t\t\t\t\t\t\t\t\t\t</li><li><strong>Complete two-person co-op:</strong> Multiplayer game featuring its own dedicated story, characters, and gameplay.<br>\t\t\t\t\t\t\t\t\t\t</li><li><strong>Advanced physics:</strong> Allows for the creation of a whole new range of interesting challenges, producing a much larger but not harder game.<br>\t\t\t\t\t\t\t\t\t\t</li><li><strong>Original music.</strong><br>\t\t\t\t\t\t\t\t\t\t</li><li><strong>Massive sequel:</strong> The original Portal was named 2007's Game of the Year by over 30 publications worldwide. <br>\t\t\t\t\t\t\t\t\t\t</li><li><strong>Editing Tools:</strong> Portal 2 editing tools will be included.<br>\t\t\t\t\t\t\t\t\t\t</li></ul>"}, "3520": {"name": "Mystery P.I.™ - The Vegas Heist", "appid": "3520", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": "<p>The heist of the century has just happened!  You've been hired by the casino to find & return the stolen money before its grand opening in 16 hours. Search for over 2300 cleverly hidden objects in 25 intriguing locations to solve the Vegas Heist.</p>\n\t\t\t\t\t<p>Two addictive ways to play: Vegas Heist mode and Unlimited Seek &amp; Find mode. Collect all the hidden Keys and Poker Chips to unlock the bonus mode.  Find the clues, solve the Vegas Heist!</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Find over 2300 cleverly hidden objects</li>\n\t\t\t\t\t<li>Investigate 25 intriguing Vegas locations to locate the stolen money</li>\n\t\t\t\t\t<li>Two fun game modes: 'Solve the Vegas Heist' and 'Unlimited Seek &amp; Find'</li>\n\t\t\t\t\t<li>Play 5 unique mini-games: Word Search, Tile Rotation, Tile Swap, Jigsaw and a unique crime solving puzzle</li></ul>"}, "1620": {"name": "Jagged Alliance 2 Gold", "appid": "1620", "is_free": false, "publishers": ["Strategy First"], "detailed_description": "<p>The small country of Arulco has been taken over by a merciless dictator - and only you can loosen the iron grip! Jagged Alliance 2 Gold Pack immerses you into an elaborate role-playing universe where you will interact with more than 150 characters, recruit your own band of soldiers and create your own custom mercenary to win back Arulco - not once, but twice! The perfect blend of strategy, role playing and tactical combat!</p>"}, "2510": {"name": "Shadowgrounds Demo", "appid": "2510", "is_free": true, "publishers": ["Frozenbyte"], "detailed_description": "Get the Shadowgrounds demo now and experience it's singleplayer and cooperative action.<br><br>Shadowgrounds breathes fresh air into the action genre with explosive combat sequences, an innovative weapon upgrade system, and intriguing storyline. The adrenaline-pumping, top-down gameplay and audiovisual fireworks set the scene for this new action experience which also includes single computer (split keyboard or joystick) co-op play."}, "3280": {"name": "Painkiller Overdose Demo", "appid": "3280", "is_free": true, "publishers": ["Nordic Games"], "detailed_description": ""}, "2130": {"name": "Dark Messiah of Might & Magic", "appid": "2130", "is_free": false, "publishers": ["Ubisoft"], "detailed_description": "Discover a new breed of Action-RPG game powered by an enhanced version of the Source™ Engine by Valve. Set in the Might &amp; Magic® universe, players will experience ferocious combat in a dark and immersive fantasy environment.  Swords, Stealth, Sorcery. Choose your way to kill.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Cutting-edge technology: Experience an enhanced version of the famous Source™ Engine created by Valve. Discover the fresh perspective of a view with complete body awareness, realistic movements, physics rendering, and a complete first-person melee combat system in a fantasy setting. <br>\t\t\t\t\t</li><li>Never-ending action: Challenge the forces of evil in 12 huge levels and learn to master over 30 weapons and an arsenal of devastating spells.<br>\t\t\t\t\t</li><li>Evolve your character: Extend your gameplay experience without being limited to a single discipline. Learn powerful new spells and attacks using Dark Messiah's unique Skill Evolution System as you progress through the game.<br>\t\t\t\t\t</li><li>Revolutionary multiplayer mode: Get ready to battle with up to 32 players in the revolutionary Crusade mode, which will enable players to gain experience and new skills across dynamic online campaigns. Enlist with the humans or the undead and choose among five complementary character classes. </li></ul>© 2006 Ubisoft Entertainment.  All Rights Reserved.  Dark Messiah, Might and Magic, Ubisoft and the Ubisoft logo are trademarks of Ubisoft Entertainment in the U.S. and/or other countries.  Developed by Arkane Studios."}, "3170": {"name": "King's Bounty: Armored Princess", "appid": "3170", "is_free": false, "publishers": ["1C Company"], "detailed_description": "<strong>King's Bounty: Armored Princess</strong> is a sequel to the critically acclaimed King’s Bounty: The Legend. Players will take on the role of Princess Amelie who travels around the world of Teana and searches for the renowned knight, and her mentor, Bill Gilbert. This new world of King’s Bounty: Armored Princess is full of mysteries and dangers. The new character, the Princess, will encounter horrible creatures, huge monstrous bosses and a new race, the bloodthirsty Lizards. As in the multi-award winning game on which this sequel is based, the player has many options to resist these new enemies. Various new skills and characteristics of Amelie as well as her chance to fly will help her overcome the hordes attacking the kingdom.<br><br>The Princess is accompanied by a Pet Dragon, at the very beginning small and amusing, but its abilities develop steadily until it becomes an incredible ally. He will do his best to protect the Princess during the battles, starting with easy blows and treasure hunting and finishing with battle rage and volcano summoning.<br><br><ul class=\"bb_ul\"><li>New fascinating story-line and a whole new continent to explore<br></li><li>A new female character to play – Princess Amelie<br></li><li>Medals giving bonuses can be received for special achievements<br></li><li>Pet Dragon which becomes more powerful as the player does<br></li><li>New Lizard race<br></li><li>Possibility to turn your horse into a Pegasus which can fly<br></li><li>Fast travel between opened continents<br></li><li>Hire companions<br></li><li>Resurrection of the classic system of contracts and headhunting<br></li><li>Improved role playing system including more abilities and the chance to achieve level 50 and higher<br></li><li>Brand new spells and new Adventure Magic spell for game map<br></li><li>New unique bosses: Driller, Gremlion, Archdemon Baal and many others<br></li><li>New engine supporting the latest graphic effects<br></li><li>Beautiful, hand drawn environments<br></li><li>Mac version is available in English, Russian, German, French, Spanish and Italian languages</li></ul>"}, "1300": {"name": "SiN Episodes: Emergence", "appid": "1300", "is_free": false, "publishers": ["Ritual Entertainment"], "detailed_description": "You are John Blade, commander of HardCorps, an elite security force dedicated to protecting the people of Freeport City. Four years have passed since your first battle with Elexis Sinclaire, a beautiful, brilliant, and ruthless scientist who is out to remake humanity according to her own twisted vision. The law has failed to bring Elexis and her multi-billion dollar empire, SiNTEK, to justice, so Blade is determined to take matters into his own hands. Joining Blade on his mission are JC - a hacker with a secret to keep - and Jessica Cannon, a fiery rookie who can find her way into any secure facility.<br>\t\t\t\t\tEnter the living, breathing world of Freeport City, a futuristic collision of New York, San Francisco and Tokyo. As Freeport continues to suffer from mutant attacks, you must now bring down Sinclaire before she can set her deadly plan in motion and alter the shape of humanity forever.<br>\t\t\t\t\tSiN Episodes™: Emergence launches the new era of episodic gaming. A first person shooter powered by Valve's award-winning Source™ technology, SiN Episodes offers unprecedented interactivity, an engrossing story, and a revolutionary dynamic difficulty system that provides a custom experience based on your skill level and play style.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Intense Combat: Face off against ruthless enemies, like jetpack soldiers and mutants that evolve as you fight them. Witness enemies that adapt to your actions and truly work as a team, as they cover each other and help fallen comrades to get back on their feet.<br>Outsmart your opponents by using your surroundings to your advantage as you set up traps using lethal elements of the environment. Location-based damage rewards accuracy while melee combat moves enable you to get up-close and personal.<br>\t\t\t\t\t</li><li>Unprecedented Interactivity: Blast your way through highly interactive environments powered by an enhanced version of the Source engine. Characters dynamically react to what you're looking at and the environment. Target and shoot off specific vehicle parts and literally blow cars to pieces. Experience the next level of vehicle combat with a flexible positioning system enabling you to move around the interior with an unprecedented degree of freedom, allowing you to pick the ideal position to attack that enemy position up ahead.<br>\t\t\t\t\t</li><li>Personal Challenge System™: Driven by one of the most elaborate statistics systems ever created, SiN Episodes will constantly adapt to your playing style and offers a challenge that is custom-tailored to your skill level.<br>\t\t\t\t\t</li><li>Episodic Delivery: Buy as little or as much of the game as you want, with each installment offering 3 - 6 hours of action-packed gameplay. But tread lightly, as the choices you make may influence future episodes in unforeseen ways.<br>\t\t\t\t\t</li><li>Source Powered: Utilizing the same engine that powered Half-life® 2, Emergence gives you stunningly gorgeous graphics and intense physics-based gameplay.</li></ul>"}, "130": {"name": "Half-Life: Blue Shift", "appid": "130", "is_free": false, "publishers": ["Valve"], "detailed_description": "Made by Gearbox Software and originally released in 2001 as an add-on to Half-Life, Blue Shift is a return to the Black Mesa Research Facility in which you play as Barney Calhoun, the security guard sidekick who helped Gordon out of so many sticky situations."}, "2500": {"name": "Shadowgrounds", "appid": "2500", "is_free": false, "publishers": ["Frozenbyte"], "detailed_description": "Shadowgrounds breathes fresh air into the action genre with explosive combat sequences, an innovative weapon upgrade system, and an intriguing storyline. The adrenaline-pumping, top-down gameplay and audiovisual fireworks set the scene for this new action experience which also includes single computer (split keyboard or joystick) co-op play.<br>\t\t\t\t\t<strong>UPGRADE THOSE WEAPONS!</strong> Use a devastating arsenal of high-tech weaponry to dispose of the alien threat. Each weapon has multiple upgrades that maximize the carnage. Unleash the flames of the Flamethrower's Fuel Trap, cause mayhem with the Grenade Launcher's Poison Grenades, slash and dice the monsters with the Laser Rifle's Pinpoint Laser - and many more!<br>\t\t\t\t\t<strong>WHAT LURKS IN THE SHADOWS?</strong> Shadowgrounds uses cutting-edge realistic lighting and glow technology to light up the battlefield and create detailed shadows producing an atmosphere of fear. But the lighting and the flashlight also affect some aliens' behavior - take advantage of that and you can turn the tide in the game of fear by using your flashlight effectively.<br>\t\t\t\t\t<strong>DESTRUCTIBLE ENVIRONMENT!</strong> What good are weapons and special effects if you can't wreak havoc on the environment? Shadowgrounds lets you go all-out - glass shatters, ground shakes, trees fall, barrels explode and furniture blows to smithereens. You can use the environment to your advantage.<br>\t\t\t\t\t<strong>THEY'RE BIG AND NASTY!</strong> Big, brutal monsters await you. Prepare to face many different bosses who will do anything to stop your journey. They're nasty, blood-thirsty beasts, but don't give in to fear - remember to use the environment and the lighting to your advantage!<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Upgrade weaponry with powerful modifications.<br>\t\t\t\t\t</li><li>Face enormous monsters in boss battles.<br>\t\t\t\t\t</li><li>Destructible environment allows you to wreak havoc with your arsenal.<br>\t\t\t\t\t</li><li>Visit many exciting locations, including a secret military base and the alien-infested colony New Atlantis.<br>\t\t\t\t\t</li><li>Fight side-by-side with NPC allies against the massive alien hordes.<br>\t\t\t\t\t</li><li>Check security cameras and computer logs to investigate alien origins.<br>\t\t\t\t\t</li><li>Realistic lighting with gameplay effects bring the aliens out of the shadows.<br>\t\t\t\t\t</li><li>Enjoy horrifying sound effects and a thrilling music soundtrack made exclusively for Shadowgrounds.</li></ul>"}, "3330": {"name": "Zuma Deluxe", "appid": "3330", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": "Survive the ancient temples of Zuma, the critically acclaimed action-puzzler from PopCap! Deep in the jungle lie hidden temples bursting with traps and trickery, and it's up to you to uncover their treasures. Fire magical balls from your stone frog idol to make matches of three or more and clear the deadly chain before it reaches the golden skull.<br>\t\t\t\t\t<br><br><br>\t\t\t\t\tExplore all the temples — if you're good, you’ll rack up huge combos and special bonuses that'll help you on your way. But think fast and aim smart, or you'll be history in this action-packed puzzle challenge!<br>\t\t\t\t\t<br><br><strong>Key Features</strong><br>\t\t\t\t\t<ul class=\"bb_ul\"><li>3D accelerated graphics and effects.<br>\t\t\t\t\t</li><li>Stunning sounds and tribal tunes.<br>\t\t\t\t\t</li><li>Explore the Adventure mode and test your skills in Gauntlet mode.<br>\t\t\t\t\t</li><li>Over 20 temples to explore!<br>\t\t\t\t\t<ul class=\"bb_ul\"></ul></li></ul>"}, "3730": {"name": "Aliens versus Predator Classic 2000", "appid": "3730", "is_free": false, "publishers": ["Rebellion"], "detailed_description": "Aliens Versus Predator Classic 2000 features the Colonial Marine, Alien and Predator Campaigns and the frenetic single-player Skirmish mode from the original title: Alien Versus Predator Gold Edition, which was released to massive acclaim in 2000.<br>\t\t\t\t\tAlien Versus Predator Classic 2000 has been updated to run on modern PCs and laptops using DirectX 9.0c and includes support for Xbox 360 Controller for Windows.<br>\t\t\t\t\tThe three most ferocious species in the universe in a bloodthirsty battle for the ultimate prize: survival. Take your pick: be a Colonial Marine, a Predator or an Alien. Fight through suspense-filled environments: from starships and space stations to colonial bases and eerie planetscapes. One wrong move turns you from hunter to prey.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Three campaigns: Colonial Marine, Alien and Predator<br>\t\t\t\t\t</li><li>Includes all the levels from the original AvP Gold Edition plus the Millennium Expansion Pack<br>\t\t\t\t\t</li><li>Skirmish mode against infinite Alien hordes<br>\t\t\t\t\t</li><li>Bonus Episodes<br>\t\t\t\t\t</li><li>Unique abilities, weapons and equipment for each species<br>\t\t\t\t\t</li><li>Scale walls and elevator shafts as an ALIEN with frightening speed as you attack and devour your victims<br>\t\t\t\t\t</li><li>Stalk your prey as the deadly PREDATOR using wrist blades, shoulder cannons and stealth mode<br>\t\t\t\t\t</li><li>Lock and load as a COLONIAL MARINE using motion trackers, grenade launchers and flame-throwers to exterminate your foes<br>\t\t\t\t\t</li><li>Supports Xbox 360 Controller for Windows<br>\t\t\t\t\t</li><li>Music from the original soundtrack CD<br>\t\t\t\t\t</li></ul><h2 class=\"bb_tag\">Multiplayer Features</h2>\t\t\t\t\t<ul class=\"bb_ul\"><li>Integrated with Steam Overlay<br>\t\t\t\t\t</li><li>Uses Steam name<br>\t\t\t\t\t</li><li>Host/Join games via bare-bones in-game lobby browser<br>\t\t\t\t\t</li><li>Can invite and join friends and others via the Steam overlay<br>\t\t\t\t\t</li><li>Game attempts host migration<br>\t\t\t\t\t</li><li>Dedicated servers are not supported or planned<br>\t\t\t\t\t</li></ul>"}, "4500": {"name": "S.T.A.L.K.E.R.: Shadow of Chernobyl", "appid": "4500", "is_free": false, "publishers": ["GSC Game World"], "detailed_description": "In 1986, the world's worst nuclear disaster occurred at the Chernobyl power station. Soviet authorities established a 30km 'Exclusion Zone' around this nuclear wasteland, but in 2006 a second explosion rocked the stricken reactor, obliterating all living things and causing the Zone's boundaries to ripple outwards. From this epicenter came waves of mutated creatures, deadly radiation, and a strange, anomalous energy. The Zone was cordoned off by the military, who would shoot on sight anyone foolish enough to brave the horrors within.<br><br>It is now 2012 - man has ventured further and further into the heart of the Zone driven by reports of strange 'artifacts' imbued with anomalous energy. Mercenaries and bounty hunters compete to recover these artifacts, which command extortionate prices on the black market. Others seek to find the truth behind the Zone, while some merely revel in the desolate lawlessness of the place. Whatever their motivation, over time these individuals - Scavengers, Trespassers, Adventurers, Loners, Killer, Explorers and Robbers - have become known as S.T.A.L.K.E.R.s.<br><br>Awakening in the Zone, you are one such S.T.A.L.K.E.R., fighting for survival in this man-made Hell, while trying to discover the truth behind Chernobyl's sinister past and ominous future.<br><br><ul class=\"bb_ul\"><li>An immersive storyline seamlessly blended with a living, breathing, non-linear open-world environment governed by the revolutionary 'A-Life' system.<br></li><li>Accurately modeled real-world buildings and locations from deep inside the Chernobyl Exclusion Zone.<br></li><li>Unique 'Survival FPS' game play - combines action, stealth, survival and RPG elements to create an incomparable experience in the Zone.<br></li><li>Enemy Threat Evaluation AI system - NPC characters react dynamically to environments and situations.<br></li><li>Brutally realistic combat mechanics  - weapons display accurate ballistic properties and can be modified with silencers and telescopic scopes.<br></li><li>Dynamic day/night and weather system directly impacts game play.<br></li><li>Advanced physics and dynamic lighting effects powered by the proprietary 'X-Ray Engine'.<br></li><li>Intense multiplayer action, supporting up to 32 players.</li></ul>"}, "2570": {"name": "Vigil: Blood Bitterness™", "appid": "2570", "is_free": true, "publishers": [""], "detailed_description": "<p>Vigil: Blood Bitterness plunges you into the dark and disturbing story of an ancient civilization where you must reveal the secrets of your past and exact revenge on the Evil destroying your universe. Ritualistic killings and blood lust blur the line between your own kind and the Evil you seek to annihilate. Your ultimate goal is to free yourself from this tormenting place and understand the origin and the purpose of this never ending Evil.</p> \n\t\t\t\t\t<p>Vigil is a stylized gothic horror adventure game that uses black and white imagery similar to Frank Miller's Sin City&#153; to create a unique visual that draws you deeper into the gruesome world of your character, Dehon. Avoid deadly traps, solve puzzles to unravel your past, and even devour the faces of your slaves for sustenance towards your ultimate goal of freedom.</p>  \n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Easy point-and-click playability</li>\n\t\t\t\t\t<li>Engrossing story with deeply disturbed and complex characters</li>\n\t\t\t\t\t<li>3D graphics with revolutionary black and white art and dynamic camera angles</li>\n\t\t\t\t\t<li>Challenging puzzles to solve and reveal the mysteries of your civilization</li>\n\t\t\t\t\t<li>Compelling pre-rendered cut scenes to advance the horrific story</li>\n\t\t\t\t\t<li>A gallery of clues in text, pictures, videos and sounds</li>\n\t\t\t\t\t<li>Set up multiple player profiles</li></ul>"}, "1280": {"name": "Darkest Hour: Europe '44-'45", "appid": "1280", "is_free": true, "publishers": ["Darklight Games"], "detailed_description": "<h1>D-Day Anniversary 2016 Update</h1><p>To commemorate the 72nd anniversary of the D-Day landings in Normandy, we have added a total of five new official maps for Darkest Hour!<br><br><ul class=\"bb_ul\"><li>La Cambe (50+ players)<br></li><li>St-Clement (32+ players)<br></li><li>Dead Man’s Corner (8-16 players)<br></li><li>Vierville (16-32 players)<br></li><li>Foucarville (8-16 players)</li></ul><br>For more details, head for the official website: <a href=\"https://steamcommunity.com/linkfilter/?url=http://www.darkesthourgame.com/\" target=\"_blank\" rel=\"noopener\"  >http://www.darkesthourgame.com/</a></p><br><h1>About the Game</h1>Based on the award winning Red Orchestra: Ostfront, Darkest Hour: Europe ‘44-’45 is a free, online multiplayer, total-conversion mod that raises the bar for intensity, realism and emphasis on teamwork to crush your enemies and achieve victory.<h2 class=\"bb_tag\">Main Features</h2><ul class=\"bb_ul\"><li>Fight alongside or against US, British and Canadian forces<br></li><li>Brave 27 authentic battles from the Normandy invasion to the frigid forests of the Ardennes<br></li><li>Pull the trigger on dozens of iconic weapons<br></li><li>Flinch as bullets whip and crack over your head with our greatly improved suppression system<br></li><li>Crew over 30 fearsome armored vehicles including late-war heavy hitters like the M18 Hellcat and King Tiger<br></li><li>Rip through tanks with an improved and highly detailed armor penetration model<br></li><li>Coordinate with your team to rain death from above with player-operated mortars<br></li><li>Clear a path with wire-cutters and trample obstacles under your treads<br></li><li>Deploy to the front lines with a completely redesigned spawning system<br></li><li>Conquer the enemy with team cohesion and authentic tactics</li></ul>"}, "3960": {"name": "Shattered Union", "appid": "3960", "is_free": false, "publishers": ["2K Games"], "detailed_description": "<p>Following a great increase in terrorism, internal strife and ultimately, the nuclear destruction of Washington, D.C., the United States shatters into a half-dozen nation-states that descend into war. Take the helm of one of these newfound sovereignties (or the 'peacekeeping' European Expeditionary Force) and struggle to reunify America... by any means necessary!</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Modern 3D tactical war game viewed from a \"bird's-eye\" overhead camera.</li>\n\t\t\t\t\t<li>Non-linear mission progression with changes based on player-made decisions.</li>\n\t\t\t\t\t<li>Real-time resolution of turned-based moves. Take your time while you decide your move, but once you have selected your action, see the results all play out in full animation models, exploding vehicles, and burning cities and forests!</li>\n\t\t\t\t\t<li>Fully destructible terrain/environment. As the battle proceeds, everything from explosions and destroyed buildings permanently mark the terrain. Moving tanks will leave tread marks that stay for the duration of the mission. At the end, very little will look the same.</li>\n\t\t\t\t\t<li>Fight your way across the United States! Had enough of the windy city? Then go ahead and bomb Chicago! Invade across the Rockies into California, capture the tank factories in Ohio, and lay siege to New York City! You decide - the fate of the nation is in your hands!</li>\n\t\t\t\t\t<li>Call up National Guard forces equipped with M1 Abrams battle tanks, Apache helicopters and stealth bombers. Or make a deal with the Russians and equip your boys with MiG fighters and T-95 Heavy Tanks.</li></ul>"}, "2370": {"name": "HeXen: Deathkings of the Dark Citadel", "appid": "2370", "is_free": false, "publishers": ["id Software"], "detailed_description": "<p>Where HeXen Ends, the True Nightmare Begins. Deathkings of the Dark Citadel is the only official expansion of the original HeXen game. This add-on pack features 20 new single player levels from the original HeXen team as well as a host of new multiplayer options.</p>\n\t\t\t\t\t<p>Deathkings of the Dark Citadel was the first true game expansion that Raven Software ever produced. In addition to providing three new hubs for the original HeXen, the Deathkings expansion was the first multiplayer game that allowed eight players to connect to a LAN simultaneously.</p>"}, "1510": {"name": "Uplink", "appid": "1510", "is_free": false, "publishers": ["Introversion Software"], "detailed_description": "You play an Uplink Agent who makes a living by performing jobs for major corporations. Your tasks involve hacking into rival computer systems, stealing research data, sabotaging other companies, laundering money, erasing evidence, or framing innocent people.<br />\r\n<br />\r\nYou use the money you earn to upgrade your computer systems, and to buy new software and tools. As your experience level increases you find more dangerous and profitable missions become available. You can speculate on a fully working stock market (and even influence its outcome). You can modify peoples academic or criminal records. You can divert money from bank transfers into your own accounts. You can even take part in the construction of the most deadly computer virus ever designed."}, "1690": {"name": "Space Empires V", "appid": "1690", "is_free": false, "publishers": ["Strategy First"], "detailed_description": "Space Empires V is the latest edition in the Space Empires series. This new chapter completely updates the UI and takes the player into a real-time rendered 3D universe. Watch space battles played out in glorious detail and realistic effects. Expand, Explore, Exploit, and Exterminate in a huge living breathing galaxy. New features abound with political alliances between multiple empires, a top-down ship design system, a hexagonal movement grid, and many more. Due to player demand, the game is completely 'moddable' and even adds a scriptable AI system to the mix. Space Empires V boldly takes the next step in the genre of space strategy<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>24 bit 3D real-time rendered graphics. <br>\t\t\t\t\t</li><li>Detailed Tactical Combat (and a combat simulator to test your designs!). <br>\t\t\t\t\t</li><li>New vehicle types and sizes: Ships, Bases, Freighters, Fighters, Mines, Satellites, Troops, Drones, and Weapons Platforms. <br>\t\t\t\t\t</li><li>Ability to completely design and customize all of your vehicles. <br>\t\t\t\t\t</li><li>Large Galaxy: 100 solar systems with 15 planets each. <br>\t\t\t\t\t</li><li>Huge Technology Tree: Thousands of tech levels with hundreds of components and facilities. <br>\t\t\t\t\t</li><li>Completely customizable game graphics: Create your own planets, stars, vehicles, etc. <br>\t\t\t\t\t</li><li>Completely customizable AI players: Create your own AI players with unique traits, styles, and speech. <br>\t\t\t\t\t</li><li>14 unique races to play or customize (or just create your own!) <br>\t\t\t\t\t</li><li>Randomly generated map for every game (or load an existing map). <br>\t\t\t\t\t</li><li>Complete game customization allowed by players (&quot;mods&quot;). </li></ul>"}, "2790": {"name": "Atari 80 Classics in One", "appid": "2790", "is_free": false, "publishers": ["Atari"], "detailed_description": "<p>Take a step back in time to the early days of video arcades with Atari's 80 Classic Games, a compilation of unforgettable and authentic Atari titles. Each one is faithfully reproduced with all the great sights, sounds and fast action that made them so popular. Whether you played these games in their original arcade cabinets or on an Atari 2600 console, you're sure to find a favorite.</p>\n\t\t\t\t\t<p><b>Classic arcade hits:</b></p>\n\t\t\t\t\t<p>Asteroids&reg;, Asteroids&reg; Deluxe&trade;, Battlezone&trade;, Black Widow&trade;, Centipede&reg;, Crystal Castles&reg;, Gravitar&reg;, Liberator&trade;, Lunar Lander&trade;, Major Havoc&trade;, Millipede&reg;, Missile Command&reg;, Pong&reg;, Red Baron&trade;, Super Breakout&reg;, Space Duel&trade;, Tempest&reg; and Warlords&reg;!</p>\n\t\t\t\t\t<p></p>\n\t\t\t\t\t<p><b>Atari 2600 titles:</b></p>\n\t\t\t\t\t<p>3D Tic-Tac-Toe, A Game of Concentration, Adventure&trade;, Air-Sea Battle&trade;, Asteroids&reg;, Basic Programming, Battlezone&trade;, Bowling, Breakout&reg;, Canyon Bomber&trade;, Casino&trade;, Centipede&reg;, Circus Atari&trade;, Codebreaker&trade;, Combat&trade;, Crystal Castles&reg;, Demon to Diamonds&reg;, Dodge 'Em&trade;, Double Dunk&trade;, Flag Capture&trade;, Football, Fun With Numbers&trade;, Golf, Gravitar&reg;, Haunted House&trade;, Home Run&trade;, Human Cannonball&trade;, Math Gran Prix&trade;, Maze Craze&trade;, Millipede&reg;, Miniature Golf, Missile Command&reg;, Night Driver&trade;, Outlaw&trade;, Quadrun&trade;, Radar Lock&trade;, Realsports&reg; Baseball, Realsports&reg; Football, Realsports&reg; Tennis, Realsports&reg; Volleyball, Sky Diver&trade;, Slot Machine&trade;, Slot Racers&trade;, Space War&trade;, Star Raiders&trade;, Star Ship&trade;, Stellar Track&trade;, Street Racer&trade;, Submarine Commander&trade;, Super Baseball&trade;, Super Breakout&reg;, Super Football, Surround&trade;, Swordquest&trade;: Earthworld&trade;, Swordquest&trade;: Fireworld&trade;, Swordquest&trade;: Waterworld&trade;, Video Checkers&trade;, Video Chess&trade;, Video Olympics&trade;, Video Pinball&trade;, Warlords&reg;, and Yar's Revenge&trade;!</p>"}, "4240": {"name": "RACE - The WTCC Game", "appid": "4240", "is_free": false, "publishers": ["SimBin"], "detailed_description": "<strong>The Official WTCC Game |</strong> RACE is the first ever game to be focused on the hard hitting, intense action of the exciting WTCC championship which is exploding in popularity all over the world. Based on WTCC, one of only three official FIA world championships next to Formula 1 and WRC, RACE features the complete WTCC championship season of 2006, all the cars, drivers and locations, including several official tracks and cars brand new to the racing game genre.<br>\t\t\t\t\tThe game recreates the championship as close to real life as possible and simulates the cars and the driving style in a ultra realistic fashion.<br>\t\t\t\t\t RACE features various difficulty levels to attract everyone, from hardcore simulation gamers to beginners level still featuring the same elements and a highly realistic driving experience."}, "2910": {"name": "Fleet Command", "appid": "2910", "is_free": false, "publishers": ["Strategy First"], "detailed_description": "International waterways become theaters of war when the world's most formidable maritime powers exchange their fatal blows. With entire fleets at your command, you must strategically deploy vessels from every class - frigate to aircraft to nuclear submarine - to maintain the precarious balance of naval power and gain position for the deadly endgame.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Campaigns and mission scenarios straight from current headlines<br>\t\t\t\t\t</li><li>Exclusive real-time strategy with cuttingedge, real-world weapons<br>\t\t\t\t\t</li><li>Intuitive point and click game play<br>\t\t\t\t\t</li><li>No need to memorize symbols or complex commands<br>\t\t\t\t\t</li><li>Player designed task forces<br>\t\t\t\t\t</li><li>Complete 3D environment rotates and zooms for intense combat action<br>\t\t\t\t\t</li><li>Effects modeled in stunning detail- time of day, clouds, rain, differing sea states, ship's wake and pyrotechnics</li></ul>"}, "3830": {"name": "Psychonauts", "appid": "3830", "is_free": false, "publishers": ["Double Fine Productions"], "detailed_description": "A Psychic Odyssey Through the Minds of Misfits, Monsters, and Madmen.<br />\r\n<br />\r\nThis classic action/adventure platformer from acclaimed developers Double Fine Productions follows the story of a young psychic named Razputin. In his quest to join the Psychonauts--an elite group of international psychic secret agents--he breaks into their secret training facility: Whispering Rock Psychic Summer Camp. But this is no average psychic summer camp! A mysterious villain has kidnapped Raz’s fellow campers and stolen their brains. Now he must use his psychic powers of Telekinesis, Levitation, and most of all his ability to project himself into the minds of others--to find the loose noodles and keep them from falling into the wrong hands. Fight mental demons! Uncover hidden memories! Sort emotional baggage! Explore the fantastic realm of the inner mind! Join the Psychonauts!"}, "3530": {"name": "Amazing Adventures Around the World", "appid": "3530", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": "<p>Pieces of an ancient stone tablet have started turning up around the globe and the Museum needs your help to locate the pieces and find the most expensive gem ever known...the &#147;World Diamond&#148;.  Under the direction of the Museum, you must immediately begin your global seek & find adventure.  Complete over 100 levels by finding hidden objects and circumventing unique puzzle traps.</p>\n                    <p>Travel to 25 unique &amp; exotic locations around the world finding over 2100 hidden objects in 3 different game modes: Find the World Diamond story mode, plus two Unlimited Play game modes which are unlocked after you have found the World Diamond or have found all of the hidden Gems in each location.  Take on 8 different types of mini-game puzzles including place-the-differences and spot-the-differences.  Good luck on your around the world adventure!</p>\n                    <ul>\n                    <li>Find over 2100 Hidden Objects in over 100 levels.</li>\n                    <li>Explore 25 exotic &amp; worldly locations.</li>\n                    <li>Play 8 unique mini-game puzzle traps including Spot-the-Differences, Place-the-differences, and many more.</li>\n                    <li>Three game modes: Find the World Diamond, Unlimited Seek & Find, and Unlimited Spot the Differences.</li>\n                    <li>Find the hidden Gems to unlock the Unlimited game modes.</li>\n                    <li>Strive for a Perfect Search bonus by not using Hint.</li>\n                    <li>Play against the clock or in Relaxed Mode with no time limits.</li>\n                    <li>Unlock interesting facts in your journal as you travel the globe.</li>\n                    </ul>"}, "2280": {"name": "Ultimate Doom", "appid": "2280", "is_free": false, "publishers": ["id Software"], "detailed_description": "The complete megahit game that set the world afire. Plus All-New Episode IV: Thy Flesh Consumed.<br />\n\t\t\t\t\tThe demons came and the marines died. Except one. You are the last defense against these hell-spawned hordes. Prepare for the most intense mutant-laden, blood-splattered action ever! The texture-mapped virtual world is so real, you don't just play DOOM - you live it.<br />\n\t\t\t\t\tThe Ultimate DOOM takes you beyond anything you've ever experienced. First, you get all three original episodes - that's 27 levels of awesome, explosive excitement. Then it really blows you away with an all-new episode: Thy Flesh Consumed.<br />\n\t\t\t\t\tNow you're dead meat. Just when you think you're getting pretty good at DOOM, you get hit with Perfect Hatred, Sever the Wicked and seven other expert levels never seen before! They're so incredibly tough, the first 27 levels will seem like a walk in the park!"}, "3320": {"name": "Insaniquarium Deluxe", "appid": "3320", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": ""}, "240": {"name": "Counter-Strike: Source", "appid": "240", "is_free": false, "publishers": ["Valve"], "detailed_description": "THE NEXT INSTALLMENT OF THE WORLD'S # 1 ONLINE ACTION GAME <br>Counter-Strike: Source blends Counter-Strike's award-winning teamplay action with the advanced technology of Source&trade; technology. Featuring state of the art graphics, all new sounds, and introducing physics, Counter-Strike: Source is a must-have for every action gamer."}, "4290": {"name": "RACE: Caterham Expansion", "appid": "4290", "is_free": false, "publishers": ["SimBin"], "detailed_description": "Celebrating the 50-year anniversary of Caterham Cars Ltd, RACE fans can now expand the WTCC Experience with this exceptional series of classic sportscars. RACE: CATERHAM introduces a total of 60 individual new cars/car skins based on some of the most exciting models in the Caterham sports car range, including the Caterham CSR 200, CSR 260 and the CSR 320 Concept, a concept version with a grueling 320hp.<br />\r\nRacers can run the cars on two exciting new tracks: the legendary Imola circuit and the former GP track Estoril.<br />\r\nRACE: CATERHAM includes new features that improve the original RACE game experience: improved performance scalability, a performance monitor to help the player find the best possible graphical settings, and a new controller interface with more options for joy-pad or keyboard/mouse controls."}, "280": {"name": "Half-Life: Source", "appid": "280", "is_free": true, "publishers": ["Valve"], "detailed_description": "Winner of over 50 Game of the Year awards, Half-Life set new standards for action games when it was released in 1998. Half-Life: Source is a digitally remastered version of the critically acclaimed and best selling PC game, enhanced via Source technology to include physics simulation, enhanced effects, and more."}, "3500": {"name": "Mystery P.I.™ - The Lottery Ticket", "appid": "3500", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": "<p>You are the world-famous Mystery P.I. and you've been hired by Grandma Rose to find her $488 million dollar winning lottery ticket that has gone missing! Retrace Grandma's steps to collect clues by finding hidden objects and solving puzzles. Search the city for the clues and piece them together to solve the case. Grandma Rose has agreed to pay you $20 million if you find the ticket before the deadline. Hurry, you only have 12 hours to find the ticket!</p>\n\t\t\t\t\t<p>Investigate 20 unique locations to find over 2100 cleverly hidden objects! As your investigation skills improve your P.I. rank increases -- strive for a \"Perfect Investigation\" to get big bonus points!</p>\n\t\t\t\t\t<p>Two fun ways to play: In Find the Ticket mode you must locate the missing ticket before the deadline. Unlock Unlimited Seek &amp; Find game mode to search for all the hidden objects with no time limits -- every scene, every item! Collect all 20 KEYS while finding the Ticket to unlock a fun bonus location hidden in the city.</p>"}, "4230": {"name": "RACE - The WTCC Game", "appid": "4230", "is_free": false, "publishers": ["SimBin"], "detailed_description": "<strong>The Official WTCC Game |</strong> RACE is the first ever game to be focused on the hard hitting, intense action of the exciting WTCC championship which is exploding in popularity all over the world. Based on WTCC, one of only three official FIA world championships next to Formula 1 and WRC, RACE features the complete WTCC championship season of 2006, all the cars, drivers and locations, including several official tracks and cars brand new to the racing game genre.<br>\t\t\t\t\tThe game recreates the championship as close to real life as possible and simulates the cars and the driving style in a ultra realistic fashion.<br>\t\t\t\t\t RACE features various difficulty levels to attract everyone, from hardcore simulation gamers to beginners level still featuring the same elements and a highly realistic driving experience."}, "2210": {"name": "Quake IV", "appid": "2210", "is_free": false, "publishers": ["Bethesda Softworks"], "detailed_description": "<p>In a desperate war for Earth’s survival, against an unrelenting enemy, the only way to defeat them is to become one of them. Armed with advanced weaponry and vehicles and aided by an elite squad of marines, you take the battle to the heart of the Strogg home planet and become earth’s only hope for victory.</p>\n\t\t\t\t\t\t<h2>Key features:</h2>\n\t\t\t\t\t\t<ul>\n\t\t\t\t\t\t<li>Built on id Tech 4 (the Doom 3 engine)\n\t\t\t\t\t\t<li>Sequel to the Quake 2 storyline\n\t\t\t\t\t\t<li>Battle outdoors using tanks and walkers\n\t\t\t\t\t\t<li>Fight with the support of an elite squad\n\t\t\t\t\t\t<li>Compete online in fast action, arena-style multiplayer\n\t\t\t\t\t\t</ul>"}, "2200": {"name": "Quake III Arena", "appid": "2200", "is_free": false, "publishers": ["id Software"], "detailed_description": "<p>Welcome to the Arena, where high-ranking warriors are transformed into spineless mush. Abandoning every ounce of common sense and any trace of doubt, you lunge onto a stage of harrowing landscapes and veiled abysses. Your new environment rejects you with lava pits and atmospheric hazards as legions of foes surround you, testing the gut reaction that brought you here in the first place. Your new mantra: Fight or be finished.</p>"}, "4720": {"name": "Condemned: Criminal Origins", "appid": "4720", "is_free": false, "publishers": ["SEGA"], "detailed_description": "What twists the mind of an ordinary human into a serial killer?<br />\n<br />\nAssigned to the Serial Crimes Unit, Agent Ethan Thomas must answer this question, and bring the worst of society to justice. His solve rate is the best in the bureau....perhaps too good.<br />\n<br />\nWhile investigating the growing list of serial killers, Agent Thomas concludes that something is twisting the bodies and souls of those that society has left behind. The homeless, addicted and deranged are rising from the city’s underbelly and committing mindless acts of violence. Could there be an unseen connection between the increasing brutality of the latest serial killings and the increasing crime rate? This question is pushed to the forefront after Agent Thomas is framed for the murder of two police officers. Now he must solve the murders to stop the killings, and exonerate himself from the crimes of which he is accused.<br />\n<br />\nAs FBI agent Ethan Thomas, you rely on sharp instincts and sophisticated forensic tools to investigate crime scenes, collect evidence, and find clues that will lead you to the killers. With danger lurking in every shadow, you need whatever weapons you can find to stay alive. If you run out of bullets, you’ll have to fight with a fire axe, shovel, pipe, two-by-four, or whatever you can pry from the environment around you. You’ll need to make sure nothing stops you as you try to uncover exactly who...or what is behind the grisly killings plaguing the city."}, "2690": {"name": "Empires: Dawn of the Modern World", "appid": "2690", "is_free": false, "publishers": ["Activision"], "detailed_description": "<p></p>\n\t\t\t\t\t<p><i>Empires: Dawn of the Modern World</i> represents the only truly global historical RTS where you control unique civilizations across a timeline that spans from the Middle Ages to World War II. Lead your nation's economic growth and military campaigns in an effort to dominate the world. Each civilization has its own historically accurate units and abilities to be used as you command battles over land, sea, and air. From a cavalry charge to a surprise air strike, you'll know what it truly means to rule one of the world's greatest empires and dominate the deepest RTS in history. </p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li><strong>1,000 of the most significant years in history</strong>, from 950 AD to 1950 AD, including the Middle Ages, the Gunpowder Age, the Imperial Age, WWI, and WWII.</li>\n\t\t\t\t\t<li><strong>Unique, historically based civilizations</strong> - Each nation has its own distinctive gameplay based on its traditional strengths and weaknesses: the English master the sea in the Gunpowder Age, the Germans have superior armor and tanks in WWII, and the Chinese acquire gunpowder before Western Europe.</li>\n\t\t\t\t\t<li><strong>Battle on land, at sea, and in air</strong> - Create authentic and varied strategies to dominate your opponents with land, sea, and air units.</li>\n\t\t\t\t\t<li><strong>Engage in single-player or multiplayer action</strong> - In single-player mode, play random map games and do battle against up to seven AI opponents or play story-based campaigns based on the powerful military heroes Richard the Lionheart, Admiral Yi, or General Patton. In multiplayer mode, play against or alongside up to seven friends online. </li>\n\t\t\t\t\t<li><strong>Spectacular graphics</strong> - Experience cutting-edge 3D RTS graphics that can be seen close up through an easy-to-use camera, zooming in on the action in all its glorious detail.</li></ul>"}, "50": {"name": "Half-Life: Opposing Force", "appid": "50", "is_free": false, "publishers": ["Valve"], "detailed_description": "Return to the Black Mesa Research Facility as one of the military specialists assigned to eliminate Gordon Freeman. Experience an entirely new episode of single player action. Meet fierce alien opponents, and experiment with new weaponry. Named 'Game of the Year' by the Academy of Interactive Arts and Sciences."}, "5000": {"name": "Painkiller Overdose Teaser", "appid": "5000", "is_free": false, "publishers": ["Nordic Games"], "detailed_description": ""}, "4760": {"name": "Rome: Total War™ - Collection", "appid": "4760", "is_free": false, "publishers": ["SEGA"], "detailed_description": "Once the Roman Empire is under your command, don't lay down your sword just yet - the Barbarians are coming. With two award-winning titles from the esteemed Total War series, you'll have twice as many obstacles and opportunities to control and conquer the greatest empire ever known to man.<br>\t\t\t\t\tThe Collection Edition includes:<br>\t\t\t\t\t<strong>Rome: Total War</strong> Guide one of three noble Roman families on a century spanning quest to seize control of the Roman Empire.<br>\t\t\t\t\t<strong>Rome: Total War - Barbarian Invasion</strong><br>\t\t\t\t\t (official expansion pack to Rome: Total War) Witness the decline of Rome as Barbarian hordes attack, forcing a bitter internal struggle between rival factions.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Voted 2004 Best Strategy game by IGN, GameSpy and GameSpot.<br>\t\t\t\t\t</li><li>Fight alongside or against history's greatest leaders such as Julius Caesar, Spartacus, and Hannibal to expand or destroy the Roman Empire.<br>\t\t\t\t\t</li><li>Lay siege against the Romans as Attila the Hun, fearful Saxons, or other savage factions using signature weapons and abilities.<br>\t\t\t\t\t</li><li>Command warrior-tested legions in cinematic epic battles with thousands of soldiers on-screen at once.<br>\t\t\t\t\t</li><li>A century-spanning campaign charges players with strategically managing the economic, civil, religious and military arms of their empire.</li></ul>"}, "500": {"name": "Left 4 Dead", "appid": "500", "is_free": false, "publishers": ["Valve"], "detailed_description": "From Valve (the creators of Counter-Strike, Half-Life and more) comes Left 4 Dead, a co-op action horror game for the PC and Xbox 360 that casts up to four players in an epic struggle for survival against swarming zombie hordes and terrifying mutant monsters.                    <br>\t\t\t\t\tSet in the immediate aftermath of the zombie apocalypse, L4D's survival co-op mode lets you blast a path through the infected in four unique “movies,” guiding your survivors across the rooftops of an abandoned metropolis, through rural ghost towns and pitch-black forests in your quest to escape a devastated Ground Zero crawling with infected enemies. Each &quot;movie&quot; is comprised of five large maps, and can be played by one to four human players, with an emphasis on team-based strategy and objectives.                     <br>\t\t\t\t\tNew technology dubbed &quot;the AI Director&quot; is used to generate a unique gameplay experience every time you play. The Director tailors the frequency and ferocity of the zombie attacks to your performance, putting you in the middle of a fast-paced, but not overwhelming, Hollywood horror movie.                    <br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Addictive single player, co-op, and multiplayer action gameplay from the makers of Counter-Strike and Half-Life                    <br>\t\t\t\t\t</li><li>Versus Mode lets you compete four-on-four with friends, playing as a human trying to get rescued, or as a zombie boss monster that will stop at nothing to destroy them.<br>\t\t\t\t\t</li><li>See how long you and your friends can hold out against the infected horde in the new Survival Mode<br>\t\t\t\t\t</li><li>An advanced AI director dynamically creates intense and unique experiences every time the game is played                     <br>\t\t\t\t\t</li><li>20 maps, 10 weapons and unlimited possibilities in four sprawling &quot;movies&quot;                     <br>\t\t\t\t\t</li><li>Matchmaking, stats, rankings, and awards system drive collaborative play                     <br>\t\t\t\t\t</li><li>Designer's Commentary allows gamers to go &quot;behind the scenes&quot; of the game                     <br>\t\t\t\t\t</li><li>Powered by Source and Steam                     </li></ul><h2 class=\"bb_tag\">THE SACRIFICE</h2><img src=\"http://storefront.steampowered.com/v/gfx/apps/550/extras/pageRibbon.jpg\" >&quot;The Sacrifice” is  the new add-on for Left 4 Dead.<br><br>&quot;The Sacrifice&quot; is the prequel to &quot;The Passing,&quot; and takes place from the L4D Survivors' perspective as they make their way South. In addition to advancing the story, &quot;The Sacrifice&quot; introduces a new style finale featuring &quot;Sacrificial Gameplay&quot; where players get to decide who will give their life so the others may live.<br><br>In The Sacrifice for Left 4 Dead owners receive &quot;The Sacrifice&quot; campaign playable in Campaign, Versus,  and Survival modes."}, "1610": {"name": "Space Empires IV Deluxe", "appid": "1610", "is_free": false, "publishers": ["Strategy First"], "detailed_description": "The award-winning Space Empires IV Deluxe is the latest edition in the Space Empires series. A grand strategy title in the space 4X (explore, expand, exploit, and exterminate) genre, Space Empires has already found a place in the heart of strategy gamers everywhere.<br />\r\n\t\t\tResearch technology, design new ships, wage war on a tactical level, put down rebellions, meet and greet new species, and much more. All the level and campaign design tools are included, allowing anyone to become a part of the expansive Space Empires Mod community."}, "3540": {"name": "Peggle™ Nights", "appid": "3540", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": "<p>The sun has set at the Peggle Institute, but the bouncy delight has just begun! Join the Peggle Masters on a dreamtime adventure of alter egos and peg-tastic action. Stay up late to aim, shoot and clear orange pegs, and bask in Extreme Fever glory under the silver moon. Then, put your Peggle skills to the ultimate test in Challenge mode. If you can master all that fevered action, play to your heart's content with Duel mode and Quick Play. Plus, you can stock your Trophy Room and revel in clickable replays for even more rebounding joy!</p>                    \n\t\t\t\t\t<ul>                    \n\t\t\t\t\t<li>Explore all 60 levels in Adventure mode</li>                    \n\t\t\t\t\t<li>Meet a new Peggle Master and learn a new Magic Power</li>                    \n\t\t\t\t\t<li>Test your skills in 60 challenges</li>                    \n\t\t\t\t\t<li>Unlock Duel mode to compete against friends and the computer</li>                    \n\t\t\t\t\t<li>Celebrate your Peggle prowess with clickable replays and a Trophy Room!</li>                    </ul>                    "}, "2320": {"name": "QUAKE II", "appid": "2320", "is_free": false, "publishers": ["id Software"], "detailed_description": "<p>Shortly after landing on an alien surface, you learn that hundreds of your men have been reduced to just a few. Now you must fight your way through heavily fortified military installations, lower the city's defenses and shut down the enemy's war machine. Only then will the fate of humanity be known.</p>"}, "2520": {"name": "Gumboy - Crazy Adventures™", "appid": "2520", "is_free": true, "publishers": ["CINEMAX, s.r.o."], "detailed_description": "Gumboy has fun and novel gameplay set in a richly imagined world.   With simple game controls, Gumboy lets the player bounce, roll, float, and fly through the world.  Additionally, Gumboy can change size, shape and material.  Moving through the world with different physical properties and gameplay:  spheres, cubes or stars filled with rubber, air or water...  Combine these elements with objectives centered on particle effects and control and Gumboy is refreshing, challenging, and original fun for everyone for all types of gamers.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Innovative game based on ball physics in various environments<br>\t\t\t\t\t</li><li>Over 50 levels within a fairy-tale atmosphere<br>\t\t\t\t\t</li><li>Interactive environments: water, wind, rain, teleports, boosts, sticky and slippery surfaces<br>\t\t\t\t\t</li><li>Original artistic depiction of 6 various worlds (forest, field, cave, magical world...)<br>\t\t\t\t\t</li><li>Fantastic lighting and dynamic effects<br>\t\t\t\t\t</li><li>Detailed graphics with acceleration and fascinating particle effects<br>\t\t\t\t\t</li><li>Various ball shapes: sphere, cube, star<br>\t\t\t\t\t</li><li>Various ball fillings with an influence on its characteristics: rubber, air, water<br>\t\t\t\t\t</li><li>Saves games in progress and the results achieved for several players<br>\t\t\t\t\t</li><li>Game supports widescreen displays (16:9)</li></ul>"}, "2540": {"name": "RIP - Trilogy™", "appid": "2540", "is_free": false, "publishers": [""], "detailed_description": "With the completion of the third title in the RIP series, the RIP games have become an instant classic in the arcade-shooter genre. RIP \u0097 Trilogy brings all three RIP titles into one exciting and heart-pounding pack.<br>RIP<br><br>Not afraid of Death? What if he is accompanied by Halloween and Rock-N-Roll? Play the part of these antiheroes and go to war in this all-out action experience! Each character has their own strengths and skills, but this is not a game for the faint of heart. With over 40 levels to RIP through, the results are murderous!<br><ul class=\"bb_ul\"><li>40 levels of murder and mayhem<br></li><li>A variety of guns and battle magic<br></li><li>Three chilling characters<br></li><li>A toned-down, less violent kid's mode</li></ul>RIP2 \u0097 Strike Back<br><br>Your favorite antiheroes are here to strike back with another score to settle. Death, Halloween and Rock-N-Roll...each character has his own strengths and skills, so pick one and start shooting. In Story Mode, you'll fight through 60 furious levels using an arsenal of upgradeable weapons, tanks, helicopters and turrets or for a quick adrenaline fix, play Rush Mode and see how long you can last.<br><ul class=\"bb_ul\"><li>Choose from a large arsenal of weapons<br></li><li>Assorted vehicles including gun turrets, tanks and helicopters<br></li><li>Variety of abilities and power-ups<br></li><li>60 levels of unlimited gameplay<br></li><li>Huge boss levels for more challenge<br></li><li>Two modes of play; Rush Mode or Story Mode</li></ul>RIP3 \u0097 The Last Hero<br><br>RIP3 \u0097 The Last Hero combines the dynamics of a hardcore shooter while preserving the elusive classic arcade appeal and never lets up on the intense action. Every level presents a new challenge, requiring you to not only prove your sharp-shooting, but to think and act tactically.<br>The terrain and environments must be employed to survive waves of adversaries, but since all in-game objects are destructible, you must think fast. Your hero will travel all over the world from the African jungle to the Arctic snow, through secret labs and bunkers, in the streets and skyscrapers of Metropolis city and also go into deep space using a hijacked spaceship.<br><ul class=\"bb_ul\"><li>100 levels of arcade shooting action<br></li><li>6 unique playable characters with varied and powerful skills to develop<br></li><li>A huge arsenal of destructive weaponry, each with 2 shooting modes<br></li><li>Capture and control military vehicles, including Tanks, Helicopters and Battle Turrets<br></li><li>Fully destructible battlefield - all the objects can be damaged and destroyed<br></li><li>Includes a space adventure minigame, where you pilot the Vostok-23 starship<br></li><li>12 Huge, challenging bosses evoke classic arcade gameplay<br></li><li>3 difficulty level settings to increase the intensity<br></li><li>Special bonuses and secrets are scattered throughout the game<br></li><li>Cooperative multiplayer for two players to battle against the enemy hordes<br></li><li>Multiplayer death-match for up to 6 players over LAN</li></ul>"}, "4470": {"name": "Silverfall: Earth Awakening", "appid": "4470", "is_free": false, "publishers": ["Focus Home Interactive"], "detailed_description": "<p>Silverfall Earth Awakening is an action RPG with unique graphical feel offering a fantastic quest to explore the new territories of Nelwë. In this heroic fantasy world where nature and technology collide you will have to make important choices which will lead you to side with one or the other. Play any one of the available six races, of which 2 are new: the stocky and lucky 'Dwarves' and the agile and treacherous 'Lizardmen', and prepare yourself to confront an impressive array of creatures and formidable bosses to save the realm of Nelwë.</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Alongside the Elves, Goblins, Trolls and Humans, discover 2 new playable races with 5 specific skills each : The dwarves and the Lizardmen, and then customize your hero ( skin, gender , hair, etc .)</li>\n\t\t\t\t\t<li>Master over 156 skills and magic spells, including 8 new exclusive 'Ultimate' skills and 12 unique 'High Level' skills for an even more devastating result.</li>\n\t\t\t\t\t<li>Use different object crafting skills and make thousands of new and unique weapons, armour and spells. </li>\n\t\t\t\t\t<li>Discover a new, fully adaptable game interface with improved ergonomics in which you can now control your hero with the mouse or keyboard.</li>\n\t\t\t\t\t<li>Import your hero from Silverfall to Earth Awakening and keep your level, equipment and skills...or start the adventure from the beginning with a level 45 hero.</li>\n\t\t\t\t\t<li>Playable with up to 8 players in multiplayer mode via LAN and in cooperative or PVP mode via the Internet.</li></ul>"}, "4560": {"name": "Company of Heroes - Legacy Edition", "appid": "4560", "is_free": true, "publishers": ["SEGA"], "detailed_description": "<h2 class=\"bb_tag\">DISCLAIMER</h2><i>This legacy version of COH1 will also give you access to <a href=\"http://store.steampowered.com/app/228200/Company_of_Heroes\" target=\"_blank\" rel=\"noreferrer\"  ><u>the latest updated version of COH1</u></a> - simply called &quot;Company of Heroes&quot; in your Steam library. <strong>PLEASE USE THE LATTER TO PLAY ONLINE</strong>, and visit the associated pages to join the COH1 Steam Community &amp; Modding scene:<br><strong><ul class=\"bb_ul\"><li><a href=\"http://steamcommunity.com/app/228200\" target=\"_blank\" rel=\"noreferrer\"  ><u>COH1 Community Hub</u></a><br></li><li><a href=\"http://steamcommunity.com/app/228200/workshop/\" target=\"_blank\" rel=\"noreferrer\"  ><u>COH1 Steam Workshop</u></a></li></ul></strong></i><h2 class=\"bb_tag\">DESCRIPTION</h2>Delivering a visceral WWII gaming experience, Company of Heroes redefines real time strategy gaming by bringing the sacrifice of heroic soldiers, war-ravaged environments, and dynamic battlefields to life. Beginning with the D-Day Invasion of Normandy, players lead squads of Allied soldiers into battle against the German war machine through some of the most pivotal battles of WWII. Through a rich single player campaign, players experience the cinematic intensity and bravery of ordinary soldiers thrust into extraordinary events.<br><br>\t\t\t\t\t<ul class=\"bb_ul\"><li><strong>A Cinematic Single Player Experience</strong> that captures the turmoil of WWII as never before.<br>\t\t\t\t\t</li><li><strong>Advanced squad AI</strong> brings your soldiers to life as they interact with the changing environment, take cover, and execute advanced squad tactics to eliminate all enemy opposition. <br>\t\t\t\t\t</li><li><strong>Stunning Visuals </strong> - Relic's next generation cutting-edge engine provides graphic quality and a physics driven world that is unprecedented in an RTS.<br>\t\t\t\t\t</li><li><strong>Environmental Strategy</strong> - Real-time physics and a completely destructible environment guarantee no two battles ever play out in the same way. Destroy anything and re-shape the battlefield! Use buildings and terrain to your advantage, or deny them to the enemy.<br>\t\t\t\t\t</li><li><strong>2-8 Player Multiplayer Competition via LAN or Internet</strong> - Go online with friends and join the ultimate battle of Axis versus Allies.</li></ul>"}, "3380": {"name": "Dynomite Deluxe", "appid": "3380", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": ""}, "2730": {"name": "ThreadSpace: Hyperbol Demo", "appid": "2730", "is_free": true, "publishers": ["Atari"], "detailed_description": "<p>The demo version of Iocaine Studios' futuristic multiplayer action-strategy game offers four hours of free play. Battle up to 16 players on four of the eighteen maps available in the retail version.</p>"}, "3300": {"name": "Bejeweled 2 Deluxe", "appid": "3300", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": ""}, "380": {"name": "Half-Life 2: Episode One", "appid": "380", "is_free": false, "publishers": ["Valve"], "detailed_description": "Half-Life 2 has sold over 4 million copies worldwide, and earned over 35 Game of the Year Awards. Episode One is the first in a series of games that reveal the aftermath of Half-Life 2 and launch a journey beyond City 17. Also features two multiplayer games. Half-Life 2 not required."}, "4410": {"name": "City Life Deluxe", "appid": "4410", "is_free": false, "publishers": ["Monte Cristo"], "detailed_description": "<p>Construct the City of the 21st Century with City Life!</p>\n\t\t\t\t\t<p>From superb villas in residential neighborhoods to imposing skyscrapers in the financial district, design, construct and develop the city of your dreams. Provide comfort and satisfaction for your citizens by offering them adequate leisure and entertainment facilities, all the while ensuring that taxes and other charges are collected efficiently. It's up to you to manage this city effectively, ensuring booming development while at the same time regulating the very delicate issues of pollution and traffic. You must also see that diverse communities share the city in the best way possible to guarantee a peaceful and prosperous city.</p>\n\t\t\t\t\t<p>City Life is a next-generation city simulation that allows you to build and manage a living metropolis in gorgeous real-time 3D. The 3D game engine provides a level of detail and animation unprecedented in the city builder genre. Among the game's superior features are highly realistic environments, reflection mapping, a tree engine, dynamic shadowing, and an immersion mode (giving players the first-person point of view as they advance through cities). City Life is a unique game experience and an exciting new challenge for the many fans of city builders and simulations.</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li><span class=\"copyHead\">15 new global landmarks:</span> Includes Big Ben (London / England), CN Tower (Toronto / Canada), Colosseum (Roma / Italia), Eiffel Tower (Paris / France), Empire State Building (New York / USA), Jin Mao (Shanghai / China), Kremlin (Moscow / Russia), Olympiastadion (Montréal / Québec), Parthenon (Athens / Greece), Petronas Towers (Kuala Lumpur / Malaysia), Sears Tower (Chicago / USA), Sydney Opera House (Sydney / Australia), Statue of Liberty (New York / USA), Taj Mahal (Agra / India), White House (Washington / USA)</li>\n\t\t\t\t\t<li><span class=\"copyHead\">85 original buildings:</span> 30 residential buildings, 30 industrial buildings, 15 city services buildings (healthcare, safety, etc.), 10 entertainment facilities buildings</li>\n\t\t\t\t\t<li><span class=\"copyHead\">City Life's Building Editor:</span> Discover a powerful building creation tool based on a modular system. The tool contains 166 construction kits for more than 3,000 available elements.</li></ul>"}, "1500": {"name": "Darwinia", "appid": "1500", "is_free": false, "publishers": ["Introversion Software"], "detailed_description": "Combining fast-paced action with strategic battle planning, Darwinia features a novel and intuitive control mechanism, a graphical style ripped from 80's retro classics like Tron and Defender, and a story concerning a tribe of nomadic sprites trapped in a modern 3D world."}, "4520": {"name": "Full Spectrum Warrior", "appid": "4520", "is_free": false, "publishers": ["THQ Nordic"], "detailed_description": "The U.S. Army is the most powerful ground force in the entire world. The backbone of a ground invasion is the U.S. Army Infantry, and in the midst of combat, their skills, courage, and teamwork are put to the test.<br>\t\t\t\t\tWhile readiness continues to be the U.S. Army's top priority, how it goes about its business is changing. Full Spectrum Warrior began as a training aid for the U.S. Army to reinforce Army doctrine and team effort within the troops. It is the most realistic portrayal of Infantry-level urban warfare via unique tactical action gameplay. Players become the Squad Leader, commanding Alpha and Bravo squads. There is potential for danger down every alley, behind every window. Watch those angles folks, we've got a job to do here. Hooah!<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Unique combination of tactical and action gameplay.<br>\t\t\t\t\t</li><li>Authentic implementation of U.S. Army Infantry doctrine.<br>\t\t\t\t\t</li><li>Simple control scheme lets you command eight soldiers in real time.<br>\t\t\t\t\t</li><li>Squad equipment reflects real weaponry and equipment currently in use by the U.S. Army.<br>\t\t\t\t\t</li><li>Immersive urban environments with danger around every corner.<br>\t\t\t\t\t</li><li>2-player co-op, each player controls one fire team.<br>\t\t\t\t\t</li><li>Includes 2 exclusive bonus levels not available on Xbox.</li></ul>"}, "630": {"name": "Alien Swarm", "appid": "630", "is_free": true, "publishers": ["Valve"], "detailed_description": "Alien Swarm is a game and Source SDK release from a group of talented designers at Valve who were hired from the Mod community.<br>\t\t\t\t\tAvailable free of charge, the game thrusts players into an epic bug hunt featuring a unique blend of co-op play and squad-level tactics. With your friends, form a squad of four distinct IAF Marine classes. Plan your attack using an unlockable arsenal of weapons with countless loadout configurations against a wide variety of aliens. Blaze your way through an overrun, off-world colony, eradicating the alien infestation in environments ranging from the icy planet's surface, to a subterranean lava-flooded mining facility.<br>\t\t\t\t\tAlong with the game get the complete code base for Alien Swarm that features updates to the Source engine as well as the SDK. Alien Swarm adds 3rd person camera, depth of field, improved dynamic shadows and a wide variety of gameplay additions to the Source engine.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Tactical, 4 player co-op action game with a top-down perspective <br>\t\t\t\t\t</li><li>Complete game code and mod tools <br>\t\t\t\t\t</li><li>Unlock persistent items by gaining levels <br>\t\t\t\t\t</li><li>Over 40 weapons and equipment with countless loadout configurations <br>\t\t\t\t\t</li><li>4 unique classes and 8 unique characters <br>\t\t\t\t\t</li><li>Matchmaking, Steam Cloud, Steam Stats <br>\t\t\t\t\t</li><li>64 achievements <br>\t\t\t\t\t</li><li>Tile-based map generation tool <br>\t\t\t\t\t</li><li>Powered by Source and Steam <br>\t\t\t\t\t</li></ul>"}, "2700": {"name": "RollerCoaster Tycoon® 3: Platinum", "appid": "2700", "is_free": false, "publishers": ["Atari", "Aspyr (Mac)"], "detailed_description": "Rollercoaster Tycoon 3 Platinum combines the excitement of rollercoasters with the fun of great strategy sim. RCT3 Platinum combines the roller coaster theme park fun of the Roller Coaster Tycoon 3 with included expansion packs Soaked! and Wild! Now enjoy more options than ever. Build your own water slide or create your own safari with real animals. Watch guest reactions to your ultimate theme park!<br><br><ul class=\"bb_ul\"><li>Grab a front seat for the ride of your life with the jaw-dropping Coaster Cam.<br></li><li>See every detail in stunning 3D with fully controllable park cameras.<br></li><li>Cope with changing weather patterns and enjoy beautiful vistas, sunsets, moonlight, and more.<br></li><li>Experience the latest extreme coasters and heart-pumping rides! Live Every spine tingling detail in stunning 3-D with fully controllable cameras.<br></li><li>Spice up any backgrounds, rides, fireworks display and laser light shows with your own music.<br></li><li>Create your own park guests and groups with the Peep Designer and experience their reactions to the rides you build! Soak them and watch their reactions! Send them on wild safari and let them pet the animals!<br></li><li>Create savage encounters and thrilling safaris! Conquer 12 Wild! Scenarios and experience cool jungle and prehistoric design themes.<br></li><li>Play through dozens of scenarios in three difficulty modes or build without limits in Sandbox mode.<br></li><li>Create pyrotechnic wonders and laser light shows with the RollerCoaster Tycoon® 3 MixMaster.</li></ul>"}, "3580": {"name": "The Wizard's Pen™", "appid": "3580", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": "<p>The Wizard has vanished, and only you can find him in this spellbinding hidden-object adventure! The clues to the Wizard's whereabouts are in his workbook, but all the pages are blank. You'll need his magic pen to uncover and guess the image on each page. The better your guesses, the better your score &mdash; and every image you uncover brings you closer to finding the Wizard. Plus, you can play mystical mini-games, unlock special challenges, score bonus points and earn potent potions. It's a unique new twist on the seek-and-find genre that you've gotta try!</p>                    \n\t\t\t\t\t<ul>                    \n\t\t\t\t\t<li>Discover over 400 pages of hidden objects</li>                    \n\t\t\t\t\t<li>Power up with 10 magic potions</li>                    \n\t\t\t\t\t<li>Unlock 16 unique hidden-object mini-games!</li>                    \n\t\t\t\t\t<li>Open seven sketchbooks with special challenges</li>                    </ul>"}, "4600": {"name": "Full Pipe", "appid": "4600", "is_free": false, "publishers": ["1C Company"], "detailed_description": "\t\t\t<p>Everyone who's been through the Pipe describes it in a different way. Some say it's similar to our world, while others say it's quite the opposite... Rather than trying to describe the game, lets take a look at just a few of the characters you will meet on your journey through the pipe under your bed...</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li><strong>Guv-the-Drawer</strong> puts into his drawer any item that can fit it and after throws away big green egg with this item inside.. Doesn't like domino as it has bad influence on digestion. Basically he is a quite nice fellow.</li>\n\t\t\t\t\t<li><strong>Egggulper</strong> gulps eggs. He is greedy but it's possible to come to an agreement with him.</li>\n\t\t\t\t\t<img src=\"gfx/apps_extras/4600/images_p_10.gif\" align=\"right\">\n\t\t\t\t\t<li><strong>Weird Wacko</strong> is the sanest one among all the characters on the Second Floor but he suffers from a spirit of contradiction and an initial form of the Internet dependence (as we got to know afterwards)...</li>\n\t\t\t\t\t<li><strong>Small fries.</strong> No one knows how abundant they are. Small fries like retro music of the early 20th and they do no other harm.</li>\n\t\t\t\t\t<li><strong>Hand Thirty For.</strong> No one knows whose hand it is. When the jar overflows with Shrimps, it pulls them out upwards. All of them!</li>\n\t\t\t\t\t<li><strong>Tennes.</strong> He appears suddenly and disappears at once. Looks like a tennis-ball yet having all vitally important organs. Almost all of them.</li>\n\t\t\t\t\t</ul>\n\t\t\t\t\t<br><br>\n\t\t\t\t\t<img src=\"gfx/apps_extras/4600/images_p_11.gif\" align=\"right\">\n\t\t\t\t\t<p><strong>Game Features</strong></p>\n\n\n\t\t\t\t\t<p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>39 quest scenes    \n\t\t\t\t\t<li>45 original characters    \n\t\t\t\t\t<li>8 arcade games    \n\t\t\t\t\t<li>artistic animation    \n\t\t\t\t\t<li>pre-rendered 3D graphics    \n\t\t\t\t\t<li>nonlinear plot    \n\t\t\t\t\t<li>record and replay your own game scripts    \n\t\t\t\t\t<li>atmospheric sound and musical appearance  </ul></p>"}, "410": {"name": "Portal: First Slice", "appid": "410", "is_free": true, "publishers": ["Valve"], "detailed_description": "Help yourself to a generous, 11-level serving of Portal: First Slice, the official demo for the game that challenges you to think with portals. The winner of numerous Game of the Year awards introduces you to the test chambers at the Aperture Science Enrichment Center, where you'll learn to solve physical puzzles by opening portals to maneuver objects, and yourself, through space. "}, "3450": {"name": "Typer Shark! Deluxe", "appid": "3450", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": ""}, "2350": {"name": "QUAKE III: Team Arena", "appid": "2350", "is_free": false, "publishers": ["id Software"], "detailed_description": "<p>Never before have the forces aligned. United by name and by cause, The Fallen, Pagans, Crusaders, Intruders, and Stroggs must channel their power into an allied operation where teamwork is the only method of mass destruction. Four distinct games test each troop's synthesis and strength to exacting degrees. Cooperation is the only course of action, and war, the only alternative. Soldiers once alone in their struggle, now face the Arena as one.</p>"}, "30": {"name": "Day of Defeat", "appid": "30", "is_free": false, "publishers": ["Valve"], "detailed_description": "Enlist in an intense brand of Axis vs. Allied teamplay set in the WWII European Theatre of Operations. Players assume the role of light/assault/heavy infantry, sniper or machine-gunner class, each with a unique arsenal of historical weaponry at their disposal. Missions are based on key historical operations. And, as war rages, players must work together with their squad to accomplish a variety of mission-specific objectives."}, "4780": {"name": "Medieval II: Total War™ Kingdoms", "appid": "4780", "is_free": false, "publishers": ["SEGA", "Feral Interactive (Mac)", "Feral Interactive (Linux)"], "detailed_description": "Medieval II: Total War Kingdoms is the official expansion to last year's award-winning Medieval II: Total War, presenting players with all-new territories to explore, troops to command, and enemies to conquer.<br>\t\t\t\t\tKingdoms is the most content-rich expansion ever produced for a Total War game, with four new entire campaigns centered on expanded maps of the British Isles, Teutonic Northern Europe, the Middle East, and the Americas. In Medieval II, you were only given a tantalizing glimpse of South America, but in Kingdoms, vast tracts of land in both North and South America have been opened up for you to conquer. All-new factions from the New World are also now fully playable, including the Aztecs, Apaches, and Mayans.<br>\t\t\t\t\tAlong with the new maps in the Britannia, Teutonic, Crusades, and New World Campaigns, there are 13 new factions to play, over 110 units to control, and 50 building types, adding up to 80 hours of new gameplay. Kingdoms also offers new multiplayer maps and hotseat multiplayer, a first for the Total War series, allowing you to play one-versus-one campaign games on the same computer.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Four new campaigns - Britannia, Teutonic, Crusades, and New World<br>\t\t\t\t\t</li><li>10 new units<br>\t\t\t\t\t</li><li>13 new factions<br>\t\t\t\t\t</li><li>9 new agents<br>\t\t\t\t\t</li><li>50 new buildings<br>\t\t\t\t\t</li><li>60+ new territories across four new maps<br>\t\t\t\t\t</li><li>15 new multiplayer maps and scenarios<br>\t\t\t\t\t</li><li>All-new 1v1 hotseat multiplayer campaign mode</li></ul>"}, "3310": {"name": "Chuzzle Deluxe", "appid": "3310", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": ""}, "2270": {"name": "Wolfenstein 3D", "appid": "2270", "is_free": false, "publishers": ["id Software"], "detailed_description": "<p>Maybe it was the fact that people got to blow away Nazis. Maybe it was the sheer challenge of it all. For whatever reason, Wolfenstein 3D and Spear of Destiny, pioneered the first-person shooter genre and brought its legendary creators, id Software, worldwide notoriety and numerous awards. In fact, The Computer Gaming World Hall of Fame recognized Wolfenstein 3D as helping to shape the overall direction of the computer gaming industry.</p>"}, "870": {"name": "Left 4 Dead 2", "appid": "870", "is_free": false, "publishers": ["Valve"], "detailed_description": "Set in the zombie apocalypse, Left 4 Dead 2 (L4D2) is the highly anticipated sequel to the award-winning Left 4 Dead, the #1 co-op game of 2008.<br>                    This co-operative action horror FPS takes you and your friends through the cities, swamps and cemeteries of the Deep South, from Savannah to New Orleans across five expansive campaigns.<br>                    You'll play as one of four new survivors armed with a wide and devastating array of classic and upgraded weapons. In addition to firearms, you'll also get a chance to take out some aggression on infected with a variety of carnage-creating melee weapons, from chainsaws to axes and even the deadly frying pan.<br>                    You'll be putting these weapons to the test against (or playing as in Versus) three horrific and formidable new Special Infected. You'll also encounter five new \u0093uncommon\u0094 common infected, including the terrifying Mudmen.<br>                    Helping to take L4D's frantic, action-packed gameplay to the next level is AI Director 2.0. This improved Director has the ability to procedurally change the weather you'll fight through and the pathways you'll take, in addition to tailoring the enemy population, effects, and sounds to match your performance. L4D2 promises a satisfying and uniquely challenging experience every time the game is played, custom-fitted to your style of play.<br>                    <ul class=\"bb_ul\"><li>Next generation co-op action gaming from the makers of Half-Life, Portal, Team Fortress and Counter-Strike.<br>                    </li><li>Over 20 new weapons &amp; items headlined by over 10 melee weapons – axe, chainsaw, frying pan, baseball bat – allow you to get up close with the zombies<br>                    </li><li>New survivors. New Story. New dialogue. <br>                    </li><li>Five expansive campaigns for co-operative, Versus and Survival game modes.<br>                    </li><li>An all new multiplayer mode.<br>                    </li><li>Uncommon common infected. Each of the five new campaigns contains at least one new \u0093uncommon common\u0094 zombies which are exclusive to that campaign. <br>                    </li><li>AI Director 2.0: Advanced technology dubbed \u0093The AI Director\u0094 drove L4D's unique gameplay – customizing enemy population, effects, and music, based upon the players’ performance. L4D 2 features \u0093The AI Director 2.0\u0094 which expands the Director’s ability to customize level layout, world objects, weather, and lighting to reflect different times of day.<br>                    </li><li>Stats, rankings, and awards system drives collaborative play<br>                    </li></ul>"}, "4810": {"name": "Heroes of Annihilated Empires Demo", "appid": "4810", "is_free": true, "publishers": ["GSC Game World"], "detailed_description": ""}, "1840": {"name": "Source Filmmaker", "appid": "1840", "is_free": true, "publishers": ["Valve"], "detailed_description": "The Source Filmmaker (SFM) is the movie-making tool built and used by us here at Valve to make movies inside the Source game engine. Because the SFM uses the same assets as the game, anything that exists in the game can be used in the movie, and vice versa. By utilizing the hardware rendering power of a modern gaming PC, the SFM allows storytellers to work in a what-you-see-is-what-you-get environment so they can iterate in the context of what it will feel like for the final audience.<br><br>To get started, just click the button above to install. The SFM includes all the base game assets from Team Fortress 2 along with assets from some of the first “Meet the Team” short films.<h2 class=\"bb_tag\">Resources</h2>Once you're up and running, here are some general resources for finding help and learning how to get the most out of the Source Filmmaker.<br><ul class=\"bb_ul\"><li><a href=\"https://developer.valvesoftware.com/wiki/Source_Filmmaker\" target=\"_blank\" rel=\"noreferrer\"  >Official Wiki Documentation</a><br></li><li><a href=\"https://steamcommunity.com/linkfilter/?url=http://www.sourcefilmmaker.com/faq/\" target=\"_blank\" rel=\"noopener\"  >Frequently Asked Questions</a><br></li><li><a href=\"http://www.youtube.com/playlist?list=PL2B46DEB4157E67C4&amp;feature=plcp\" target=\"_blank\" rel=\"noreferrer\"  >Video Tutorials</a><br></li><li><a href=\"http://steamcommunity.com/sfm/discussions/?appid=1840\" target=\"_blank\" rel=\"noreferrer\"  >Community Discussions</a><br></li><li><a href=\"https://developer.valvesoftware.com/wiki/SFM/Bug_reports\" target=\"_blank\" rel=\"noreferrer\"  >How to file bug reports</a></li></ul>"}, "2920": {"name": "Sub Command", "appid": "2920", "is_free": false, "publishers": ["Strategy First"], "detailed_description": "<p>Take charge of the most deadly modern-day submarines in the world - three distinct submarines across two unique and challenging campaigns. Utilize cutting-edge sensor and weapon technology to locate, track and destroy the enemy - even deliver Tomahawk missiles to inland targets. Whether transiting, diving, or surfacing you control the smartest, stealthiest and most feared subs on the water today!</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Three submarines to command - Seawolf, 688(I) and Akula. Each contains authentic naval systems including Sonar, Radar and Target Motion Analysis.</li>\n\t\t\t\t\t<li>Test your skills while firing Tomahawk missiles, rescuing crippled subs, rising through the polar ice cap to communicate information and much more.</li>\n\t\t\t\t\t<li>Easy to use game interface - With straightforward controls and automated crewmen, controlling a submarine has never been easier.</li>\n\t\t\t\t\t<li>Enhanced sound and 3D graphics engine - 3D Objects (over 250), from Russian trawlers to France's Mirage fighters - plus exacting sound modes pull you in like never before. You won't just hear the torpedos, you will feel them.</li></ul>"}, "3430": {"name": "Pizza Frenzy Deluxe", "appid": "3430", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": ""}, "2630": {"name": "Call of Duty® 2", "appid": "2630", "is_free": false, "publishers": ["Activision", "Aspyr (Mac)"], "detailed_description": "Call of Duty® 2 redefines the cinematic intensity and chaos of battle as seen through the eyes of ordinary soldiers fighting together in epic WWII conflicts. The sequel to 2003's Call of Duty, winner of over 80 Game of the Year awards, Call of Duty 2 offers more immense, more intense, more realistic battles than ever before, thanks to the stunning visuals of the new COD™2 engine.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>The #1 WWII shooter development team returns with an amazing new experience: Developed by Infinity Ward, creators of the award-winning Call of Duty. All-new, unprecedented enhancements from stunningly realistic graphics to seamless gameplay, thanks to the revolutionary COD2 engine, groundbreaking AI, and choice-based gameplay innovations. Beautifully rendered snow, rain, fog, and smoke, combined with dynamic lighting and shadows, make this the most intense WWII shooter yet.<br>\t\t\t\t\t</li><li>New conflicts and enemies to face: Call of Duty 2 brings you bigger battles, with more tanks, troops, and explosions on-screen, and bigger scope, with a wide range of locales and environments across the European Theater. Fight &quot;The Desert Fox&quot; across the scorching sands of North Africa as wave upon wave of tanks clash in the desert. Use rocket-propelled grappling hooks alongside your Army Ranger squad to storm and scale the cliffs of Pointe du Hoc against a relentless German counterassault, and slog through urban chaos as a tank hunter in war-torn Russia. <br>\t\t\t\t\t</li><li>Rely on your squad as never before: The dozens of Allied soldiers surrounding you are fully aware of the changing situations around them, and will let you know using an all-new, context-sensitive battle chatter system. They will draw enemy fire, lay down cover for you, use foxholes and moving tanks for cover, and warn you of incoming enemy troops and hostile fire.<br>\t\t\t\t\t</li><li>Choice-based gameplay: Play through missions in the order you see fit. Will you decide to play first as a sniper or as a tank commander? It's your call. Open-ended battlefields allow you to individualize your tactics and choose the order in which you complete your objectives. <br>\t\t\t\t\t</li><li>Multiplayer Mayhem: Go online for intense Axis vs. Allies team-based multiplayer action, building on the hugely popular Call of Duty multiplayer modes.</li></ul>"}, "2870": {"name": "X Rebirth", "appid": "2870", "is_free": false, "publishers": ["Egosoft"], "detailed_description": "<h1>Collector's Edition</h1><p>This Collector's Edition of <strong>X Rebirth</strong> includes the following items:<br><ul class=\"bb_ul\"><li>DLC: The Teladi Outpost<br></li><li>DLC: Home of Light <strong>(new!)</strong><br></li><li>Soundtrack Volume 1 (MP3)<br></li><li>Exclusive: Soundtrack Volume 2 (MP3)<br></li><li>Optional download: X - The Space Opera - Per Musica ad Albion (Video)<br></li><li>Bonus download with artworks and X encyclopedia</li></ul><br>The bonus content will be placed in your X Rebirth installation folder:<br>...Steam\\SteamApps\\common\\X Rebirth\\Bonus Content</p><br><h1>About the Game</h1>In the distant future, the X universe faces a period of profound and irrevocable change. While the universe stumbles towards an uncertain future, countless adventures await as new enemies rise in search of power. Enter a young adventurer and his unlikely female ally traveling in an old, battered ship with a glorious past - two people alone against the galaxy, playing a key part in the events to come. The fate of the universe rests in the hands of the player...<br><br><strong>X Rebirth</strong> represents a spectacular new beginning for the X series, offering loyal fans and newcomers alike a vast, vivid and extremely detailed universe to explore throughout the game. Varied gameplay elements such as action-packed space combat, detailed trading mechanics and high-speed space exploration with fast travel allow players to experience a truly unique space saga that will keep them hooked for dozens of hours. <strong>X Rebirth</strong> features a whole new user experience - it is easier than ever to start with, and remains as deep as fans expect it.<h2 class=\"bb_tag\">FEATURES</h2><br><strong>TRADE!</strong> A fully simulated economy that means your actions really do matter. Travel the space highways to ﬁnd proﬁt in gigantic space cities, swarming with ships and drones.<br><br>++ Every ship you see has a task. Stop a freighter from reaching its destination and its cargo will be stopped too, causing prices to rise. ++<br><br><strong>FIGHT!</strong> From small scale skirmishes to epic ﬂeet encounters, battles in the X Universe know no limits. Choose to ﬁght for the military, work for the police or be a lawless pirate, or if you prefer just ﬁght when you need to defend yourself - it's up to you.<br><br>++ Take the action right into massive structures. Target turrets and shield generators to weaken your enemy, damage engines and jump drives to prevent their ships from escaping, or stop their factories producing to cripple their economy. ++<br><br><strong>BUILD!</strong> Create your own empire! From trading stations to large factories, farms to hightech military complexes, everything can belong to you. Build for trade and proﬁt or to strengthen your military presence and dominate your enemies.<br><br>++ Extend and upgrade your stations to make them operate more efﬁciently, with every element visible in glorious animated detail. Harvest your own resources to keep your empire running smoothly. ++<br><br><strong>THINK!</strong> A rich, detailed history and a deep complex plot await you, but you are free to decide when and where to take part. Explore the universe at your own pace - choose your own path and create your own destiny.<br><br>++ Get up-close and personal with aliens and humans alike. Land on stations, meet people, then accept missions from them or hire them as crew members for your ships. ++ <br><br><strong>TRADE, FIGHT, BUILD, THINK...</strong> in the X Universe - the biggest sandbox this side of the galaxy."}, "2420": {"name": "The Ship: Single Player", "appid": "2420", "is_free": false, "publishers": ["Blazing Griffin Ltd."], "detailed_description": "For PC gamers who enjoy multiplayer games with a bit of intelligence, intrigue and ingenuity, <strong>The Ship</strong> is a murder mystery alternative to traditional FPS multiplayer games.  Each player is given a Quarry to kill - and must evade their own Hunter in the process, all set on board a series of 1920s art deco cruise ships.<br><br>The Ship is owned by the mysterious Mr X and as one of many 'lucky' recipients of a free ticket you arrive on board The Ship to find there's a catch to your luxury cruise.  You are coerced into a brutal Hunt to indulge Mr. X's fantasies, under threat of death for not only yourself, but also your family. Your only chance to save yourself and your family is to play the Hunt and win.<br><br>Combining stealthy multiplayer action and a needs system, The Ship is a truly unique gaming experience.<br><br><strong>This package includes a tutorial, The Ship Single Player, which introduces you to some gameplay mechanics and storyline, and The Ship Multiplayer where you can hunt and be hunted by other players.</strong>"}, "4440": {"name": "Silverfall Demo", "appid": "4440", "is_free": true, "publishers": ["Monte Cristo"], "detailed_description": ""}, "100": {"name": "Counter-Strike: Condition Zero", "appid": "100", "is_free": false, "publishers": ["Valve"], "detailed_description": "With its extensive Tour of Duty campaign, a near-limitless number of skirmish modes, updates and new content for Counter-Strike's award-winning multiplayer game play, plus over 12 bonus single player missions, Counter-Strike: Condition Zero is a tremendous offering of single and multiplayer content."}, "3820": {"name": "BloodRayne 2", "appid": "3820", "is_free": false, "publishers": ["Majesco"], "detailed_description": "BloodRayne is a dhampir, born from the unnatural union of vampire and human. Blessed with the powers of a vampire but cursed with the thirst for blood and a weakness to sunlight, Rayne is challenged with her most personal battle yet as she hunts down her siblings. They have banded together and pledged to carry on their father's legacy of creating a new era of vampire supremacy where humans are mere cattle. Rayne's siblings have created 'The Shroud,' a mysterious substance that will render the sun's lethal rays harmless to vampires. Now only BloodRayne stands between an unsuspecting humanity and a horrifying vampire dawn."}, "3610": {"name": "Mystery P.I. - Lost in Los Angeles", "appid": "3610", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": "\n\t\t\t\t\t<p>Seek & Find the Hollywood Blockbuster! The only copy of this year's biggest blockbuster movie has gone missing the day before the VIP Hollywood premiere.  You are the world famous Mystery P.I. and have been hired to track down and return the lost movie.</p>\n\t\t\t\t\t<p>Seek & Find over 2100 hidden objects in 25 stunning L.A. locations like Malibu Beach, Rodeo Drive, Movie Sets, Hollywood hot spots and many more.  Hurry you only have 17 hours to locate the movie or the Hollywood Studio will be ruined.  If you succeed you will be awarded $15 Million dollars.</p>\n\t\t\t\t\t<p>Three addictive ways to play: Solve the L.A. Mystery to track down the lost blockbuster movie.  Collect all the special Keys & Film Reels to unlock two Unlimited game modes: Unlimited Seek & Find and a Match 3 Puzzle Game.</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Find over 2100 cleverly hidden objects.</li>\n\t\t\t\t\t<li>Investigate 25 amazing L.A. locations to find the clues.</li>\n\t\t\t\t\t<li>Three fun game modes: 'Solve the L.A. Mystery' and 2 Unlimited Bonus modes.</li>\n\t\t\t\t\t<li>Play 8 different mini-games: Match-3, Word Search, Circle Rotation, Memory Match, Tile Swap, Jigsaw and more.</li>\n\t\t\t\t\t<li>Locate the hidden Keys and Film Reels to unlock the Unlimited bonus games.</li>\n\t\t\t\t\t<li>Go for a Perfect Investigation & speed bonuses to become a Master PI.</li>\n\t\t\t\t\t</ul>"}, "4800": {"name": "Heroes of Annihilated Empires", "appid": "4800", "is_free": false, "publishers": ["GSC Game World"], "detailed_description": "<div style=\"background-image: url(gfx/4800_ContentBG.jpg); background-repeat: no-repeat;\">\n<p>Check out the <a href=\"http://steampowered.com/v/index.php?area=game&AppId=942\">high-resolution</a> trailer and see what the game is all about.</p>\n<p>Heroes of Annihilated Empires - is a fantasy-based trilogy game in the genre of RTS vs RPG for PC. A new proprietary 3D-engine is used to power the game. Episode one is set on Atlans island, the historical homeland of elves. The world of the game is living and huge, full of magic, mythical creatures, heroes and powerful forces involved in a large-scale conflict dating back to the past. The gameplay enables the player, controlling one of the heroes, as to lead thousands-strong armies into battle, so as combat with the hero alone, making use of the entire arsenal of possibilities and powerful magical spells. The possibility to upgrade your hero, improve his abilities, find artifacts and get random quests serves to hugely diversify the gameplay.</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Innovative opposing of two genres in one game - RTS vs RPG</li>\n\t\t\t\t\t<li>New 3D engine </li>\n\t\t\t\t\t<li>Detailed game world, including support of 5 novels from Europe-renowned writer Ilya Novak</li>\n\t\t\t\t\t<li>Mass-scale battles of thousands-strong armies</li>\n\t\t\t\t\t<li>Four unique races, individual skills, spells and artifacts</li>\n\t\t\t\t\t<li>12 heroes, 12 neutral races, 100 units and 150 various buildings</li>\n\t\t\t\t\t<li>Excellently developed character types and impressive unit animation</li>\n\t\t\t\t\t<li>Over 150 magic items and over 100 spells</li>\n\t\t\t\t\t<li>Original and involving story of the campaign</li>\n\t\t\t\t\t<li>Classic multiplayer over LAN or the Internet, up to 7 players in a game. Mix of two genres in the game: RTS vs RPG with a possibility to blend or choose in between during the play.</li>\n\t\t\t\t\t<li>Original card system of magic spells, equally interesting to both hardcore gamers and newbies. Over 50 spell cards</li>\n\t\t\t\t\t<li>Involving process of character level-ups throughout the entire game</li>\n\t\t\t\t\t<li>Stunning intros and cut-scenes. Comics in-between missions to give a deeper story insight</li></ul> \n</div>"}, "4920": {"name": "Natural Selection 2", "appid": "4920", "is_free": false, "publishers": ["Unknown Worlds Entertainment"], "detailed_description": "<img src=\"http://cdn.akamai.steamstatic.com/steam/apps/4920/extras/Inline4_OnosMarine.jpg?t=1509126512\" ><br><br>Natural Selection 2 pits alien against human in an action-packed struggle for survival. Wield devastating weaponry as a Frontiersman marine, or become the xenomorph as a deadly Kharaa lifeform. <br><br><img src=\"http://cdn.akamai.steamstatic.com/steam/apps/4920/extras/Inline2_FadeMarine.jpg?t=1509126512\" ><h2 class=\"bb_tag\">Strategy Meets Shooter</h2><br>Natural Selection 2 is a First Person Shooter and Real Time Stategy game rolled into one! Each team, alien and human, has a Commander. The Commander looks down on the battlefield and issues orders, places structures, collects resources, researches technology, and deploys abilities. <br><br><img src=\"http://cdn.akamai.steamstatic.com/steam/apps/4920/extras/Inline10_StrategyShooter.jpg?t=1509126512\" ><br><br>Here are some gameplay examples: A human Commander could drop health packs and ammunition to a trapped marine squad, and deploy sentry guns to help them defend their position. Or an alien Commander could grow a new Hive to spread infestation throughout newly captured territory, allowing more alien eggs to spawn...<br><br><img src=\"http://cdn.akamai.steamstatic.com/steam/apps/4920/extras/Inline11_BattleRoyale.jpg?t=1509126512\" ><h2 class=\"bb_tag\">Two Unique Sides</h2><br>Aliens players choose to evolve into one of five lifeforms: The fast, fearsome Skulk can run on walls and deliver massive damage with its jaws. Lerks fly and deploy gasses to support their teammates in battle. Gorges heal other lifeforms and build tunnels, hydra turrets, walls, and other tactical structures. Fades blink in and out of battle, picking off marines with giant scythes. Finally, the giant Onos is so massive and so tough, that even entire marine squads can't take it down.<br><br><img src=\"http://cdn.akamai.steamstatic.com/steam/apps/4920/extras/Inline11_Giblets.jpg?t=1509126512\" ><br><br>Marines wield rifles, shotguns, grenade launchers, pistols, and other weapons. Cluster grenades can clear ventilation shafts of sneaky Skulks, flamethrowers make short work of alien structures and infestation, and boosts dropped by the Commander increase combat effectiveness. <br><br>When attacking on foot doesn't cut it, marines can construct hulking Exosuits wielding miniguns and railguns, and equip jetpacks for high speed assaults on alien Hives.<br><br><img src=\"http://cdn.akamai.steamstatic.com/steam/apps/4920/extras/Inline5_ExoFiring.jpg?t=1509126512\" ><h2 class=\"bb_tag\">Long Term Development</h2><br>Natural Selection 2 receives constant updates. This year, 2016, Unknown Worlds continues to develop new features, content, and improvements.<br><br><img src=\"http://cdn.akamai.steamstatic.com/steam/apps/4920/extras/Inline12_Workshop.jpg?t=1509126512\" ><h2 class=\"bb_tag\">Mod Tools Come Standard</h2><br>Natural Selection 2 comes with all the tools we used to make the game. All game code is open source. That means you can create, and play, an endless variety of mods. Publish, share, and download mods from the Steam Workshop, and automatically download mods when you join modded games.<br><br><img src=\"http://cdn.akamai.steamstatic.com/steam/apps/4920/extras/SpecialArmor_Small.jpg?t=1509126512\" ><h2 class=\"bb_tag\">Digital Deluxe Edition</h2><br>Digital Deluxe Edition includes:<br><br><ul class=\"bb_ul\"><li><strong>Official Soundtrack</strong> - 1 hour of tribal, industrial music composed by David John and Simon Chylinski <br></li><li><strong>Digital Art Book</strong> - 40+ pages of art by Cory Strader, including environments, creatures, weapons and more<br></li><li><strong>Exclusive in-game marine model</strong> - Exclusive in-game marine model - A new marine model with custom visor and armor plating<br></li><li><strong>Exclusive Wallpapers and Avatars</strong> - Unique views of the NS2 universe by Amanda Diaz</li></ul>"}, "2840": {"name": "X: Beyond the Frontier", "appid": "2840", "is_free": false, "publishers": ["Egosoft"], "detailed_description": "The Human Race had advanced to the point where we could travel among the stars, we developed giant automated machines to help us colonise other worlds, but there was a fault in their programming and they turned and attacked. Forcing us to lay a trap to protect Earth and exiling the Human race to stay on Earth once again.<br>\t\t\t\t\t500 Years later Kyle Brennan starts his journey by piloting an experimental ship equipped with a new piece of technology allowing it to cross vast distances on its own. However it malfunctions and traps him in a group of sectors inhabited by Aliens, hunted and with no way home, this is his story of survival... Beyond the Frontier...<br>\t\t\t\t\t<br>X: Beyond The Frontier is the first part in the X-Universe series of games developed by Egosoft.<br><br>\t\t\t\t\tIt tells the story of mankind's rise and fall in the universe, and the attempt by Kyle Brennan to help repopulate the stars using a new ship called the Experimental Shuttle, and how he became trapped in a closed group of sectors linked by a series of jumpgates, owing credits to an alien for helping to save him, and hunted by several people. Unknowingly, a group of secret service people are after him, a group who have tried to hide their races secret, that they are the descendants of a group of Humans who saved earth from the Terraformer fleet they created to help colonise the universe.<br>\t\t\t\t\tNow with the Truth coming out, X: Beyond the Frontier allows the player to play as Kyle Brennan on his hunt to find a way home, whilst helping a group of people find the truth about their ancestry, and continue to help save earth from the Terraformers who are now known as the Xenon.<br>\t\t\t\t\t<h2 class=\"bb_tag\">Features</h2>\t\t\t\t\t<ul class=\"bb_ul\"><li><strong>Trade</strong> - Trade in over 50 sectors, with over 50 different goods, upgrade you ships with dozens of upgrades available to you by 5 different races.<br>\t\t\t\t\t\t </li><li><strong>Fight</strong> - Find the location of the hostile pirates and survive against attacks by the Xenon.<br>\t\t\t\t\t\t </li><li><strong>Build</strong> - Construct stations to build your own production empire.<br>\t\t\t\t\t\t </li><li><strong>Think</strong> - Adapt your trading empire to suit the needs of each sectors local economy.<br>\t\t\t\t\t</li></ul>"}, "3420": {"name": "Iggle Pop Deluxe", "appid": "3420", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": ""}, "1200": {"name": "Red Orchestra: Ostfront 41-45", "appid": "1200", "is_free": false, "publishers": ["Tripwire Interactive"], "detailed_description": "<p>Fight in the theatre of war that changed the world forever. Battle alongside your compatriots on some of the most inhospitable environments of the Eastern Front in <i>Red Orchestra: Ostfront 41-45</i>. Red Orchestra places you in the most realistic WWII first-person multi-player combat to date on the PC, allowing the player to fight through some of the most intense combat of the war. You can play as infantry, using a wide range of infantry weapons, or crew one of the many armored combat vehicles available in the game, from half-tracks to the most famous German and Soviet heavy tanks. Engage the enemy with everything in your arsenal, from your bayonet at close quarters up to the massive 122mm cannon on the Soviet IS-2. And if that isn't enough, find an officer and a radio to call in thunderous artillery strikes to shake the enemy loose.</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Crew 16 fully realized vehicles with highly detailed exterior and interior models </li>\n\t\t\t\t\t<li>Choose from 30 authentic infantry weapons </li>\n\t\t\t\t\t<li>Full 50+ player online Multiplayer Support</li>\n\t\t\t\t\t<li>Unique Setting - the only FPS to focus on the WWII Russian Front</li>\n\t\t\t\t\t<li>Engage enemy tanks at 800 metres and more with the Simulation-level armored vehicle combat</li>\n\t\t\t\t\t<li>Fight the full range of combined arms infantry and vehicle combat in detailed environments based on real-world data, from city-centre to deeply rural settings </li>\n\t\t\t\t\t<li>Realistic bullet and projectile ballistics will make you duck for cover </li>\n\t\t\t\t\t<li>Coordinate strategies with your team-mates via Voice Over IP </li>\n\t\t\t\t\t<li>Authentic Immersive Sound FX and 3d Positional Sound System </li>\n\t\t\t\t\t<li>3D 'Iron Sights' and unique 3D scope system </li>\n\t\t\t\t\t<li>True weapon deployment system including resting rifles on support</li>\n\t\t\t\t\t<li>Historically accurate artillery system </li>\n\t\t\t\t\t<li>Distance-based sound system dynamically creates the battle ambiance</li>\n\t\t\t\t\t<li>Advanced player movement system featuring diving over obstacles and leaning </li>\n\t\t\t\t\t<li>Custom 8 way animation system for highly realistic player animations </li></ul>\n\t\t\t\t\t<p><span class=\"copyHead\">New for Summer '07</span></p>\n\t\t\t\t\t<p>This update includes a new map, a new vehicle and some major graphical enhancements to the game and is available to owners of the game for free through Steam. The new map - Krivoi Rog - gives players the largest tank slugfest to date, with 16 square kilometers of terrain, 3000 meter viewable range and up to 50 players. This map also features the new vehicle - the German Panzer IV G, providing the German players with some additional fire-power for the mid-war period.</p>\n\t\t\t\t\t<p>In addition to the new map and vehicle, an all-new adaptive bloom system has been added for the game's graphics, making the bloom crystal-clear even at low resolutions. For further eye-candy, Anti-Aliasing and Anisotropic Filtering settings are now configurable in-game.</p>\n\t\t\t\t\t<p><span class=\"copyHead\">New for Spring '07</span></p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Ten new maps, the winning entries in Tripwire's Custom Map Competition. Tripwire worked with the developers of each of these maps to ensure the maps are optimized, polished, and gameplay balanced. Highlights in the new map-pack include:</li>\n\t\t\t\t\t<li><b>\"Smolensk Stalemate\":</b> the contest winning map features perfectly balanced to-and-fro infantry combat through ruined villages and trenches in August 1943.<br><b>\"Leningrad\":</b> features close-quarters infantry fighting in the ruined streets of the city, above them in the bombed-out buildings and deep beneath them in the sewers, all with close-in armor support.<br><b>\"Berezina\":</b> the After-Hourz team surpass themselves on this rural/village map, introducing not just a new vehicle (the Russian BT-7 light tank), but also the first functional anti-tank gun in the game. To cap it off, the BT-7 even carries tank-riders.<br><b>\"Black Day July\":</b> one of the very best for tank combat fans, set in the rolling countryside around Prokhorovka as German and Russian armor clash en masse during the Battle of Kursk.</li>\n\t\t\t\t\t<li>Increased player limits. A new level of intensity with 50+ player multiplayer battles (up from the previous limit of 32).</li>\n\t\t\t\t\t<li>New community made content, including the Russian BT-7 light tank with infantry tank riders and the first player controllable anti-tank gun in the game.</li>\n\t\t\t\t\t<li>New soundtrack: The \"Orchestra\" comes to the Ostfront - the game now features a complete in-game soundtrack from composer Matthew Burns.</li>\n\t\t\t\t\t<li>Gameplay enhancements. The addition of several features requested by the clan/ladder/league community to enhance competitive play.</li></ul>"}, "300": {"name": "Day of Defeat: Source", "appid": "300", "is_free": false, "publishers": ["Valve"], "detailed_description": "Day of Defeat offers intense online action gameplay set in Europe during WWII. Assume the role of infantry, sniper or machine-gunner classes, and more. DoD:S features enhanced graphics and sounds design to leverage the power of Source, Valve's new engine technology."}, "3440": {"name": "Rocket Mania Deluxe", "appid": "3440", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": ""}, "3980": {"name": "CivCity: Rome", "appid": "3980", "is_free": false, "publishers": ["2K Games"], "detailed_description": "CivCity: Rome, an innovative city builder inspired by the world of Sid Meiers Civilization, and created by a collaboration between Firefly Studios and Firaxis Games, invites players to shift focus from building a multi-city empire and zoom-in on the great cities of the Roman Empire, culminating in Rome itself! Through dozens of missions, each offering an array of interesting decisions, players will be charged with building, nurturing and managing one of these great cities as they endeavour to lead the Roman Empire from its humble beginnings to its mighty apogee. Features players have enjoyed in the Civilization series, like research, city happiness, production and culture, can now be managed actively in the wonderfully immersive world of CivCity: Rome.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Look inside the buildings - For the first time in a city builder you can look inside the Villas, the forums, and even the Roman baths! Discover, in much greater detail, how Romans went about their daily lives. <br>\t\t\t\t\t</li><li>Civilize your city - More than 70 technologies can be developed over time to give your city a strategic advantage. Use the rich research tree to improve many aspects of your city and its relation to the wider empire.<br>\t\t\t\t\t</li><li>Follow the life of a Roman family - Do they thrive and prosper from humble hut to noble palace as they move through the generations or not? Well, thats your call! <br>\t\t\t\t\t</li><li>Ease of play - Driven purely by building placement and strong visual feedback, the game lets you create your own living community simply by choosing and placing the wide variety of buildings. <br>\t\t\t\t\t</li><li>Real Romans - An intriguing array of characters will interact with you</li></ul>"}, "4770": {"name": "Rome: Total War™ - Alexander", "appid": "4770", "is_free": false, "publishers": ["SEGA"], "detailed_description": "Rome: Total War - Alexander is the second official expansion pack to Rome: Total War.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>An entirely new campaign map that stretches from Macedonia to Greece and into the heart of the ancient Persian Empire<br>\t\t\t\t\t</li><li>New campaign game that tasks players with matching the exploits of Alexander the Great as he swept across Central Asia and dominated the Persian Empire <br>\t\t\t\t\t</li><li>Four new factions including the Macedonians, Persians and Indians<br>\t\t\t\t\t</li><li>Over 25 new units, including Alexander's own renowned historical troops <br>\t\t\t\t\t</li><li>Historical Alexander the Great campaign with six new historical battles that unlock sequentially, telling the story of Alexander and providing a historical backdrop to each of the battles<br>\t\t\t\t\t</li><li>All-new movies to support the Alexander campaign, with professional voiceovers by actor Brian Blessed (Alexander, Star Wars Episode I: The Phantom Menace)</li></ul>"}, "60": {"name": "Ricochet", "appid": "60", "is_free": false, "publishers": ["Valve"], "detailed_description": "A futuristic action game that challenges your agility as well as your aim, Ricochet features one-on-one and team matches played in a variety of futuristic battle arenas."}, "3190": {"name": "King's Bounty Armored Princess Demo", "appid": "3190", "is_free": true, "publishers": ["1C Company", "1C-SoftClub"], "detailed_description": ""}, "2330": {"name": "QUAKE II Mission Pack: The Reckoning", "appid": "2330", "is_free": false, "publishers": ["id Software"], "detailed_description": "<p>You are part of an elite commando force that must infiltrate a hostile alien cite. Once inside, you must scour industrial landscapes, crawl through waterways and air ducts, navigate treacherous canyons teeming with vicious mutants, stow away on an alien spacecraft, and destroy the enemy's secret moon base.</p>"}, "2780": {"name": "ARMA: Combat Operations", "appid": "2780", "is_free": false, "publishers": ["Bohemia Interactive"], "detailed_description": "Sequel to the highly successful Operation Flashpoint, ARMA: Combat Operations is a first person tactical military shooter on the PC with large elements of realism and simulation. This game features a blend of large-scale military conflict spread across large areas alongside the more close quartered battles. You'll be thrust into the midst of an engaging and expanding storyline, fighting against smart, aggressive enemies who will continually provide a challenge over a massive landscape.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li><strong>Story driven single player campaign:</strong> Write your own campaign storyline by choosing the right mission order when playing the 20+ missions. Play it differently next time and find new ways to victory!<br>\t\t\t\t\t</li><li><strong>Large scale multiplayer:</strong> Use ARMA Combat Operations' strong multiplayer mode and play battles where tanks supported by infantry and helicopters take control of an enemy city. The engine supports 50+ live opponents in a role of both friendly and enemy forces.<br>\t\t\t\t\t</li><li><strong>More than 30 weapons:</strong> Every weapon has unique firing characteristics featuring the new and improved recoil system.<br>\t\t\t\t\t</li><li><strong>Vast environment to explore:</strong> Explore Sahrani, an area over 400 square kilometers in size, full of flora and fauna.<br>\t\t\t\t\t</li><li><strong>More than 30 modern vehicles:</strong> All vehicles in the game can be controlled - tanks, armored vehicles, helicopters, airplanes, civilian cars or even boats.<br>\t\t\t\t\t</li><li><strong>Multiple gunners:</strong> Utilize the multiple gunner positions on tanks and helicopters to rain death on your enemies both in multiplayer missions and single player campaign.<br>\t\t\t\t\t</li><li><strong>HDR Lighting effects:</strong> Ambushing an enemy with the sun in your eyes leaves you at the disadvantage. Think smart, fight better!<br>\t\t\t\t\t</li><li><strong>Real constellations and tides:</strong> ARMA's great depth even includes such features as fully simulated star maps, lunar cycles and tides. Watch where you park your vehicle, soldier!<br>\t\t\t\t\t</li><li><strong>Built-in mission editor:</strong> Create you own scenarios using the easy-to-use mission wizard, advanced built-in mission editor, scripting language or BI tools available online and share your creation with the game.</li></ul>"}, "2800": {"name": "X2: The Threat", "appid": "2800", "is_free": false, "publishers": ["Egosoft"], "detailed_description": "X²: The Threat is of a new generation of space simulator games, you play the role of Julian Gardna who continues the story set by X: Beyond The Frontier. The updated graphics engine gives the universe a fresher feel with newly designed ships and stations adding to the complexity of the universe.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Explore: You can explore over 130 beautifully designed sectors occupied by nebulas that affect your ships and stations, asteroids you can mine for materials you can later sell on for profit.<br>\t\t\t\t\t</li><li>New Ships: Explore in over 60 ships of varying sizes from scout class ships to the much larger carrier class battleships.<br>\t\t\t\t\t</li><li>New Upgrades:  Upgrade your ships systems with many more upgrades, and download new upgrades that make use of the new scripting engine designed specially for X².<br>\t\t\t\t\t</li><li>New Weapons: Add new weapons to your ship including the Ion Disruptor and Mass Driver, but also build factories that will develop these weapons and sell them to make a profit, expanding your own empire among the universe.<br>\t\t\t\t\t</li><li>New Missions:  Take part in missions offered to you on each stations bulletin board, make money by defending convoys and destroy incoming Xenon fleets intent on destroying everything in their path.<br>But above all else, help to defend the universe from the Khaak, before they kill everyone and everything they come across.</li></ul>"}, "1530": {"name": "Multiwinia", "appid": "1530", "is_free": false, "publishers": ["Introversion Software"], "detailed_description": "&quot;Long ago a computer scientist called Dr Sepulveda created a beautiful digital world existing entirely within a computer network of his own invention. This world was called Darwinia and it was inhabited by a peaceful, law-abiding digital life-form called the Darwinians.                    <br />\r\n\t\t\t\t\tAs the years wore on however the Darwinians became ever more aggressive and autonomous. They divided into factions, squabbling over Darwinia's limited natural resources. Tribes began to roam the fractal voids hell bent on each others destruction, drunk on power and unswerving in the pursuit of world supremacy.                    <br />\r\n\t\t\t\t\tFar and wide, they became known as the Multiwinians...&quot;                    <br />\r\n\t\t\t\t\tWelcome to Multiwinia: Survival of the Flattest \u0097 the ultimate retro-arcade multiplayer experience! Choose from a selection of six spectacular action-packed game modes, set in one of the most beautiful game environs you will ever set eyes on.                    <br />\r\n\t\t\t\t\tChallenge your opponent to a game of stick-man slaughter, and watch digital-war unfold, as your Multiwinian army struggles to complete a chosen task faster and better than your rival's. It's fast, it's furious, and only the flattest will survive!"}, "3510": {"name": "Amazing Adventures The Lost Tomb™", "appid": "3510", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": "<p>You are an adventure seeker who travels the world in search of forgotten & lost treasures. Search for hidden objects and circumvent unique puzzle traps to recover the most sought after treasures the world has ever known.</p>\n\t\t\t\t\t<p>A newly-discovered fragment of an ancient map is believed to reveal the location of the Lost Tomb of Egypt. Under the direction of the Museum, you must immediately begin your adventure to locate the Lost Tomb and the treasures locked within! Complete over 100 levels by finding hidden objects and circumventing unique puzzle traps. Good luck on your adventure!</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Find over 2000 hidden objects in over 100 levels.</li>\n\t\t\t\t\t<li>Explore 22 unique Egyptian locations.</li>\n\t\t\t\t\t<li>Circumvent 7 unique mini-game puzzle traps to continue your missions.</li>\n\t\t\t\t\t<li>Two game modes: \"Find the Lost Tomb\" and \"Secret Game\" mode.</li>\n\t\t\t\t\t<li>Find the hidden Scarabs to unlock Secret Game mode and a bonus Egyptian location.</li>\n\t\t\t\t\t<li>Strive for the Perfect Search Bonus by not using the 'Hint' button.</li>\n\t\t\t\t\t<li>Play against the clock or in Relaxed Mode with no time limits.</li>\n\t\t\t\t\t<li>Unlock interesting facts about Egypt in your journal.</li></ul>"}, "320": {"name": "Half-Life 2: Deathmatch", "appid": "320", "is_free": false, "publishers": ["Valve"], "detailed_description": "Fast multiplayer action set in the Half-Life 2 universe! HL2's physics adds a new dimension to deathmatch play. Play straight deathmatch or try Combine vs. Resistance teamplay. Toss a toilet at your friend today!"}, "4000": {"name": "Garry's Mod", "appid": "4000", "is_free": false, "publishers": ["Valve"], "detailed_description": "Garry's Mod is a physics sandbox. There aren't any predefined aims or goals. We give you the tools and leave you to play.<br><br>You spawn objects and weld them together to create your own contraptions - whether that's a car, a rocket, a catapult or something that doesn't have a name yet - that's up to you. You can do it offline, or join the thousands of players who play online each day. <br><br>If you're not too great at construction - don't worry! You can place a variety of characters in silly positions. But if you want to do more, we have the means.<h2 class=\"bb_tag\">Beyond the Sandbox</h2><br>The Garry's Mod community is a tremendous source of content and has added hundreds of unique modes to the game. In Trouble In Terrorist Town, you can be a detective solving an online murder as criminals attempt to cover up their homicides. Be a ball, a plant, a chair, or anything else in Prop Hunt's elaborate, shape-shifting game of Hide &amp; Seek. Elevator: Source is gaming's first elevator thrill ride, delivering players to airlocks and kitten dance parties. <br><br>We have one of the most vibrant Steam Community Workshops, with over 300'000 models, maps, and contraptions to download. It has everything from new tools to improve your builds, to guns that fire rainbow-tinged nuclear blasts from space. Take as much or as little as you need: it’s all free. <br><br><strong>Please note: Some multiplayer servers and game-modes might require you to own other games - such as Counter-Strike: Source and Team Fortress 2.</strong>"}, "4400": {"name": "City Life", "appid": "4400", "is_free": false, "publishers": ["Monte Cristo"], "detailed_description": "<p>Construct the City of the 21st Century with City Life!</p>\n\t\t\t\t\t<p>From superb villas in residential neighborhoods to imposing skyscrapers in the financial district, design, construct and develop the city of your dreams. Provide comfort and satisfaction for your citizens by offering them adequate leisure and entertainment facilities, all the while ensuring that taxes and other charges are collected efficiently. It's up to you to manage this city effectively, ensuring booming development while at the same time regulating the very delicate issues of pollution and traffic. You must also see that diverse communities share the city in the best way possible to guarantee a peaceful and prosperous city.</p>\n\t\t\t\t\t<p>City Life is a next-generation city simulation that allows you to build and manage a living metropolis in gorgeous real-time 3D. The 3D game engine provides a level of detail and animation unprecedented in the city builder genre. Among the game's superior features are highly realistic environments, reflection mapping, a tree engine, dynamic shadowing, and an immersion mode (giving players the first-person point of view as they advance through cities). City Life is a unique game experience and an exciting new challenge for the many fans of city builders and simulations.</p>"}, "2550": {"name": "RIP - Trilogy™", "appid": "2550", "is_free": false, "publishers": [""], "detailed_description": "With the completion of the third title in the RIP series, the RIP games have become an instant classic in the arcade-shooter genre. RIP \u0097 Trilogy brings all three RIP titles into one exciting and heart-pounding pack.<br>RIP<br><br>Not afraid of Death? What if he is accompanied by Halloween and Rock-N-Roll? Play the part of these antiheroes and go to war in this all-out action experience! Each character has their own strengths and skills, but this is not a game for the faint of heart. With over 40 levels to RIP through, the results are murderous!<br><ul class=\"bb_ul\"><li>40 levels of murder and mayhem<br></li><li>A variety of guns and battle magic<br></li><li>Three chilling characters<br></li><li>A toned-down, less violent kid's mode</li></ul>RIP2 \u0097 Strike Back<br><br>Your favorite antiheroes are here to strike back with another score to settle. Death, Halloween and Rock-N-Roll...each character has his own strengths and skills, so pick one and start shooting. In Story Mode, you'll fight through 60 furious levels using an arsenal of upgradeable weapons, tanks, helicopters and turrets or for a quick adrenaline fix, play Rush Mode and see how long you can last.<br><ul class=\"bb_ul\"><li>Choose from a large arsenal of weapons<br></li><li>Assorted vehicles including gun turrets, tanks and helicopters<br></li><li>Variety of abilities and power-ups<br></li><li>60 levels of unlimited gameplay<br></li><li>Huge boss levels for more challenge<br></li><li>Two modes of play; Rush Mode or Story Mode</li></ul>RIP3 \u0097 The Last Hero<br><br>RIP3 \u0097 The Last Hero combines the dynamics of a hardcore shooter while preserving the elusive classic arcade appeal and never lets up on the intense action. Every level presents a new challenge, requiring you to not only prove your sharp-shooting, but to think and act tactically.<br>The terrain and environments must be employed to survive waves of adversaries, but since all in-game objects are destructible, you must think fast. Your hero will travel all over the world from the African jungle to the Arctic snow, through secret labs and bunkers, in the streets and skyscrapers of Metropolis city and also go into deep space using a hijacked spaceship.<br><ul class=\"bb_ul\"><li>100 levels of arcade shooting action<br></li><li>6 unique playable characters with varied and powerful skills to develop<br></li><li>A huge arsenal of destructive weaponry, each with 2 shooting modes<br></li><li>Capture and control military vehicles, including Tanks, Helicopters and Battle Turrets<br></li><li>Fully destructible battlefield - all the objects can be damaged and destroyed<br></li><li>Includes a space adventure minigame, where you pilot the Vostok-23 starship<br></li><li>12 Huge, challenging bosses evoke classic arcade gameplay<br></li><li>3 difficulty level settings to increase the intensity<br></li><li>Special bonuses and secrets are scattered throughout the game<br></li><li>Cooperative multiplayer for two players to battle against the enemy hordes<br></li><li>Multiplayer death-match for up to 6 players over LAN</li></ul>"}, "3700": {"name": "Sniper Elite", "appid": "3700", "is_free": false, "publishers": ["Rebellion"], "detailed_description": "As World War II draws to a close, the first covert battles of the Cold War begin. Caught in the life and death struggle between Soviets and Germans in war-torn Berlin, you control the fate of a lone American OSS Sniper. Disguised as a German and working deep behind enemy lines you must stop Stalin's forces from gaining control of Germany's nuclear secrets. Prepare to alter the course of history.<br><br><br>Authentic World War II sniper simulation featuring realistic weapons, bullet ballistics and sniping skills<br><br><ul class=\"bb_ul\"><li>Massive single player game with 28 heart-pounding missions<br></li><li>Intense 8-player LAN sniper battles including Deathmatch, Team Deathmatch and Assassination game modes<br></li><li>3rd person view for close quarter action and movement - 1st view person for sniping<br></li><li>Options to take account of gravity, wind, posture, heart-rate and breathing to execute the perfect shot<br></li><li>Multi-angle 'Bullet Cam' for kill confirmation<br></li><li>Non linear game play provides unique action each time a mission is played</li></ul>"}, "2450": {"name": "Bloody Good Time", "appid": "2450", "is_free": false, "publishers": ["Ubisoft"], "detailed_description": "<p>Congratulations, you’ve just been cast in your first slasher movie!  You’ve been given your big break by the notorious Director X. His methods have produced some of the finest grindhouse films ever committed to celluloid. Famous faces and big names are not what this director is looking for. Fresh faces are all Director X casts, and with your embarrassingly empty resume you’re as fresh as they come!</p>\n\t\t\t\t\t<p>But seven other hopefuls are also in the running, so you’re going to need to prove your worth if you’re to hit the leading credits. You’re going to have to scratch, claw and strike to slash your way to the top. This job’s going to be murder!</p>\n\t\t\t\t\t<p>Developed by Outerlight, Bloody Good Time takes a new and irreverent approach to multiplayer shooters. The game runs on the Valve’s Source engine, known for classic multiplayer shooters such as Half-Life and Team Fortress.</p>\n\t\t\t\t\t<h2>Key Features:</h2>\n\t\t\t\t\t<ul>\n\t\t\t\t\t\t  <li><strong>Be a deceitful bastard!</strong> Flush your enemies in the toilet, crash their heads on their plates when they eat, do whatever it takes to maim and <strong>kill other competitors in nasty and unexpected ways!</strong>\n\t\t\t\t\t\t  <li>Use a <strong>full arsenal of wacky weapons</strong> including guns, a baseball bat, a frying pan, and even an exploding remote-controlled rat to <strong>transform the movie set into real mayhem!</strong>\n\t\t\t\t\t\t  <li>Clash with up to 8 players online in a zany, first-person shooter, <strong>multiplayer experience like no other</strong>. \n\t\t\t\t\t\t  <li>Choose from a variety of <strong>stereotypical B- movie characters</strong>, including the bikini beach babe, the stoner, the creepy clown and the super jock.\n\t\t\t\t\t\t  <li>From Spring Break Beach to the Horror House to the Vegas Hotel, discover <strong>what’s behind the Hollywood set in these unique multiplayer maps</strong>.\n\t\t\t\t\t\t  <li><strong>Developed by Outerlight</strong>, best known for their work on The Ship and the Half-Life mod of the Ship. This Scottish-based developer brings a great combination of humor and quality game play to Bloody Good Time.\n\t\t\t\t\t\t  <li>Running on the <strong>Valve’s Source engine</strong>, Bloody Good Time comes from the same pedigree of classic, online multiplayer shooters such as Half-Life, Team Fortress and Counter-Strike.\n\t\t\t\t\t</ul>"}, "3570": {"name": "Mystery P.I.™ - The New York Fortune", "appid": "3570", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": "<p>A fun loving & eccentric New York billionaire has hidden the will to his vast fortune somewhere in New York City!  His family only has 17 hours to locate the will or their Grandpa's entire estate will be given to his cat & dog.</p>                    \n\t\t\t\t\t<p>You are the world famous Mystery P.I. and the family has hired you to track down the clues hidden all over NYC.  Seek & Find over 2100 hidden objects in 25 amazing NY locations like Times Square, Central Park, Coney Island, the Brooklyn Bridge and many more. If you succeed you will be awarded $25 Million dollars.</p>                    \n\t\t\t\t\t<p>Three addictive ways to play: In NY Fortune mode you must find the clues to locate the will.  Collect all the Keys & Apples to unlock two Unlimited game modes: Unlock Unlimited Seek & Find and Spot the Differences to find every hidden item in every scene.</p>                    \n\t\t\t\t\t<ul>                    \n\t\t\t\t\t<li>Find over 2100 cleverly hidden objects.</li>                    \n\t\t\t\t\t<li>Investigate 25 amazing New York locations to find the clues.</li>                    \n\t\t\t\t\t<li>Three fun game modes: 'Find the NY Fortune' and two Unlimited game modes</li>                    \n\t\t\t\t\t<li>Play 5 unique mini-games: Match-3, Word Search, Circle Rotation, Tile Swap, Jigsaw plus a unique final puzzle.</li>                    \n\t\t\t\t\t<li>Locate the secret Keys and Apples to unlock two Unlimited game modes.</li>                    \n\t\t\t\t\t<li>Go for a Perfect Investigation & speed bonuses to become a Master PI.</li>                    </ul>"}, "3810": {"name": "BloodRayne", "appid": "3810", "is_free": false, "publishers": ["Majesco"], "detailed_description": "In the years between the World Wars, Agent BloodRayne works as a killing machine for The Brimstone Society--a top secret fraternity that hunts down and destroys supernatural threats. Two missions, five years apart, turn out to be connected by one man.  For years, this man has been searching the world for powerful occult relics to bring Germany into a new age of domination. Rayne must face his elite Nazi army and prevent them from releasing horrific creatures in their quest for the artifacts.  Starring the super-sexy, super-lethal, supernatural heroine BloodRayne, this original action horror game unleashed the red headed dhampir on the world."}, "930": {"name": "Half-Life 2: Episode Two Trailer 2", "appid": "930", "is_free": false, "publishers": ["Valve"], "detailed_description": ""}, "4100": {"name": "Poker Superstars II", "appid": "4100", "is_free": false, "publishers": ["Funkitron"], "detailed_description": "<p>You've been invited back for Season 2! Poker Superstars II raises the stakes with more superstars, a bigger tournament and a brand new poker AI. Import your own photo into the game and become a Poker Superstar. Then get ready to battle through an exciting new tournament structure against 15 of poker's top players powered by a 'first of its kind' artificial intelligence system that has learned to win by playing millions of simulated tournaments! The Superstars are ready to win, are you?</p><span class=\"copyHead\">It contains these great features:</span>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li><span class=\"copyHead\">Tougher Challenge!</span> First of its kind artificial intelligence system that has taught itself how to play, and how to win.</li>\n\t\t\t\t\t<li><span class=\"copyHead\">Bigger Tournament!</span> You get to play the dynamic and competitive tournament right from the TV show.</li>\n\t\t\t\t\t<li><span class=\"copyHead\">More Superstars!</span> This time, you are one of 16 Poker Superstars.</li>\n\t\t\t\t\t<li><span class=\"copyHead\">Import Your Photo!</span> Be the Poker Superstar you know you are and see yourself right in the game!</li>\n\t\t\t\t\t<li><span class=\"copyHead\">Interactive Opponent Pictures!</span> Now you get to see the Superstars smile devilishly when they beat you, as well as scowl when you beat them!</li>\n\t\t\t\t\t<li><span class=\"copyHead\">Learn or Master!</span> Game Tips will introduce you to the game while the Game Tip button can help you hone your game.</li>\n\t\t\t\t\t<li><span class=\"copyHead\">Amateur or Superstars!</span> Two different levels of challenge let you tune the game to the play level you want.</li>\n\t\t\t\t\t<li><span class=\"copyHead\">Player Cards!</span> The game will track all your winnings, flops seen %, pots won % and best hands.  So you'll be able to see what kind of player you are.</li>\n\t\t\t\t\t<li><span class=\"copyHead\">3 Exciting Game Modes!</span> Round lets you play a quick round. Season challenges you to win the full tournament. Limit lets you play the set bet amount game found frequently in casinos and online.</li>\n\t\t\t\t\t<li><span class=\"copyHead\">Top Ten Lists!</span> Track your top winnings, top pots and top hands.</li></ul>"}, "3970": {"name": "Prey", "appid": "3970", "is_free": false, "publishers": ["2K Games"], "detailed_description": "<P>Our sale on Prey was so popular we ran out of keys!! If we can get more, we'll put it back up for sale.  </P>\n\n<P>\n<p>Prey tells the story of Tommy, a Cherokee garage mechanic stuck on a reservation going nowhere. His life changes when an otherworldly crisis forces him to awaken spiritual powers from his long-forgotten birthright. Abducted along with his people to a menacing alien mothership orbiting Earth, he sets out to save himself, his girlfriend and eventually his planet. In Prey, gamers enter an unpredictable world where nothing can be taken for granted.</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Built on an enhanced Doom 3 engine, the most impressive 3D engine used in a released game.</li>\n\t\t\t\t\t<li>Portal technology adds a new dimension to gameplay, allowing enemies to appear out of thin air and create new and completely original puzzles and gameplay styles.</li>\n\t\t\t\t\t<li>Several never-before-seen gameplay elements such as Spirit Walking, Wall Walking, and Deathwalk.</li>\n\t\t\t\t\t<li>Highly organic, living environment that itself can attack Tommy.</li>\n\t\t\t\t\t<li>A deep, emotional story of love and sacrifice.</li>\n\t\t\t\t\t<li>Tommy has a sidekick, a spiritual hawk that can help him fight enemies and decipher the alien language of the living ship.</li>\n\t\t\t\t\t<li>Multiplayer game support that takes advantage of the unique gameplay styles in Prey. </li></ul>"}, "570": {"name": "Dota 2", "appid": "570", "is_free": true, "publishers": ["Valve"], "detailed_description": "<h1>The International Dota 2 Championships</h1><p><a href=\"https://steamcommunity.com/linkfilter/?url=http://www.dota2.com/international/live/\" target=\"_blank\" rel=\"noopener\"  ><img src=\"http://cdn.edgecast.steamstatic.com/steam/apps/570/extras/ti7_page_banner_updated.jpg?t=1509667634\" ></a></p><br><h1>About the Game</h1><strong>The most-played game on Steam.</strong><br>Every day, millions of players worldwide enter battle as one of over a hundred Dota heroes. And no matter if it's their 10th hour of play or 1,000th, there's always something new to discover. With regular updates that ensure a constant evolution of gameplay, features, and heroes, Dota 2 has truly taken on a life of its own.<br><br><strong>One Battlefield. Infinite Possibilities.</strong><br>When it comes to diversity of heroes, abilities, and powerful items, Dota boasts an endless array—no two games are the same. Any hero can fill multiple roles, and there's an abundance of items to help meet the needs of each game. Dota doesn't provide limitations on how to play, it empowers you to express your own style.<br><br><strong>All heroes are free.</strong><br>Competitive balance is Dota's crown jewel, and to ensure everyone is playing on an even field, the core content of the game—like the vast pool of heroes—is available to all players. Fans can collect cosmetics for heroes and fun add-ons for the world they inhabit, but everything you need to play is already included before you join your first match.<br><br><strong>Bring your friends and party up.</strong><br>Dota is deep, and constantly evolving, but it's never too late to join. <br>Learn the ropes playing co-op vs. bots. Sharpen your skills in the hero demo mode. Jump into the behavior- and skill-based matchmaking system that ensures you'll <br>be matched with the right players each game."}, "3560": {"name": "Bejeweled Twist", "appid": "3560", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": "<p>Spin, match, explode... WOW! It's a brilliant new way to play Bejeweled! Get set for a vivid sensory rush as you spin and match explosive gems for shockwaves of fun. Rotate jewels freely to set up electrifying combos, outwit surprising obstacles like Locks and Bombs, and create high-voltage Flame and Lightning gems. When you need to dial up the intensity or fine-tune your skills, turn to Challenge mode or five-minute Blitz. And if relaxing is more your style, kick up your feet with stress-free Zen. No matter the mode, you'll discover new strategies, improve your moves, and find endless ways to win!</p>                    \n\t\t\t\t\t<ul>                    \n\t\t\t\t\t<li>Use the revolutionary Gem Rotator to move gems around and make matches anywhere on the board</li>                     \n\t\t\t\t\t<li>Relax, rev up, refocus or recharge in four game modes &#151; Classic, Zen, Challenge and Blitz</li>                    \n\t\t\t\t\t<li>Clear away Locks and Bombs for magnificent bonuses</li>                    \n\t\t\t\t\t<li>Create Flame and Lightning power gems, then blast them to smithereens just because you can</li>                    \n\t\t\t\t\t<li>Relive your best moves with Instant Replay and see where you rank on the high-score list</li>                    \n\t\t\t\t\t<li>Start playing quickly and easily with in-game tips</li>                    \n\t\t\t\t\t<li>Enjoy eye-popping graphics and special effects... you've never seen Bejeweled like this before!</li>                    </ul>                    "}, "2590": {"name": "Alpha Prime", "appid": "2590", "is_free": false, "publishers": ["Bohemia Interactive"], "detailed_description": "Somewhere in deep space, at an apparently abandoned mining base on the asteriod Alpha Prime, something has gone terribly wrong. Miners were warned that the hubbardium they were mining was too dangerous, but the lure of unimaginable wealth was too strong. Now, something has happened to them and it's up to you to save them and face an unknown threat.<br>\t\t\t\t\tEquipped with a surplus of advanced weapons and devices--including a variety of robots and manipulators, surveillance cameras and security systems that can be hacked, controlled and used to complete your task--your mission is simple: Get in, get 'em, and get out!<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>10 levels of fast-paced, unrelenting action including mining station, spaceship hangar, magnetic railway or asteroid surface<br>\t\t\t\t\t</li><li>Non-playable characters aid you in your mission to save the miners and get off the asteroid<br>\t\t\t\t\t</li><li>Countless enemies including Special Forces soldiers, robots and deranged miners<br>\t\t\t\t\t</li><li>8 futuristic weapons including pistols, shotguns, machine guns, grenades…<br>\t\t\t\t\t</li><li>Vehicles can be used to move to different locations quickly<br>\t\t\t\t\t</li><li>Hack into devices including robots, surveillance cameras, security systems, doors, etc.<br>\t\t\t\t\t</li><li>Bullet time allows players to temporarily slow down the action and get the upper hand<br>\t\t\t\t\t</li><li>Compatible with Matrox TripleHead2Go™, enabling gamers to connect 3 screens</li></ul>"}, "3340": {"name": "AstroPop Deluxe", "appid": "3340", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": ""}, "80": {"name": "Counter-Strike: Condition Zero", "appid": "80", "is_free": false, "publishers": ["Valve"], "detailed_description": "With its extensive Tour of Duty campaign, a near-limitless number of skirmish modes, updates and new content for Counter-Strike's award-winning multiplayer game play, plus over 12 bonus single player missions, Counter-Strike: Condition Zero is a tremendous offering of single and multiplayer content."}, "940": {"name": "Dark Messiah Launch Trailer", "appid": "940", "is_free": false, "publishers": ["Ubisoft"], "detailed_description": ""}, "3490": {"name": "Venice Deluxe", "appid": "3490", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": "<p>Venice is sinking and only you can save it! From the floating fortress of your golden gondola, you'll restore the city by returning its lost treasures. Sling costly coins, launch lovely lyres and ricochet ruby rings into the corresponding spaces overhead. Use your arsenal of special shots to create cascading combos and earn bonus points along the way. But beware &#151; shelves, chutes, swirlies and other traps will make things tricky, so you'll need power-ups like Wild Shot and Wings to help you sail through the levels. So grab your gondola and get ready &#151; with a majestic soundtrack, gloriously ornate artwork and four enduring game modes, Venice is a classic test of wits, will and skill!</p>\n<ul>\n<li>Dive into 4 game modes: Journey, Flood, Survival and Trick Shots</li>\n<li>Save 72 buildings over 8 neighborhoods</li>\n<li>Wield astonishing power-ups like Wild Shot and Wings</li>\n<li>Overcome obstacles like tricky chutes, sinister swirlies and more</li>\n<li>Revel in ornate art, mellifluous music and spectacular effects</li>\n<li>Earn bonus points and power-ups with terrific tumbles and cascading combos</li>\n<li>Save your high scores for pride and posterity!</li>\n</ul>"}, "3400": {"name": "Hammer Heads Deluxe", "appid": "3400", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": ""}, "3710": {"name": "Judge Dredd: Dredd vs. Death", "appid": "3710", "is_free": false, "publishers": ["Rebellion"], "detailed_description": "Welcome to Mega-City One, a city of over 400 million people - every one of them a potential criminal. It is the third decade of the 22nd Century, unemployment is widespread, boredom is universal and only the Judges can prevent total anarchy. Empowered to dispense instant justice, they are Judge, Jury and Executioner all in one. The most feared and respected of all the Judges is you, Judge Dredd.<br>Patrol the streets and mete out instant justice wherever it is needed. The Psi-Judges are predicting a terrible plague \u0097 is this the sudden outbreak of Vampires on the city, and are they the work of the malevolent Dark Judges?<br><ul class=\"bb_ul\"><li>JUDGE, JURY and EXECUTIONER it's your choice to shoot to kill, or disarm and arrest<br></li><li>Two-player co-operative LAN play throughout the entirety of the immersive storyline<br></li><li>Intense LAN action for up to 32 players<br></li><li>Customizable multiplayer games with enemy bots<br></li><li>Choose from over 60 characters for insane mayhem!</li></ul>"}, "3260": {"name": "Safecracker: The Ultimate Puzzle Adventure", "appid": "3260", "is_free": false, "publishers": ["THQ Nordic"], "detailed_description": "As an expert safecracker, you are hired by the wealthy family of a recently deceased to search his mansion for his last will and testament. Duncan W. Adams was an avid safe collector and an 'eccentric,' to say the least. Adams has hidden the deed to his vast fortunes in one of 35 safes. You must crack them all using hints scattered throughout his extravagant mansion. The stakes are high. Use your expertise, wits, and puzzle solving skills to earn your paycheck!<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>A challenging puzzle adventure game with 35 unique safes to crack.<br>\t\t\t\t\t</li><li>Many creative, clever, and truly unique puzzles.<br>\t\t\t\t\t</li><li>Decipher unexpected clues inside each safe that will help you open the others, ultimately leading you to the master safe.<br>\t\t\t\t\t</li><li>Multiple difficulty levels to challenge all types of puzzle enthusiasts.<br>\t\t\t\t\t</li><li>Explore a magnificent mansion with 30 lavish, intriguing, and precisely-detailed rooms.</li></ul>"}, "4910": {"name": "Zen of Sudoku Demo", "appid": "4910", "is_free": true, "publishers": [""], "detailed_description": ""}, "2990": {"name": "FlatOut 2™", "appid": "2990", "is_free": false, "publishers": ["Strategy First"], "detailed_description": "<p><strong>DRIVING THIS RECKLESS IS NO ACCIDENT!</strong></p>\n\t\t\t\t\t<p>But you might want to cause a few.  In these high-speed races, the more damage you inflict, the better. The ultimate in turbo-charged cars and the craziest competitor drivers are waiting to test your best destructive streak. Responsible drivers need not apply.</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Thousands and thousands of objects to annihilate.</li>\n\t\t\t\t\t<li>Mini games gone wild - hurl the driver in these 12 crazy challenges.</li>\n\t\t\t\t\t<li>Wreck your way across parched deserts, massive storm drains and narrow city streets.</li>\n\t\t\t\t\t<li>Ram your opponents' car and watch them fly through the air - you're here to win!</li></ul>\n\t\t\t\t\t<p><span class=\"legal\"><br>FlatOut 2 &copy; 2006 Empire Interactive Europe Ltd. Game concept and development by Bugbear Entertainment Ltd. Empire, FlatOut and \"E\" are either trademarks or registered trademarks of Empire Interactive Europe Ltd. in the UK/Europe and/or other countries. All rights reserved. NVIDIA, the NVIDIA Logo, GeForce and \"The Way It's Meant to be Played\" Logo are registered trademarks and/or trademarks of NVIDIA Corporation in the United States and other countries. GameSpy and the \"Powered by GameSpy\" design are trademarks of GameSpy Industries, Inc. All rights reserved. a product of the e.u.</span></p>"}, "3460": {"name": "Talismania Deluxe", "appid": "3460", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": ""}, "900": {"name": "Zombie Movie", "appid": "900", "is_free": false, "publishers": [""], "detailed_description": "New Zealand... 1986. The zombie apocalypse is here and three mates are stranded. The trusty Holden is out of gas. With only fast food scraps and a few cigarettes for sustenance, surviving each other may prove harder than facing the undead outside..."}, "3480": {"name": "Peggle Deluxe", "appid": "3480", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": "<p>Take your best shot with energizing arcade fun! Aim, shoot, clear the orange pegs, then sit back and cheer as 10 whimsical teachers guide you to Peggle greatness. Conquer 55 fanciful levels with 10 mystical Magic Powers, racking up bonus points and shots you'll smile about for weeks. Face off against your friends in Duel Mode, or tackle 75 extra-tricky challenges. It's luck and skill and joyous thrills, and amidst all this fevered action only one question remains: Can you become a Peggle Master?</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Wield 10 miraculous Magic Powers!</li>\n\t\t\t\t\t<li>Master 55 levels of bouncy delight!</li>\n\t\t\t\t\t<li>Conquer 75 Master challenges!</li>\n\t\t\t\t\t<li>Play friends or the computer in Duel Mode!</li>\n\t\t\t\t\t<li>Revel in breathtaking artwork and music!</li>\n\t\t\t\t\t<li>Replay and save your best shots!</li>\n\t\t\t\t\t</ul>"}, "3210": {"name": "Painkiller Demo", "appid": "3210", "is_free": true, "publishers": ["Nordic Games"], "detailed_description": ""}, "2850": {"name": "X: Tension", "appid": "2850", "is_free": false, "publishers": ["Egosoft"], "detailed_description": "X-Tension is the eagerly awaited expansion pack to X: Beyond the Frontier. The expansion is not limited by a linear plot line but makes use of new ways to expand your empire. You can now take part in missions that are offered to you throughout the game.<br>\t\t\t\t\t<h2 class=\"bb_tag\">Features</h2>\t\t\t\t\t<ul class=\"bb_ul\"><li><strong>More Ships</strong> - You are no longer limited to one ship, but can now buy and pilot all fighters and small transports in the game. As well as capturing new Pirate ships.<br>\t\t\t\t\t\t </li><li><strong>Expanded Universe</strong> - The universe has also been expanded with over 40 new sectors to visit, trade and fight inside, allowing you to find new locations to build new stations and trade in new goods.<br>\t\t\t\t\t\t </li><li><strong>The Version 2 Update</strong> - The release of the 2.0 upgrade expanded the game even further allowing you to pilot the larger TL class freighter.<br>\t\t\t\t\t</li></ul>Continue your quest to explore the universe, trade in over 90 sectors, with over 50 goods, upgrade your ship with dozens of wares available to you by 5 unique alien races and protect yourself from the hostile Xenon."}, "4710": {"name": "Medieval II: Total War™ Demo", "appid": "4710", "is_free": true, "publishers": ["SEGA"], "detailed_description": "<p>Take command of your army and expand your reign in Medieval II - the fourth installment of the award-winning Total War series of strategy games. Direct massive battles featuring up to 10,000 bloodthirsty troops on epic 3D battlefields, while presiding over some of the greatest Medieval nations of the Western and Middle Eastern world. Spanning the most turbulent era in Western history, your quest for territory and power takes you through Europe, Africa, and the Middle East, and even onto the shores of the New World.</p>\n\t\t\t\t\t<p>You'll manage your empire with an iron fist, handling everything from building and improving cities to recruiting and training armies. Wield diplomacy to manipulate allies and enemies, outsmart the dreaded Inquisition, and influence the Pope. Lead the fight in the Crusades and bring victory to Islam or Christianity in the Holy War. Rewrite history and conquer the world. This is Total War!</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Bigger and better real-time battles. Improved combat choreography, larger armies, quicker pace, and spectacular finishing moves make this the most visceral and exciting Total War ever.</li>\n\t\t\t\t\t<li>New epic campaign. The ambitious single player campaign will span three continents and let players sail across to the Americas to confront the Aztecs on their home soil.</li>\n\t\t\t\t\t<li>Greater accessibility. An enhanced user interface and optional shorter campaigns make the Total War experience faster and easier to enjoy than ever before.</li>\n\t\t\t\t\t<li>Over 40 new features. An advanced terrain system, enhanced weather effects, and more will help you divide and conquer.</li>\n\t\t\t\t\t<li>Intense Multiplayer Battles. Wage war against other players in 8-way multiplayer games across the Internet and LAN.</li></ul>"}, "2820": {"name": "X3: Terran Conflict", "appid": "2820", "is_free": false, "publishers": ["Egosoft"], "detailed_description": "It is the year 2938. The long wished-for encounter of the X Universe and the Earth holds both joy and sorrow for the people. Despite flourishing trade, the clash of the diverse races, cultures and life forms creates new tensions, mistrust and open conflict that need to be overcome!<br>\t\t\t\t\tExperience the brilliant climax of the legendary X-Trilogy , and take your place in the history of the X Universe.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Largest X Universe ever.<br>\t\t\t\t\t</li><li>New faction: the Terrans – inhabitants of the Earth.<br>\t\t\t\t\t</li><li>More jobs and non-linear missions than ever before.<br>\t\t\t\t\t</li><li>More than 100 new spaceships, new ship classes and weapon systems.<br>\t\t\t\t\t</li><li>Re-designed user interface for comfortable control by mouse, keyboard and joystick.<br>\t\t\t\t\t</li><li>New group management tool.<br>\t\t\t\t\t</li><li>Large battleships can be boarded by an outside team.</li></ul>"}, "2600": {"name": "Vampire: The Masquerade - Bloodlines", "appid": "2600", "is_free": false, "publishers": ["Activision"], "detailed_description": "Vampire®: The Masquerade-Bloodlines™ delivers a new type of RPG experience-one that blends all the core elements of a traditional RPG with the graphical richness, immediacy and brutal combat of a first-person action game. The game plunges players into the dark and gritty vampire underworld of modern-day L.A. as a creature of the night. Players will develop their character's powers, interact with other characters and embark on story-driven quests as they battle mortals and other vampires with an incredible array of vampire powers and weapons. Powered by Valve's Source Technology, the game is based on White Wolf's popular Vampire: The Masquerade pen-and-paper RPG series and its official clans."}, "92": {"name": "Codename Gordon", "appid": "92", "is_free": false, "publishers": ["Valve"], "detailed_description": "Created by Nuclearvision Entertainment, Codename Gordon takes players through dozens of levels inspired by Half-Life and Half-Life 2, challenges players to a slew of puzzles, and showcases many of the familiar creatures in an all new, 2 dimensional playing field."}, "3350": {"name": "Bejeweled Deluxe", "appid": "3350", "is_free": false, "publishers": ["PopCap Games, Inc."], "detailed_description": ""}, "4300": {"name": "RoboBlitz", "appid": "4300", "is_free": false, "publishers": ["Naked Sky Entertainment"], "detailed_description": "<p>RoboBlitz&trade; is a humorous, physics-based action game full of inventive gizmos, weapons, characters, and environments. Players take on the role of Blitz, a multi-talented robot who must activate an aging Space Cannon to save his world from a band of maladjusted space pirates.</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>19 levels of puzzle-solving and high-intensity action, set in 7 unique environments</li>\n\t\t\t\t\t<li>Humorous characters and unique weapons</li>\n\t\t\t\t\t<li>Gameplay entirely driven by physics</li>\n\t\t\t\t\t<li>Advanced robot simulation and control theory</li>\n\t\t\t\t\t<li>Powered by Unreal&reg; Engine 3</li></ul>"}, "2950": {"name": "Jagged Alliance 2: Unfinished Business", "appid": "2950", "is_free": false, "publishers": [""], "detailed_description": ""}, "3800": {"name": "Advent Rising", "appid": "3800", "is_free": false, "publishers": ["Majesco"], "detailed_description": "A common legend pervades the galaxy-that of a powerful, highly intelligent ancient race that will one day deliver the universe.  They are known as Humans.<br />\n\t\t\t\t\tSome claim they are the messiah. Others believe they exist only in the imaginations of the young. The Seekers, however, know Humans exist and believe they are an enemy that must be destroyed. Under the guise of benevolent explorers, Seekers comb the universe and eradicate any Human colonies they find. Until now.<br />\n\t\t\t\t\tWorking with award-winning science fiction author Orson Scott Card, GlyphX Games has created a gripping storyline that will thrust gamers into an incredible intergalactic saga.<br />\n\t\t\t\t\tThe Advent of Humanity Begins..."}, "1230": {"name": "Mare Nostrum", "appid": "1230", "is_free": true, "publishers": ["Tripwire Interactive"], "detailed_description": "Experience some of the fiercest battles of WWII across North Africa with Mare Nostrum. Building on the realistic, tactical game play that made Red Orchestra: Ostfront 41-45 a fan favourite, Mare Nostrum lets players battle it out in an all new setting.<br>                    Featuring British, Australian, German and Italian nations, choose from a range of authentic weaponry or crew one of 10 fully realised vehicles. With 8 different battle environments the game play is varied from gritty street to street fighting in urban surroundings to all out tank warfare in the open desert. This is North Africa, but not like you have seen it before.<br>                    <ul class=\"bb_ul\"><li>All new theatre of war \u0097 North Africa in the Mediterranean theatre brings an exciting new setting to Red Orchestra<br>                    </li><li>3 new nationalities featuring all new characters and voices including British, Australian, and Italian solders<br>                    </li><li>6 all new vehicles featuring British and early war German armour<br>                    </li><li>Man 4 new Anti-Tank cannons to knock out approaching armour<br>                    </li><li>Choose from 8 brand new authentic infantry weapons<br>                    </li><li>8 battle locations ranging from wide open deserts to urban settings<br>                    </li></ul>"}, "3270": {"name": "Painkiller Overdose", "appid": "3270", "is_free": false, "publishers": ["THQ Nordic"], "detailed_description": "The critically-acclaimed and award-winning FPS franchise is back! Packed with tons of fast-paced, adrenaline-fueled single player and multiplayer action, Painkiller Overdose brings with it 6 innovative new demonic weapons, mind-bending physics, lightning-player maps, over 40 demented and sickly-twisted monsters from Hell and gigantic end bosses that will blow your mind!<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>A prequel to the eventual sequel that bridges the storyline and ties up wandering ends.<br>\t\t\t\t\t</li><li>Overdose introduces a new character and storyline that examines the repercussions of Daniel defeating Lucifer in the original Painkiller!<br>\t\t\t\t\t</li><li>16 NEW levels of fast-paced pain-killing action!<br>\t\t\t\t\t</li><li>Six NEW demonic weapons grant the powers of a demi-god to souls awaiting damnation everywhere!<br>\t\t\t\t\t</li><li>Crafted and designed completely by Mindware Studios; long-time advocates and fans of the game.<br>\t\t\t\t\t</li><li>A reshuffled Tarot deck infuses Belial with new powers and devastating combinations.<br>\t\t\t\t\t</li><li>Over 40 demented and sickly-twisted monsters from Hell.<br>\t\t\t\t\t</li><li>New End Bosses of colossal statures standing guard over Hell's crumbling domain and the entrances to the other realms!<br>\t\t\t\t\t</li><li>A revitalized commitment to multiplayer introduces a series of stats tracking features and game server options intended to revamp the multiplayer experience.<br>\t\t\t\t\t</li><li>Multiplayer compatibility with original Painkiller multiplayer maps and game modes!</li></ul>"}, "3230": {"name": "Genesis Rising", "appid": "3230", "is_free": false, "publishers": ["THQ Nordic"], "detailed_description": "Three thousand years in the future, mankind has carved a bloody path towards domination of the known universe. Self-proclaimed as a divine race and beyond reproach as a species, they view all alien races as inferior. With fleets of organic starships genetically engineered for war, humanity sets out to conquer the last remaining independent galaxy - The Universal Heart. <br>\t\t\t\t\tAs Captain Iconah, you are commissioned to uncover the location and purpose of the Heart. Take command of a living fleet, altering your starship's DNA in real-time as you grant them new and powerful abilities. The Universal Crusade has just begun!<br>\t\t\t\t\t<ul class=\"bb_ul\"><li><strong>Unique space real-time strategy gameplay</strong> that immerses you in an epic crusade with a rich back story.<br>\t\t\t\t\t</li><li><strong>Non linear single player campaign</strong> comprised of over 30 branching missions.<br>\t\t\t\t\t</li><li><strong>Scalable RTS gameplay</strong>: Resource gathering, technology upgrades and combat are scalable for even the most novice RTS players.<br>\t\t\t\t\t</li><li><strong>Co-op mode </strong> allows two players to work together and control one fleet!<br>\t\t\t\t\t</li><li><strong>Customize all 20+ gene based organic ships</strong> with over 50 different weapons and abilities, giving you thousands of possible combinations to choose from when constructing a fleet.<br>\t\t\t\t\t</li><li><strong>Ship models morph in real time</strong> as genes are inserted, reflecting the choices that you make!<br>\t\t\t\t\t</li><li><strong>Make alliances</strong> with the many other non-player character alien races to secure their support and technology--or purge their resources!<br>\t\t\t\t\t</li><li><strong>Expand your genetic capabilities</strong> by invading enemy vessels, stealing unsuspecting technologies, and maximizing your gene bank's diversity.<br>\t\t\t\t\t</li><li><strong>Gamespy Multiplayer</strong> featuring 12-player support and many multiplayer maps on which to flex your dominance!</li></ul>"}, "3850": {"name": "BloodRayne 2 Demo", "appid": "3850", "is_free": true, "publishers": ["Majesco"], "detailed_description": "<p>BloodRayne is a dhampir, born from the unnatural union of vampire and human. Blessed with the powers of a vampire but cursed with the thirst for blood and a weakness to sunlight, Rayne is challenged with her most personal battle yet as she hunts down her siblings. They have banded together and pledged to carry on their father's legacy of creating a new era of vampire supremacy where humans are mere cattle. Rayne's siblings have created 'The Shroud,' a mysterious substance that will render the sun's lethal rays harmless to vampires. Now only BloodRayne stands between an unsuspecting humanity and a horrifying vampire dawn.</p>"}, "2340": {"name": "QUAKE II Mission Pack: Ground Zero", "appid": "2340", "is_free": false, "publishers": ["id Software"], "detailed_description": "<p>Take out the Big Gun sounded simple enough, except the Strogg were waiting. You, and a few marines like you, are the lucky ones. You've made it down in one piece and are still able to contact the fleet. The Gravity Well, the Strogg's newest weapon in its arsenal against mankind, is operational. With the fleet around Stroggos, 5% of ground forces surviving, and that number dwindling by the second, your orders have changed: free your comrades. Destroy the Gravity Well.</p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>New Enemies - The Stalker, Turrets, Daedalus, Medic Commander, Carrier, and the Black Widow.</li>\n\t\t\t\t\t<li>14 Entirely new levels and 10 new deathmatch levels.</li>\n\t\t\t\t\t<li>New Power-Ups - Deathmatch specific power-ups: Vengeance Sphere, Hunter Sphere, and Anti-matter bomb.</li>\n\t\t\t\t\t<li>New Weapons - The Chainsaw, ETF Rifle and Plasma Beam.</li></ul>"}, "2300": {"name": "DOOM II", "appid": "2300", "is_free": false, "publishers": ["id Software"], "detailed_description": "Let the Obsession begin. Again.<br />\r\n\t\t\t\t\tThis time, the entire forces of the netherworld have overrun Earth. To save her, you must descend into the stygian depths of Hell itself!<br />\r\n\t\t\t\t\tBattle mightier, nastier, deadlier demons and monsters. Use more powerful weapons. Survive more mind-blowing explosions and more of the bloodiest, fiercest, most awesome blastfest ever!<br />\r\n\t\t\t\t\tPlay DOOM II solo, with two people over a modem, or with up to four players over a LAN (supporting IPX protocol). No matter which way you choose, get ready for adrenaline-pumping, action-packed excitement that's sure to give your heart a real workout."}, "2400": {"name": "The Ship: Murder Party", "appid": "2400", "is_free": true, "publishers": ["Blazing Griffin Ltd."], "detailed_description": "<h1>Buy The Ship: Remasted and get The Ship: Murder Party FREE!</h1><p>You’ll now get <strong>The Ship: Murder Party for FREE when you buy, or own The Ship: Remasted</strong>. Oh buoy, what a deal! For those of you that already own The Ship: Remasted, make sure to update the game in your Steam Library to get access. Happy hunting!<br><img src=\"http://cdn.edgecast.steamstatic.com/steam/apps/2400/extras/Steam_Small_Capsule.jpg?t=1477665793\" ><br><a href=\"http://store.steampowered.com/app/383790\" target=\"_blank\" rel=\"noreferrer\"  id=\"dynamiclink_0\" >http://store.steampowered.com/app/383790</a></p><br><h1>Finding a Server</h1><p><strong>Ahoy Shipmates!</strong><br><br>Unfortunately the in-game server browser is no longer working.  However, players can connect to servers via the Steam Client &gt; View &gt; Servers (if you don't see The Ship you may have to restart the client).  Feel free to drop by the forums to chat about this and you can find a more detail explanation of the issues in our announcement:  <a href=\"http://steamcommunity.com/games/theship/announcements/detail/194000194554609687\" target=\"_blank\" rel=\"noreferrer\"  >http://steamcommunity.com/games/theship/announcements/detail/194000194554609687</a></p><br><h1>About the Game</h1><strong>This package includes a tutorial, The Ship Single Player, which introduces you to some gameplay mechanics and storyline, and The Ship Multiplayer where you can hunt and be hunted by other players.</strong><br><br>Please read our State of the Game announcement:  <a href=\"http://steamcommunity.com/gid/103582791430084264/announcements/detail/194000194554609687\" target=\"_blank\" rel=\"noreferrer\"  >http://steamcommunity.com/gid/103582791430084264/announcements/detail/194000194554609687</a><br><br>For PC gamers who enjoy multiplayer games with a bit of intelligence, intrigue and ingenuity, <strong>The Ship</strong> is a murder mystery alternative to traditional FPS multiplayer games.  Each player is given a Quarry to kill - and must evade their own Hunter in the process, all set on board a series of 1920s art deco cruise ships.<br><br>The Ship is owned by the mysterious Mr X and as one of many 'lucky' recipients of a free ticket you arrive on board The Ship to find there's a catch to your luxury cruise.  You are coerced into a brutal Hunt to indulge Mr. X's fantasies, under threat of death for not only yourself, but also your family. Your only chance to save yourself and your family is to play the Hunt and win.<br><br>Combining stealthy multiplayer action and a needs system, The Ship is a truly unique gaming experience.<br><br><img src=\"http://cdn.edgecast.steamstatic.com/steam/apps/2400/extras/The-Ship---Mr-X.jpg?t=1477665793\" >"}, "440": {"name": "Team Fortress 2", "appid": "440", "is_free": true, "publishers": ["Valve"], "detailed_description": "<h1>The Jungle Inferno Update</h1><p><a href=\"https://steamcommunity.com/linkfilter/?url=http://www.teamfortress.com/jungleinferno/\" target=\"_blank\" rel=\"noopener\"  >Play the all-new Jungle Inferno Campaign! </a><br><ul class=\"bb_ul\"><li> 1 new official map: Mercenary Park<br></li><li> 5 featured community maps: Mossrock, Lazarus, Brazil, Enclosure, and Banana Bay<br></li><li> 2 new official taunts: Yeti Punch and Yeti Smash<br></li><li> 5 new community taunts: The Dueling Banjo, The Jumping Jack, The Soviet Strongarm, The Russian Arms Race, and The Headcase<br></li><li> 2 community cosmetic cases with 20 items each<br></li><li> 2 new War Paint collections made up of community-made War Paints and official War Paints<br></li><li> 2 new War Paint collections filled with classic weapon skins being brought back for another tour<br></li><li> 4 new Pyro items: The Dragon's Fury, The Thermal Thruster (with a new kill taunt: The Gas Blast), The Gas Passer, and the Hot Hand<br></li><li> 1 new Heavy item: The Second Banana<br></li><li> Free contracts to earn the new Pyro and Heavy items<br></li><li> 36 campaign contracts</li></ul><a href=\"https://steamcommunity.com/linkfilter/?url=http://www.teamfortress.com/jungleinferno/\" target=\"_blank\" rel=\"noopener\"  ><img src=\"http://cdn.edgecast.steamstatic.com/steam/apps/440/extras/jungle_inferno_blog.jpg?t=1508547684\" ></a></p><br><h1>About the Game</h1><p><strong>\"The most fun you can have online\"</strong> - PC Gamer<br><br>\t\t\t\t\t\t\t\t\t <strong>Is now FREE!</strong><br><br>\t\t\t\t\t\t\t\t\t There’s no catch! Play as much as you want, as long as you like!</p><br>\t\t\t\t\t\t\t\t\t <p><strong>The most highly-rated free game of all time!</strong><br><br>\t\t\t\t\t\t\t\t\t One of the most popular online action games of all time, Team Fortress 2 delivers constant free updates—new game modes, maps, equipment and, most importantly, hats. Nine distinct classes provide a broad range of tactical abilities and personalities, and lend themselves to a variety of player skills.</p><br>\t\t\t\t\t\t\t\t\t <p><strong>New to TF? Don’t sweat it!</strong><br><br>\t\t\t\t\t\t\t\t\t No matter what your style and experience, we’ve got a character for you. Detailed training and offline practice modes will help you hone your skills before jumping into one of TF2’s many game modes, including Capture the Flag, Control Point, Payload, Arena, King of the Hill and more.</p><br>\t\t\t\t\t\t\t\t\t <p><strong>Make a character your own!</strong><br><br>\t\t\t\t\t\t\t\t\t There are hundreds of weapons, hats and more to collect, craft, buy and trade. Tweak your favorite class to suit your gameplay style and personal taste. You don’t need to pay to win—virtually all of the items in the Mann Co. Store can also be found in-game.</p><br>\t\t\t\t\t\t\t\t\t<a href=\"<a href=\"https://steamcommunity.com/linkfilter/?url=http://www.teamfortress.com/freetoplay\" target=\"_blank\" rel=\"noopener\"  >http://www.teamfortress.com/freetoplay</a>\"><img src=\"<a href=\"http://storefront.steampowered.com/v/gfx/apps/440/extras/page_banner_english1.jpg\" target=\"_blank\" rel=\"noreferrer\"  >http://storefront.steampowered.com/v/gfx/apps/440/extras/page_banner_english1.jpg</a>\"></a><br>\t\t\t\t\t\t\t\t\t"}, "1930": {"name": "Two Worlds Epic Edition", "appid": "1930", "is_free": false, "publishers": ["Topware Interactive"], "detailed_description": "... 300 years after Aziraal has been banished, a brother and sister are drawn into the conflict which has flared up between the Orcs and the free world. Kyra, the hero's younger sister, suddenly disappears in mysterious circumstances.<br><br>«<i>...If my family really belongs to the chosen ones, why then have we always been as poor as church mice? I have never given much credence to all the old stories about a relict in our family's possession - one which supposedly bannedAziraal, the god of the Orcs - they say that only those ofmy bloodwere chosen to safeguard the secret.<br>'Tis nothing but nonsense methinks – however, my sister Kyra always listened eagerly to the stories of the old ones... but she vanished several months ago... </i>»<br><br><strong>To all intents and purposes you're an unscrupulous bounty hunter and mercenary - but the search for your sister takes you back to your roots. </strong><br><br>At the beginning of your epic adventure, a mercenary task takes you to the far north - but you're also following up a mysterious lead at the same time - the first clue you've been given since Kyra's disappearance. You get a shock during a meeting with the delegates of a dark Brotherhood - your sister's kidnappers are indeed after your family's relict. Whether there's any truth in your family being chosen ones or not, the others obviously believe it - and if you ever want to see Kyra alive again, you'll have to act swiftly...<br><br><ul class=\"bb_ul\"><li><strong>Includes the original Two Worlds, plus the add-on Tainted Blood</strong><br></li><li><strong>OVER 90 NEW QUESTS:</strong> Journey even deeper into the world of Antaloor with over 90 new quests and eight new multiplayer maps<br></li><li>Soundtrack by Grammy Award Winner <strong>Harold Faltermeyer</strong></li></ul><img src=\"http://cdn.edgecast.steamstatic.com/steam/apps/1930/extras/TW_Awards_quer.png?t=1494402789\" ><h2 class=\"bb_tag\"><strong>FEATURES:</strong></h2><ul class=\"bb_ul\"><li><strong>STUPENDOUS LANDSCAPES:</strong> in a fantasy world where every inhabitant leads a separate dynamic life with realistic daily routines, your deeds will determine the fate of the strife-torn land of Antaloor. <br></li><li><strong>PLAYING FREEDOM:</strong> Two Worlds is not for those who don't like making decisions, because you'll often have to take one side or the other \u0097 an intelligent, networked reputation system for guilds and secret societies makes sure of that.<br></li><li><strong>KNIGHT, THIEF, MAGE OR ALCHEMIST:</strong> spectacular, dynamically-choreographed fights on foot or at full gallop. An absorbing alchemy system for creating individual potions and power-ups provides diversification - and carrying out break-ins in Sneak mode will have your nerves jangling! If this still isn't enough, try the sophisticated magic system...<br></li><li><strong>INTUITIVE INTERFACE AND INDIVIDUAL DEVELOPMENT OF ATTRIBUTES:</strong> you can experiment with all the character attributes and develop your skills as and when you like. An elaborate inventory system ensures that you always have a clear overview \u0097 no matter how hot the action gets. <br></li><li><strong>MASSIVE MULTIPLAYER INCLUDED:</strong> bustling towns are the trading centers and meeting points for several hundred players. Self-created characters fight gripping PvsP duels in Arena mode \u0097 or solve a series of exciting quests as allies.<br></li><li><strong>UPDATED GAME ENGINE:</strong> The brand new 1.6 engine update now included!</li></ul>"}, "4870": {"name": "Cossacks: Art of War", "appid": "4870", "is_free": false, "publishers": ["GSC World Publishing"], "detailed_description": "<p><strong>Cossacks: The Art of War</strong> – continues the history of the great battles of XVII–XVIII centuries, and introduces five new campaigns, two nations, some new units and much more. </p>"}, "4530": {"name": "Full Spectrum Warrior: Ten Hammers", "appid": "4530", "is_free": false, "publishers": ["THQ Nordic"], "detailed_description": "Sequel to the critically acclaimed, squad-based/real-time tactical combat game, Full Spectrum Warrior: Ten Hammers delivers the most authentic and realistic infantry combat experience ever. As Squad Leader, coordinate the actions of multiple infantry squads, leading them through over 12 levels of intense action. Utilize authentic combat tactics to command your squad as you battle enemies with an explosive arsenal of weapons, high-tech military equipment and new controllable mechanized units. New advanced squad controls give you more in-depth tactical command over your squad as you lead them through a variety of realistic combat missions. With all new multiplayer modes, go online and team up with a friend in two player co-op or go head-to-head with up to eight players through a variety of new adversarial and team-based objective missions.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li><strong>Innovative gaming experience </strong>- Combines intense squad based combat and real-time tactical action, delivering the most authentic and realistic infantry combat experience ever.<br>\t\t\t\t\t</li><li><strong>New Squad Controls </strong>- Independently controllable scout &amp; buddy teams, ability to give orders to one team while controlling another, and ability to enter buildings and position sniper teams.<br>\t\t\t\t\t</li><li><strong>Advanced reactive enemy AI</strong> that reacts realistically to combat situations.<br>\t\t\t\t\t</li><li><strong>Expansive, non-linear level design </strong> with multiple pathways to accomplish objectives.<br>\t\t\t\t\t</li><li><strong>New Multiplayer Experience </strong>- Full Spectrum Warrior style gameplay with both Co-op and Adversarial (Coalition vs. Opfor) online multiplayer modes.</li></ul>"}}